[{"author": "Pete Evans", "title": "Expecting higher rates in 2019? Don't bet on it just yet", "description": "After hiking rates five times since the summer of 2017, some say the Bank of Canada could take a pause", "url": "http://www.cbc.ca/news/business/interest-rate-hikes-1.4964689", "urlToImage": "https://i.cbc.ca/1.4966208.1546619774!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/poloz-canada.jpg", "publishedAt": ["Jan 06, 2019 4:00 AM ET", "2019-01-06T09:00:00.955Z"], "source": "CBC News", "content": "Ever since the Bank of Canada ratcheted its benchmark interest rate up in the summer of 2017, economists, policy-makers, central bankers (and, full disclosure, even yours truly) have been warning Canadians to expect more hikes to come as the era of virtually free money seemed to be coming to an end.\nSince then, the central bank has indeed hiked its benchmark rate five times, to its current level of 1.75 per cent, and as recently as few weeks ago, economists were still forecasting as many as three more hikes by the end of 2019.\nBut the outlook has changed so quickly that now a move in the opposite direction is becoming a real possibility — a rate cut.\nTrading in investments known as overnight index swaps suggests investors are no longer confident of even one more rate hike this year — never mind several, says Ian Pollick, head of North American rates strategy with CIBC.\n \"At present, there is not a single hike priced for 2019.\"\nBy Pollick's math, there's only about a 40 per cent chance of any sort of rate hike this year, and some in the market think a cut is on the table. \nIt's not difficult to see why. While the job market is chugging along, and inflation is holding steady around the two per cent level the bank likes to see, some dark clouds have started to form on the horizon.\nThe price of Canadian oil known as Western Canada Select briefly dipped below $15 a barrel this fall, a level that by some estimates costs Canada's economy as much as $100 million a day. While emergency moves to cap production by the Alberta government seem to have helped, there's no question crude's sudden swoon is hurting the oilpatch, and by extension the whole country.\nStephen Brown at Capital Economics predicts the slump in the world price of oil could be enough to take the wind out of Canada's economic sails, slowing GDP growth to just 1.5 per cent this year — well below the two per cent growth the Bank of Canada was forecasting as recently as October, when it nudged its rate up to where it is now.\nIn explaining its decision at the time, the central bank made it clear that, rather than following a predetermined path, its decision-making would be governed by hard data on how the economy was doing — things like, are consumers spending money on cars and houses? Are businesses investing? And how is the global picture for free trade looking?\nOn all fronts since then, the data since then has been \"unambiguously negative,\" as Brown puts it.\nDecember numbers showed that consumer spending rose by just 1.2 per cent in the third quarter, the worst pace in more than four years. Canadian car sales fell last year for the first time since the financial crisis, and the Canadian Real Estate Association says it expects home sales to fall to their lowest level in almost a decade this year.\nNot to mention escalating global trade tensions that seem to be getting worse by the day.\nAdd it all up, and the path to a rate cut has begun to emerge, Brown says.\n\"We would not be surprised if the Bank of Canada continues to argue that it needs to raise interest rates,\" he said. \"But as it becomes clear that the economy is performing worse than the bank anticipated, we expect the bank to drop this line and ultimately cut interest rates at the tail end of this year.\"\nTo be fair, that's far from a universal view. Arlene Kish, an economist with IHS Markit, agrees that the Bank of Canada won't feel any obligation to hike further if the data doesn't warrant it. But she notes that the dark clouds over parts of Canada's economy obscure blue skies elsewhere.\nWhile Alberta and Saskatchewan are definitely hurting, \"outside of the energy patch, business investment is robust, particularly in the tech sector,\" she notes. And the jobless rate plunged to a 40-year low in November, and stayed there in December even as more people joined the workforce.\nWhile the data probably isn't enough to warrant a hike when the bank meets next week, Kish is of the view that higher rates are still on the horizon. \"We are expecting fewer rate hikes this year than previously expected [but] two 25 basis-point hikes will be the most likely scenario this year,\" she said in an email this week.\nThat's not what the prognosticators are predicting south of the border.\nCIBC's Pollick notes that investors are pricing a chance of a cut into every single Fed meeting this year. \"It's classic end-of-cycle behaviour,\" he said in an interview.\nThe collapse in oil prices downgraded everyone's expectations for inflation, including bond traders who only want rate hikes if they work to prevent inflation from eating away at their returns over time.  \nCentral banks don't worry much about investor returns, and tend to set their rates to either cool down or heat up the economy as they see fit. But investors try to make money by predicting what they think the central bank is going to do, and right now they are betting that the U.S. Federal Reserve rate will be lower in May 2020 than it is today.\nIf inflation is headed lower, investors think interest rates have to follow suit, which is why trading in U.S. overnight index swaps has the market betting that the U.S. Federal Reserve rate will be lower in May 2020 than it is today.\nThe yield on a two-year government bond dipped to 2.38 per cent this week, less than the current Fed rate. That means investors think the central bank has to cut rates at some point, Historically, any time the two-year government bond rate slips below the Fed benchmark, a rate cut tends to quickly follow, as the chart below shows.\nAdd it all up, and the market is making clear that what was not long ago unthinkable is slowly becoming plausible.\n\"We've moved from two hikes in Canada to not even one,\" Pollick said, \"and from two hikes in the U.S. to cuts.\"\n\n\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1423118915761", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Fed leaves interest rates steady, says will be 'patient' on future hikes", "description": "Chairman Jerome Powell had been widely expected to hold rate steady after 4 hikes last year", "url": "http://www.cbc.ca/news/business/fed-interest-rates-1.4999021", "urlToImage": "https://i.cbc.ca/1.4867457.1539815325!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/usa-fed-reuters-rts22yxg.jpg", "publishedAt": ["Jan 30, 2019 2:03 PM ET", "2019-01-30T20:50:49.978Z"], "source": null, "content": "The Federal Reserve is keeping its key interest rate unchanged and signalling that it could leave rates alone in coming months given economic pressures and mild inflation. The Fed also says it's prepared to slow the reduction of its bond holdings if needed to help the economy.\nThe central bank said Wednesday that it plans to be \"patient\" about future rate hikes. Its benchmark short-term rate will remain in a range of 2.25 per cent to 2.5 per cent after having been raised four times last year. The Fed's key rate influences many loan rates for businesses and consumers, including mortgages.\nInvestors cheered the Fed's message after its latest meeting that it foresees no need to raise borrowing rates anytime soon even while the economy remains on firm footing. The Dow Jones Industrial Average, which had already been up strongly, surged about 200 points after the Fed issued its policy statement and was up about 430 points about an hour later.\n\"The situation calls for patience,\" Chairman Jerome Powell said at a news conference afterward. \"We have the luxury to be patient.\"\nThe \"decision will reinforce expectations that the Fed is almost done raising interest rates,\" Michael Pearce, senior U.S. economist, Capital Economics, said in a research note.\nThe Fed has been gradually reducing its bond portfolio, a move that has likely contributed to higher borrowing rates. But at some point, to avoid weakening the economy, it could slow that process or end it sooner than now envisioned. Doing so would help keep a lid on loan rates and help support the economy.\nOn Wednesday, the central bank said it's ready to use all its tools — including an adjustment to its bond portfolio — if it decided the economy needed more support.\nThe Fed's note of patience about rate hikes marks a reversal from a theme that Powell had sounded at a news conference after the Fed's previous policy meeting in December. Powell had appeared then to leave open the prospect of further increases soon. That message had sparked fears in financial markets that the Fed might tighten credit too aggressively this year.\nWith pressures on the U.S. economy rising — a global slowdown, a trade war with China, a nervous stock market — the Powell Fed is now signaling that it's in no hurry to resume raising rates. And with inflation remaining tame, the rationale to tighten credit has become less compelling.\nStill, the Fed is having to maintain a delicate balancing act because some gauges of the economy look healthy. The job market, for example, remains robust, with solid and steady hiring. And corporate earnings have so far been holding up in the face of the global slowdown and trade conflicts. Of the companies in the Standard & Poor's 500 that have reported results for the final three months of 2018, 77 per cent have delivered earnings growth that topped Wall Street's forecasts. Some, though, are lowering expectations for 2019.\nSince the Fed's December meeting, Powell and others on the Fed's policymaking committee have been clear in suggesting that they're in no rush to raise rates again after having done so nine times over the past three years. Besides invoking the word \"patient\" to describe the Fed's outlook toward future hikes, Powell has stressed there's no \"preset course\" for rate increases. The Fed, in other words, will tailor its rate policy to the latest economic data.\nIn its statement Wednesday, the Fed said, \"In light of global economic and financial developments and muted inflation pressures, the committee will be patient in determining what future adjustments\" to the Fed's interest-rate policy will be appropriate.\nThe Fed's decision was approved on a 10-0 vote.\n\n\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/thenational/bank-of-canada-keeps-interest-rates-steady-but-what-does-that-mean-for-you-1.4972639", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/listen/shows/fresh-air/segment/15663034", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1424813123788", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/gm-s-oshawa-plant-closure-and-benchmark-interest-rate-unchanged-business-panel-1.4976276", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Hike, cut or stand pat? Bank of Canada decides on interest rates today", "description": "No rate increase expected, but decision will offer glimpse of bank's thinking", "url": "http://www.cbc.ca/news/business/bank-of-canada-advance-1.4969951", "urlToImage": "https://i.cbc.ca/1.4970291.1546976365!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/bank-of-canada.jpg", "publishedAt": ["Jan 09, 2019 4:00 AM ET", "2019-01-09T09:00:00.805Z"], "source": "CBC News", "content": "The Bank of Canada isn't expected to change its benchmark interest rate when it reveals its latest decision Wednesday, but that doesn't mean the bank's policy-makers think nothing has changed in the country's economy.\nThe bank's rate, known as the target for the overnight rate, is the interest rate it charges retail banks for short-term loans, and it filters down into the rate that Canadian borrowers and savers get on savings accounts, lines of credit and variable rate mortgages.\nThe central bank will announce its latest rate decision at 10 a.m. ET. CBC News will have live coverage of the decision and a press conference that follows shortly after that.\nIn October, when the bank last raised its rate to its current level of 1.75 per cent, the central bank justified its decision by noting the various ways in which the economy was humming along. Inflation was on the high end of the range that the bank likes to see in setting monetary policy, and the job market was chugging along.\nThe price of a barrel of crude had fallen from its highs, but West Texas Intermediate was still trading north of $65 a barrel, and business investment was rounding into form, too. Add it all up, and the economy was on track to grow by about 2.1 per cent this year — enough to justify a modest tinkering of the bank's rate to more normal levels.\nBut that was then, and this is now.\nCanada's economy has since shown enough signs of weakness that there's speculation a cut may be coming sooner or later, and at a bare minimum economists who cover the central bank are downgrading their expectations of just how many hikes may be on the way.\nOn Tuesday, new numbers from Statistics Canada showed that Canada's trade deficit doubled to $2.1 billion in November, largely because oil prices plummeted, eating into the export side of the ledger.\nAnd according to Scotiabank economist Derek Holt, \"the window on trade conditions will get cloudier yet,\" as the U.S. government shutdown potentially affects December trade data and Alberta's production cuts take down energy exports in January.\nIf there's reason for optimism, Holt says, it's that the slowdown comes on the heels of a \"torrid\" pace for Canadian exports earlier in the year, so some declines were to be expected. \"One issue I'd like to hear the [Bank of Canada] address tomorrow is the extent to which they feel the recent data is due to … pulled forward export demand,\" he said. \nEconomist Avery Shenfeld with CIBC says the bank is in a tough spot, threading the needle between incorporating lowered expectations, and staying well clear of suggesting a cut might be required.\n\"We see the tone of the statement being along the lines of 'we'll get back to you later,' rather than 'we're all done here, people' in terms of further interest rate tightening,\" Shenfeld said, adding that he expects the bank to stay on the sidelines until April at the earliest.\nThat's a similar timeline to the one Robert Dent at Japanese investment bank Nomura Securities Inc. predicts, with a slight hike to two per cent in April followed by another cautious one at the end of the year.\nDent notes that despite some dark clouds on the horizon, Canada's economy is doing well on a number of other fronts, notably the job market, where the jobless rate dropped to the lowest level on record in November at 5.6 per cent, and even managed to stay there through December, too.\nThose data points will be factors the bank will consider, and a reason for the Bank of Canada to stay on the track it has already set for itself.\n\n\n\n\n\n\n\n\"The December statement suggests policy-makers remain confident that further rate hikes will be needed,\" he said, but \"the effect of rising interest rates on overly indebted households, persistently lower crude oil prices and slowing global growth all pose downside risks to the Bank of Canada outlook that may start to be acknowledged more forcefully at the January meeting.\"\nBank of Montreal economist Benjamin Reitzes says with the picture looking cloudy, the bank is clearly going to err on the side of caution, but the question is, how much?\n\"Outside of a couple of decent domestic data points,\" he said, \"the policy backdrop has deteriorated, driven largely by global economic and financial conditions. Accordingly, expect more caution from Governor Poloz and the Bank to stay on the sidelines for at least the next couple of months.\"\nWhile all but one of the 18 economists tracked by Bloomberg think doing nothing is the likeliest outcome, traders in investments known as overnight index swaps think there's about a one in six chance of a rate cut on Wednesday.\n"}, {"author": "Pete Evans", "title": "No change: Bank of Canada keeps benchmark interest rate at 1.75%", "description": "Central Bank has hiked key rate five times since summer of 2017", "url": "http://www.cbc.ca/news/business/bank-of-canada-rate-decision-1.4971176", "urlToImage": "https://i.cbc.ca/1.3220808.1441810633!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/bank-of-canada.jpg", "publishedAt": ["Jan 09, 2019 10:00 AM ET", "2019-01-09T18:19:03.403Z"], "source": "CBC News", "content": "The Bank of Canada kept its benchmark interest rate unchanged at 1.75 per cent Wednesday, despite a few dark clouds appearing on Canada's economic horizon.\nThe bank has raised its key rate five times since the summer of 2017, attempting to keep inflation in an acceptable range, typically between one and three per cent annually. The bank last raised its rate in October, before deciding to do nothing in December and then again today.\nThe bank's rate affects consumers by raising or lowering the rates that Canadian borrowers and savers get for lines of credit, savings accounts, and variable-rate mortgages.\nThe bank also downgraded its expectations for Canada's economy this year. A 25 per cent plunge in the price of oil since October has had a \"material impact\" on the economy, to the point where the bank is now forecasting just 1.7 per cent growth this year. Three months ago, it was expecting 2.1 per cent growth.\nBut despite that slowdown, the bank still indicated it plans to raise the rate again sooner rather than later. \"The policy interest rate will need to rise over time into a neutral range to achieve the inflation target,\" the bank said.\nAt a press conference following the announcement, Poloz said the slowdown in the oil sector is acute, but so far the impact is being offset by strength elsewhere in the economy.\n\"By all of our readings, something like 90 per cent of the economy is operating at capacity, having trouble finding workers, struggling to invest and to grow, and so on. So we have to pay a lot of attention to that, while at the same time acknowledging that the economy will always have the stresses of some form of something declining,\" he said.\n\"There are a whole lot of other things … going on out there that are actually doing very well,\" he said, adding that he expects the impact on overall GDP to be less than the oil slowdown in 2014 was, because the energy sector isn't as big a part of the Canadian economy any more.\nThat sentiment buoyed the loonie, which gained about a third of a cent to 75.73 cents US after the decision came out.\nLike just about every economist covering the bank, CIBC's Avery Shenfeld wasn't expecting the central bank to announce a hike on Wednesday, but he found the bank's rationale for its decision interesting nonetheless. \n\"Its message today suggests that it isn't quite as sure about when it will come off the sidelines and hike again,\" he said.\nStephen Brown with Capital Economics had a slightly more subdued take.\n\"The bank continues to think that further interest rate hikes are necessary, despite a host of factors that are weighing on the outlook,\" he said. \"But if we're right that oil and housing will be a bigger drag on growth than the bank expects, then further interest rate hikes are very unlikely and the odds of interest rate cuts will rise in the coming quarters.\"\nTD Bank economist Brian DePratto said that on the whole, the bank seems to be taking a cautious approach, but is still on a path to higher rates.\n\"The roller-coaster ride of the past few months has brought a note of greater caution to the Bank of Canada's communications, and today's decision looks to be an extension of that,\" he said. \n\"Governor Poloz and company still see more rate hikes down the road, but aren't in any great rush to get there.\"\n\n"}]