[{"author": "Pete Evans", "title": "Interest rates are plunging — so why aren't mortgage rates?", "description": "Bond yields and central bank rates have never been lower, but not all the savings are filtering down", "url": "http://www.cbc.ca/news/business/interest-rates-coronavirus-evans-1.5515884", "urlToImage": "https://i.cbc.ca/1.5516600.1585684340!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-applications.jpg", "publishedAt": ["Apr 04, 2020 4:00 AM ET", "2020-04-04T13:24:14.398Z"], "source": "CBC News", "content": "Central banks around the world have slashed their benchmark interest rates to pretty much zero in an attempt to stimulate the economy by making it as easy as possible to borrow, spend and invest.\nBut a curious thing is happening in Canada's mortgage market: rates aren't going down by as much as they probably should be. And in some cases, they're actually rising.\n\"Usually when the Bank of Canada cuts rates like they have, by 1.5 percentage points in a month, you can expect all rates to fall,\" said James Laird, president of mortgage brokerage CanWise Financial and co-founder of Ratehub.ca.\n\"At first they did ... but a week and a half ago, we started to see a shift [and] now we are seeing our lenders increase rates. Every two days, we get a different lender saying we are going up by point one, point two.\"\nMortgage rates tend to move up and down based on a number of factors, but one of the main ones is the costs borne by the lenders themselves.\nPeople tend to think that when someone walks into a bank to ask for a home loan, if they are approved, the bank just takes the cash out of some safe at the back, hands it over to the borrower and charges them interest over time to make a profit.\nBut, in fact, banks don't keep that much money just lying around either — they typically borrow it themselves and make money on the spread between how much they're charged for it and how much they turn around and charge the borrower for it.\nThe cost of financing a variable rate loan is strongly influenced by the Bank of Canada's benchmark rate, because banks tend to set their own prime lending rates based on whatever the central bank's rate is.\nThe bank has cut that rate by 150 basis points — 1.5 percentage points — in the past month to try to make it as easy and cheap as possible for people to borrow, spend and invest to stimulate the economy that has been waylaid by COVID-19.\nA few short weeks ago, it wasn't hard to find a variable rate mortgage for something around prime minus one — a full percentage point below whatever a bank's prime lending rate was at the time.\nBut a funny thing has happened since then. Prime lending rates have gone down more or less in lockstep with the Bank of Canada's moves, but those discount rates for mortgages have evaporated.\n\"About half of the savings have been passed along and half kept by banks for a higher margin,\" Laird said.\nThe reason they're doing that is the same as why stock markets plunged and governments rushed to implement lockdowns on millions of people: fear.\n\"Lenders are saying, 'Hold on a second,'\" Laird said. \"If a million people are going to lose their jobs and unemployment is going to rise, maybe we should build in a bit of a risk premium to our pricing to account for possible defaults for this new money we are lending.\"\nWhen the economic outlook was more clear, banks were happy to cut rates as low as possible to try to gobble up market share. But now, they're saying \"We better earn a bit more of a spread on this money because these things might default at a higher rate than we're used to,\" Laird said.\nThe impact isn't dramatic. Laird says a few weeks ago, the best mortgage rates were something in the range of between two and 2.5 per cent. Today, they're between 2.5 and three per cent because, as he puts it, \"they are demanding a higher risk premium than what they typically do.\"\nOthers aren't quite so diplomatic.\n\"It's total garbage,\" Marcus Tzaferis with mortage brokerage Cannect said. \"It's complete profit taking.\"\nWhile banks borrow at a rate slightly above that government rate, Tzaferis says \"the spread between their cost of borrowing and some of their five-year fixed mortgage rates is still around 250 points, which is highly profitable for them.\"\nFixed-rate loans aren't pegged to the Bank of Canada's rate and are instead more influenced by the bond market. And there, too, Tzaferis says what's happening in the market doesn't reflect what's happening behind the scenes.\nLenders finance fixed-rate loans on the bond market, where yields have fallen to record lows in the current COVID-19 crisis. The yield on a five-year government of Canada bond bottomed out at around 0.37 per cent this month and is currently hovering just over 0.5 per cent. \nThough banks must pay a credit spread on bond yield and that may be widening, Tzaferis says they are also widening their profit margins. Most fixed-rate mortgages are currently going for around three per cent, he points out.\nThe difference for borrowers adds up fast. Laird calculates that a theoretical buyer who put down a 10 per cent deposit on a house costing $500,000 before this crisis would likely have been able to get a mortgage rate of 2.6 per cent, which would make their payment $2,102 a month.\nIf all three rate cuts since then were to be fully factored into that loan, that borrower's monthly payment would fall as low as $1,769 a month — that's $333 per month or $3,996 per year on their mortgage payments, compared to what they were paying less than a month ago.\nThe overwhelming majority of first-time buyers opt for fixed-rate loans because they like the security of knowing that their monthly payment is guaranteed to not increase. The banks know this, Tzaferis says, and it could soon have a heavy cost for borrowers.\n\"They're using this as an opportunity to lock people into big fat juicy and profitable five-year mortgages,\" he said. \"When their rates drop those consumers are going to have massive penalties to break them ... tens of thousands of dollars.\"\n\"It's absolutely insanity,\" Tzaferis said. \"This is a totally manufactured crisis to profit.\"\nLaird and Tzferis both say that the current situation can't last forever. Economists are already predicting that the COVID-19 recession is likely to be incredibly sharp, but it's anyone's guess how long it will go on for.\nLaird says the best sign that things are getting back to normal will be when the big banks start to act in a way that seems paradoxical.\nBanks are raising their rates right now because they feel just as uncertain about the future as Canadians do. Once that cloud lifts, they'll want to start lowering rates again, and \"they won't build in that uncertainty premium like they are now,\" said Laird.\n\"As confidence returns, you'll see rates fall.\"\n"}, {"author": "Pete Evans", "title": "Why worries about the coronavirus are pushing mortgage rates down", "description": "Fear has pushed investors to buy up bonds, which is causing cheaper borrowing for home buyers", "url": "http://www.cbc.ca/news/business/coronavirus-mortgage-rates-canada-1.5443071", "urlToImage": "https://i.cbc.ca/1.5443215.1580239186!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/germany-dax.jpg", "publishedAt": ["Jan 29, 2020 4:00 AM ET", "2020-01-29T09:00:00.512Z"], "source": "CBC News", "content": "Economists are busy trying to calculate the potential economic toll of the coronavirus outbreak that's currently making its way around the world. But there's one marketplace that is already, quite unexpectedly, quantifying the full force of the bug: mortgages.\nRates for fixed- and variable-rate home loans are based on a variety of factors, but one of the biggest is the price that lenders have to pay to borrow money themselves.\nFor fixed-rate Canadian home loans, the benchmark that sets the price that consumer rates are based on is the five-year Government of Canada bond.\nInvestors who covet bonds like that one do so because they are perceived to be safe. Investors are willing to accept the relatively meagre returns that government debt offers because it's better than the alternative — losing money on whatever other, riskier investment they would have had to buy instead.\nCounterintuitively, the price of a bond and its yield move in opposite directions. So when appetite for bonds goes up, the amount they pay out goes down, because lenders don't have to offer quite as good a deal to find a buyer for their debt.\nThe price of bonds tends to increase when people are feeling fearful, a situation that certainly describes the state of affairs today amid a mysterious coronavirus emanating from mainland China that has killed more than 100 people and infected thousands more.\nThat fear is prompting investors to pour money into the safety of government bonds, and all that buying is pushing down the yield on that debt.\nAs recently as the start of the year, the yield on the five-year Canadian government bond was about 1.7 per cent. This week, it dipped as low as just above 1.3. In the staid world of bonds, a 40-point drop in a relatively short period is huge, and it's filtering down into the mortgage market.\nFixed-rate loans are highly influenced by bond yields, because a mortgage lender makes money on the spread between the bond rate and what they offer to consumers. If the five-year bond yield goes up, they can just pass that cost on to consumers. If it goes down, as it is now, the lender's cost of borrowing goes down, so they can turn around and lower their rates for consumers to drum up new business.\nThat's what seems to be happening.\nFixed-rate loans are falling, according to James Laird, CEO of mortgage broker Canwise Financial and co-founder of rate comparison website RateHub.ca. While specific rates will vary based on the borrower and what part of the country they're in, currently the best deal on offer for a five-year fixed loan is 2.64 per cent with a trust company and 2.74 per cent from a big bank. Barely a month ago, those rates would have been roughly 10 to 20 points higher.\nWhile bond yields have fallen by about 40 basis points in that period, that means lenders so far have only passed on about a quarter of those savings to consumers. But that is likely to soon change.\nLenders are always slower to pass on savings than they are to pass on added costs, Laird said, but they can only hold off for so long.\n\"If bond yields were up by 40 points, you can guarantee far more [lenders] would have changed rates and by a greater amount,\" Laird said. \"On the way down they're a little slower ... they enjoy thicker margins for a while.\"\nCoronavirus fears have really only sped up the process of a move toward lower rates that was already underway, he said.\nIn its policy decision last week, the Bank of Canada elected to keep its benchmark interest rate where it is for now. But by singling out concerns over the job market, international trade and other factors, it's clear the bank is leaning more toward rate cuts than hikes, Laird said.\nVariable-rate mortgages set their rates based on what the Bank of Canada is doing, not bond yields. And based on the central bank's last statement, traders think there's about an 80 per cent chance of at least one rate cut by the end of 2020. That means home buyers with variable-rate loans can expect some relief soon, too.\nThere's also some seasonality at play in all this. All things being equal, lenders like to hit the ground running on the busy spring home buying season, so Laird often sees rate cuts in mid-February or March, regardless of what bonds are up to. \nThe sudden impact of the coronavirus is just causing that to happen a little earlier and a little more dramatically than anticipated.\n\"It's not like rates were on the rise and the coronavirus caused them to do a U-turn,\" he said. \"I'd say this is another area which is putting downward pressure on bond yields, and therefore downward pressure on mortgage rates.\"\n"}, {"author": "Pete Evans", "title": "Canadian mortgage rates are falling as bond yields slide lower", "description": "Yield on 5-year government debt has dipped below 1.5%, lowest since 2017", "url": "http://www.cbc.ca/news/business/mortgage-rates-1.5070332", "urlToImage": "https://i.cbc.ca/1.5070772.1553541567!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-rates.jpg", "publishedAt": ["Mar 26, 2019 4:00 AM ET", "2019-03-26T19:41:11.873Z"], "source": "CBC News", "content": "What's bad news for some is good news for others, and Canadian mortgage-holders are the unexpected beneficiaries of some of the gloom that's hovering over Canada's economy.\nFixed mortgage rates have been falling precipitously in recent weeks, as the cost of financing those loans has gotten cheaper. Banks and other lenders get the money that they loan out in mortgages by borrowing it themselves on the bond market, and the yields on five-year bonds have been falling since late 2018.\nA five-year Government of Canada bond was yielding just 1.45 per cent on Monday. That's the first time the figure has been below 1.5 per cent since the summer of 2017. \nLast week, the yield curve on long-term lending versus short-term inverted, a rare event that has an uncanny knack for predicting recessions. (For a longer explanation on what an inverted yield curve means, read this.)\n\"There's all kinds of technical forces, and it is not necessarily the case that tomorrow we'll have a recession,\" CIBC economist Benjamin Tal said in an interview. \n\"However, the yield curve slowing down is a clear signal … we have to listen to. We have a conflict between the stock market, which is more optimistic, and the bond market which is more pessimistic.\"\nPut simply, bond yields are heading lower largely because investors think the prospects for the economy are looking dim, so they expect interest rates to start moving lower.\nLower bond yields are generally \"not a good sign from an economic standpoint,\" says Janine White, vice-president of rate comparison website, Ratesupermarket.ca, \"but it's great for mortgage borrowers.\"\nThat's because cheaper financing costs are allowing the banks to cut their mortgage rates to try to entice borrowers. CBC News reported in January that Royal Bank cut its five-year posted rate to 3.74 per cent, a move that rivals were expected to match.\nRoyal Bank has since cut that rate two more times, first by 10 basis points on March 1 and then by another 15 basis points on March 13. The bank's five-year fixed rate is now at 3.49 per cent, and other lenders are indeed following suit.\nTD Bank currently has a special five-year fixed rate of 3.49 per cent. Smaller lenders are even lower. Dominion Lending Centres is offering 3.29 per cent locked in for five years, while HSBC Canada has a special five year of 3.24 per cent at the moment. \nAbout three quarters of Canadian homeowners opt for the security of a fixed rate loans, Tal says, but the trend toward lower rates is happening in variable rate loans, too — albeit for different reasons.\nUnlike fixed rate mortgages which take their cues from the bond market, variable rate mortgages tend to move in conjunction with whatever the Bank of Canada is doing.\nAnd investors are betting that the central bank will soon be moving its rate down, not up. Investors in financial instruments known as overnight index swaps are pricing in zero chance of a hike this year, but about a one-in-five chance of a cut by July, and up to a 44 per cent chance by September.\nWhite says the variable-rate mortgage market is simply pricing in some of the negative economic indicators of late, including lower inflation and an anemic GDP number that showed Canada's economy actually shrank to close out 2018.\n\"There's an increased probability they will actually cut to try to fuel economic growth,\" White said, of her expectations for Canada's central bank.\nAnd economists are predicting the same thing.\n\"One of the biggest shifts that occurred in our quarterly March forecast was the removal of any further interest rate hikes from our outlook,\" TD Bank's chief economist Beata Caranci said in a note on Monday. \"We hit the stop button.\"\nVariable rates have not just stopped going up, they've shifted into reverse and gone down in some cases. Rates below three per cent are now common, both at the big banks and at alternative lenders.\nThe spring is always a key time in the mortgage markets. That's because the lion's share of home purchases happen in those months, so lenders try to compete as much as possible on rates to take as big a bite as they can of that business.\nGiven that, the sudden trend towards cheaper lending could well stick around for a bit, White says. \n\"Are we still going to be headed for interest rate increases in the next couple of years? Yes,\" she says. \"[But] for the rest of 2019 the prediction is that the variable rate is going to be stable and maybe has a chance of coming down.\"\n"}, {"author": "Robson Fletcher", "title": "Mortgages in arrears in Alberta hit highest rate since 2013", "description": "Rate seen as a 'lagging indicator' of the economy, driven largely by unemployment", "url": "http://www.cbc.ca/news/canada/calgary/alberta-mortgages-arrears-august-report-from-february-2019-data-1.5246010", "urlToImage": "https://i.cbc.ca/1.3378660.1565735145!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/foreclosure-sales.jpg", "publishedAt": ["Aug 14, 2019 5:30 AM MT", "2019-08-14T11:30:00.450Z"], "source": "CBC News", "content": "More and more Albertans are falling behind on their mortgage payments, according to new numbers from the Canadian Bankers Association.\nThe rate of mortgages in arrears has been creeping upwards for the past 10 months on record and reached 0.49 per cent in February, according to the association's latest data.\nThat's the highest it's been since early 2013.\nMeanwhile, in the rest of Canada, the rate of mortgages in arrears has been going down, hitting 0.24 per cent nationwide at last count.\nFreida Richer, a licensed insolvency trustee with Grant Thornton in Edmonton, says the data matches what she's been seeing with her clients.\n\"Although we've been on this road of economic recovery now for almost two years, I can tell you that from my discussions with a lot of hardworking Albertans, there was a continued sentiment that their households are still struggling and they're simply not able to recover as quickly as they had thought or hoped,\" she said.\nShe said some of the primary reasons people fall behind on their mortgages are job loss, poor money management and family breakups.\nDivorces can be especially devastating during a downturn in real estate, she noted, as many Alberta markets have seen in recent years.\n\"If the person left with a property has to sell it, it's a matter of time,\" she said.\n\"Are they able to continue to pay the mortgage payments, in the meantime, while they try to sell the property? And what would they be selling the property for? Usually at a discounted value than what they had anticipated.\"\nThe Canadian Bankers Association considers a mortgage to be \"in arrears\" when payments are overdue for three or more months.\n\"The continued slowdown in Alberta's oil and gas sector and its associated impact on employment is one of the main drivers behind the uptick in arrears,\" the association said in an email.\nThe rate of mortgages in arrears is widely seen in economic terms as a \"lagging indicator,\" the association added, meaning it trails behind other indicators, particularly the rate of unemployment.\n\"Given that our latest stats are as of February 2019, that would mean it would be reflective of what was happening in the Albertan economy in the second half of 2018,\" the CBA said.\n\"Recall that in Alberta, the unemployment rate increased from 6.3 per cent in May 2018, to 7.2 per cent in October 2018, which explains the uptick in mortgages in arrears in the latter half of 2018.\"\nThe mortgage-arrears data includes residential loans from BMO, CIBC, HSBC Bank Canada, National Bank of Canada, RBC Royal Bank, Scotiabank, TD Canada Trust, Canadian Western Bank, Manulife Bank (as of April 2004) and Laurentian Bank (as of October 2010).\n"}, {"author": "Pete Evans", "title": "'Pretty cheap money': Canadian mortgage rates falling to their lowest level in 2 years", "description": "Fixed and variable loans have gotten cheaper because costs for lenders are down too", "url": "http://www.cbc.ca/news/business/canadian-mortgage-rates-analysis-1.5164774", "urlToImage": "https://i.cbc.ca/1.5165054.1559841646!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/open-house-housing-realtor-real-estate-sign.jpg", "publishedAt": ["Jun 07, 2019 4:00 AM ET", "2019-06-07T08:00:42.434Z"], "source": "CBC News", "content": "House prices may be as high as ever in many parts of the country, but Canadian homebuyers are being offered some of the lowest mortgage rates seen in years as lenders battle to drum up new business.\nRates on a standard five-year fixed-rate mortgage have fallen to their lowest level in two years, according to rate comparison website, Ratehub.ca. \nBorrowers just about everywhere across the country can take their pick of offerings well below three per cent at the moment, says James Laird, the site's co-founder and president of mortgage brokerage, CanWise Financial.\nThat's partly for seasonal reasons, he says, in that the spring months are typically the best ones for home buying, as families try to get moved and settled before summer vacations and then the new school year sets in.\n\"Promotions are April, May and June … when all mortgage companies try to make sure they are on track to hit their annual targets,\" Laird said in an interview. \"Anyone who's behind at this point would be aggressive with the margins they're willing to fund mortgages at right now.\"\nAt the moment, Laird says he's seeing five-year fixed rates as low as 2.64 per cent for certain buyers, and even higher-risk borrowers can easily find a loan for 2.89 per cent. That's the lowest range since the summer of 2017, he says, and a big reason why is the bond market.\nUnlike variable rate loans which take their cues from the Bank of Canada's benchmark rate, lenders finance fixed-rate loans based on the rates they can get in the bond market. Essentially, they'll borrow money themselves at one rate, loan it out to a borrower at a higher rate and make money on that spread.\nSo current rock-bottom interest rates on fixed loans are no coincidence, considering the yield on a five-year Government of Canada bond dipped below 1.3 per cent this month. If a lender can borrow funds for as little as 1.3 per cent then turn around and make money by loaning it out for twice that rate, they have every incentive to keep offering those deals.\n\"The hard cost of funding these loans is going down,\" Laird said. \"And at the same time we are at the tail end of the most competitive market, when lenders fight for [business], so that's when they are willing to thin out their margins a bit to attract volume.\"\nVariable rate loans are also sliding lower, too.\nMost borrowers prefer the peace of mind of fixed rate loans, but lenders can tempt borrowers to variable rate loans with even better rates — even if they're only temporary.\nLaird says typically it takes a spread of about a full percentage point to entice most people to make the leap. Which is why those loans are even less popular than usual because that premium has almost completely vanished.\nHe says the best variable rate loans are about 2.65 per cent at the moment, which is barely better than the fixed rate, for a lot more risk.\nAnyone signing up for that loan today is \"assuming the Bank of Canada is going to be forced to drop their rate once or twice. That would be the only way to justify taking it,\" he said. The bank's benchmark rate is 1.75 per cent. \nTrading in investments known as overnight index swaps suggests investors think there's about a 50 per cent chance of a rate cut by the central bank this year — but two would be very unlikely, and never mind any more beyond that.\nLower rates could be good news for those who've already bought, too.\nA recent report by National Bank found that a little more than one out of every six mortgages in Canada is up for renewal this year, and as recently as January the bank was calculating that most of them could expect to be paying between 70 and 90 more basis points on their next loan than they were on their current one. (A basis point is 1/100th of a percentage point, so a jump of 70 basis points would be a loan that went from 3 to 3.7 per cent, for example.)\nBut thanks to the steep slide in mortgage rates since the start of the year, most people with loans up for renewal now have no need to fear a big jump in their rate when the time comes.\n\"With the recent drop in mortgage rates, those households will be renewing at rates barely above their previous ones,\" National Bank economist Matthieu Arseneau said.\nLaird doesn't see anything on the immediate horizon that could derail the era of lower rates, but he does think the federal election in October is worth paying attention to for how it relates to housing.\nHousing policy is bound to come up on the campaign trail, and he expects to hear a lot of talk about changing stress test rules and extending amortization periods in the coming months.\nBut until that happens, Laird's expectations for the mortgage market can be summed up succinctly: \"Pretty cheap money.\"\n"}, {"author": "Pete Evans", "title": "Royal Bank cuts 5-year fixed mortgage rate, others likely to follow suit", "description": "Biggest bank cuts benchmark rate by 15 basis points", "url": "http://www.cbc.ca/news/business/mortgage-rates-1.4981657", "urlToImage": "https://i.cbc.ca/1.1310332.1526660967!/httpImage/image.jpg_gen/derivatives/16x9_780/hi-mortgage.jpg", "publishedAt": ["Jan 17, 2019 9:13 AM ET", "2019-01-17T20:57:30.546Z"], "source": "CBC News", "content": "Canada's biggest bank has cut its five-year fixed-term mortgage rate, a move that other banks are likely to try to match in short order.\nRoyal Bank edged the rate on its five-year \"special offer\" mortgage down to  3.74 per cent, a cut of 0.15 percentage points.\nThough subtle, the move is likely to prompt similar actions by other major Canadian banks in the coming days, and it's actually overdue based on what's happening in the bond market, says Rob McLister, founder of mortgage comparison website RateSpy.com.\nBanks finance mortgages for consumers by borrowing money from bond investors, and then lending it out to mortgage holders at higher rates. Those borrowing costs to the bank started falling precipitously in the fall, a development that has yet to filter down to customers.\nIn November, a five-year government of Canada bond was yielding just shy of 2.5 per cent. A few days ago, that had fallen as low as 1.75 per cent, a drop of 75 basis points.\nRBC's cut is only 15 basis points, so with that spread still being wide by historical standard, more could be in the offing.\n\"Banks could've cut fixed rates weeks ago,\" McLister said. \"The reason they held out is because they can.\"\nAlternative lenders have already cut their rates, but since the big banks control about 90 per cent of the market, they can hold out longer.\n\"When people see materially better rates from non-banks online, it puts more pressure on the Big 6 to act,\" McLister said.\nThey're also cutting now because of the time of the year. December and January are the \"deadest\" period for home buying, McLister notes, so RBC could be trying to drum up business while things are slow.\nWhen asked what prompted the rate drop, an RBC spokesperson said a number of factors have impacted the Toronto-based bank's cost of funds.\nRBC says that includes the rate the bank pays in the bond market, increasing regulatory costs and market volatility.\nThe impact on consumers will be small, but could grow if it's the start of a trend.\nJames Laird, president of mortgage brokerage Canwise Financial, calculates a $400,000 mortgage at the old five-year fixed rate of 3.89 per cent would cost a homeowner about $2,080 a month. At the new rate, that monthly mortgage payment would drop to $2,048 — $32 a month cheaper or an extra $384 per year.\n\"RBC is the largest mortgage lender in Canada, so whenever they move their mortgage rates, we can expect that the other four banks will follow suit,\" Laird said.\nThe trend downward in fixed mortgages is even more interesting considering what's happening in the variable market, which is more pegged to the Bank of Canada's rate than the bond market.\nBecause variable rate mortgages are inching higher.\nRBC nudged the rate for its five-year variable mortgage to 3.55 per cent on Wednesday, up from 3.30 per cent.\n\"The current stable interest rate environment is causing lenders to reduce the discounts being offered on variable rate mortgages,\" Laird said.\n\n"}, {"author": "Rajeshni Naidu-Ghelani", "title": "Mortgages from big banks consistently cost Canadians more, says rate comparison site", "description": "LowestRates.ca says the big banks never offer the lowest mortgage rates on the market", "url": "http://www.cbc.ca/news/business/mortgages-big-banks-1.5014184", "urlToImage": "https://i.cbc.ca/1.3580895.1468628471!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/cmhc-risky-markets-20160427.jpg", "publishedAt": ["Feb 12, 2019 3:14 PM ET", "2019-02-12T21:09:30.066Z"], "source": "CBC News", "content": "Mortgage rates from Canada's big banks were consistently more expensive than those offered by smaller lenders last year, according to the latest findings from LowestRates.ca.\nThe financial product comparison website said the lowest rates offered by the \"Big Six\" — Royal Bank of Canada, Toronto-Dominion Bank, Bank of Montreal, Scotiabank, Canadian Imperial Bank of Commerce, and National Bank of Canada — were always more expensive than the lowest rates from smaller lenders.\nJustin Thouin, CEO of LowestRates.ca, said the big banks never offer the lowest posted rates on the market, and Canadians are not spending enough time researching rates before signing their mortgages, which could be costing them thousands a year.\n\"We compare prices when we do less costly things, like take a trip or buy a TV, but we don't shop around for rates for homes — one of the most expensive purchases we'll likely ever make — despite the fact that the money we can save on a vacation pales in comparison to what we can save on a mortgage,\" Thouin said in a statement.\nUsing RBC's announcement last month that it was decreasing its five-year fixed rate mortgage to 3.74 per cent as an example, the site said with the new bank rate, customers would pay $2,560 per month on a $500,000 mortgage, assuming that a down payment of at least 20 per cent was made to buy a home in order to avoid the CMHC insurance and a 25-year amortization period.\nBut, if customers in the same scenario got the best available five-year fixed rate mortgage from a smaller lender at 3.23 per cent, the monthly payment would be $2,426, according to LowestRates.ca. That's a difference of $134 a month, and would add up to $40,200 in savings over the course of a 25-year mortgage.\n\"Brokers and smaller lenders often drop their rates first to be more competitive, and banks are slower to implement changes, because they know they own the market,\" Thouin said. \n\"This will only change when Canadians realize they're being overcharged and begin to shift away from the banks, and that will only happen as we increase awareness about the alternative market.\"\nBanks account for nearly 60 per cent of all current home mortgages, according to a report from Mortgage Professionals Canada last month. Mortgage brokers took up almost 30 per cent of the market, while credit unions and others accounted for the rest.\nCBC News contacted all of the big six banks for comment on LowestRates.ca's findings.\nA spokesperson for National Bank said that many factors are taken into account and assessed — including each client's individual situation — before fixing a rate, and granting a loan.\nTD said they offered \"competitive rates,\" and flexible mortgage options to meet their customers' needs.\nThe remaining banks declined to comment.\n\n\n\n"}, {"author": "Mark Ting", "title": "Fixed vs. variable: mortgage rate predictions for 2019", "description": "On The Coast financial columnist Mark Ting says sometimes the best answer is both", "url": "http://www.cbc.ca/news/canada/british-columbia/fixed-vs-variable-mortgage-rate-predictions-for-2019-1.4983997", "urlToImage": "https://i.cbc.ca/1.4468717.1547837758!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/home-ownership.jpg", "publishedAt": ["Jan 20, 2019 6:00 PM PT", "2019-01-21T02:26:15.184Z"], "source": "CBC News", "content": "In the fall of 2018, many economists predicted that the Bank of Canada would increase interest rates three or four times in 2019, but that's no longer the case. The global economy appears to be slowing and rarely do central banks increase rates when an economy is struggling.\nAny slowdown in rate hikes would be welcome news for those holding a mortgage or loan linked to the prime lending rate.\nIf you are considering a fixed rate mortgage, there is good news for you as well.\nThis week, RBC announced a reduction in their five-year fixed mortgage rate.  Fixed rate mortgages are correlated to bond yields —  if yields drop so should mortgage rates. Bond yields have been dropping for a couple months now so it is nice to (finally) see mortgage rates following suit.\nA question that I am often asked is, \"Should I get a variable or a fixed rate mortgage?\"\nI use both.  \n\nFor my rental property, I prefer a variable mortgage. Not because of the reduced rate, but for the less punitive pre-payment penalty.\nBecause I never know when I'm going to sell my revenue property, I'd rather be in a mortgage that won't punish me too badly if I decide to sell before the end of my contract\nAnd historically, people save more money with a variable mortgage. That said, fixed-term mortgages offer price certainty.\nWhen rates started to increase in 2017, I decided to convert the variable mortgage on my principal residence into a seven-year fixed term mortgage. I'm okay paying a little extra for the added peace of mind. I have no intention of selling my home, so I don't have to worry about pre-payment penalties, and I have seven years worth of price certainty.\n\nAnother variable to consider when deciding on fixed versus variable mortgages is the promotions being offered by lenders.\nJust a couple of months ago, it was easy to get a variable mortgage at one per cent below the prime rate.\nThat's a significant discount and if the forecasters are right and Canada slows its pace of rate hikes — or even cuts rates — having a variable mortgage would have been the best choice.\n\nIf the forecasters are wrong, which they often are, and rates spike then you would have been better off with the price certainty of a fixed term. Unless you can predict the future, which the experts, including myself, cannot, it is hard to say which mortgage product is best for you.\nWith that said, it is time for my predictions.\nI would be surprised to see the Bank of Canada raising rates more than once in 2019. It also wouldn't surprise me if there were no, or even a cut in interest rates. It really depends on the extent of the slow down in housing and energy, and how these changes affect the overall economy.\nRates for fixed-rate mortgages are dropping and there is potential for further reductions, but I wouldn't count on it. Money can flow out of the bond market just as easily as it flowed into it. If that were to happen, bond yields and mortgage rates would rise.\nIf you are unable to decide on the best mortgage for you—hedge your bets and get both.  \nSay you have a $400,000 mortgage, put $200,000 in a variable and the other $200,000 in a fixed. It is a strategy that has worked for me in the past and is a lot less nerve racking than flipping a coin.\nThis column is part of CBC's Opinion section. For more information about this section, please read our FAQ.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/rbc-cuts-5-year-fixed-mortgage-rate-gillette-ad-targets-toxic-masculinity-business-panel-1.4985630", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1428941891638", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Pete Evans", "title": "CMHC to take more mortgages off banks' books to free up cash for loans amid COVID-19 crisis", "description": "Government had similar program in place during 2009 financial crisis", "url": "http://www.cbc.ca/news/business/cmhc-mortgage-program-1.5510802", "urlToImage": "https://i.cbc.ca/1.3668539.1467903263!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-rates-sign.jpg", "publishedAt": ["Mar 26, 2020 11:46 AM ET", "2020-03-26T16:31:10.768Z"], "source": "CBC News", "content": "The Canada Mortgage and Housing Corporation is expanding the number of insured mortgages it is willing to buy from banks to give the banks more freedom to lend out more money to consumers and businesses and keep the economy humming.\nThe taxpayer-funded agency, which backstops the vast majority of Canada's housing market by insuring the loans that finance them, announced earlier this month it was willing to take up to $50 billion worth of loans off of banks' books.\nOn Thursday, the CMHC announced it would expand that mortgage-buying program to $150 billion.\n\"This action will expand the stable funding available to banks and mortgage lenders in order to ensure continued lending to Canadian consumers and businesses,\" the agency said in a statement.\nMoving loans from banks to the CMHC helps the banks' books and allows them to free up cash that they can lend out to consumers and businesses while the COVID-19 pandemic is hitting them hard and threatening the overall economy.\nCanada's big banks have promised interest rate relief for up to six months to Canadian borrowers struggling to make their payments, but the CBC has reported that the fine print of those programs make it so that the deferred interest must be paid back at some point, which makes the loan longer and more expensive.\nCanada's big banks are being flooded by requests for payment relief by borrowers — to the tune of 213,000 requests so far, Bloomberg reported Thursday.\nThe head of the CMHC, Evan Siddall, is asking mortgage holders to not overload the system in order to make sure any relief goes to those who need it most.\nPlease leave rent/mortgage relief to those who need it most. Banks and mortgage lenders are struggling to keep up. And if you have a paycheque and can afford it, please pay your bills. This isn’t a amnesty/freebie for all. <a href=\"https://t.co/CHmYWxqAZL\">https://t.co/CHmYWxqAZL</a>\nIn terms of the agency's mortgage-buying program, CMHC says all of the pools of mortgages that would be transferred are already insured by the government anyway, so there's no additional risk to taxpayers from the transaction.\nOttawa implemented a similar program during the financial crisis. At that time, the CMHC ended up taking over about $69 billion worth of mortgages, about half the amount they were willing to take on.\n"}, {"author": "Pete Evans", "title": "Bank of Canada holds rate steady at 0.25% and hints it has no plans to go any lower", "description": "Bank expects economic activity to slow by as much as 30% from end of 2019", "url": "http://www.cbc.ca/news/business/bank-of-canada-rate-decision-1.5532829", "urlToImage": "https://i.cbc.ca/1.5521269.1585945243!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/health-coronavirus-canada-cenbank.jpg", "publishedAt": ["Apr 15, 2020 10:18 AM ET", "2020-04-15T17:31:02.906Z"], "source": "CBC News", "content": "After cutting it three times in barely a month, the Bank of Canada kept its benchmark interest rate steady at 0.25 per cent on Wednesday, despite an economic outlook that's looking more and more like one of the bleakest ones we've ever seen.\nThe central bank said in a release that it considers the current level of its rate to be its \"effective lower bound.\" That means the bank doesn't have any plans to cut the rate to zero or into negative territory, despite the uncertainty of the COVID-19 pandemic that has devastated Canada's economy.\nThe bank says it expects widespread lockdowns, layoffs and other drastic measures will have a dramatic impact on Canada's economy in the months ahead. The bank says it thinks economic activity in the period between April and June will be between 15 and 30 per cent lower than it was at the end of 2019.\n\"Despite a high level of uncertainty, these estimates suggest that the near-term downturn will be the sharpest on record,\" the bank said.\nWhile the bank is signalling it doesn't see a scenario where it would put its rate into negative territory, the bank says it is doing a lot of other things beyond interest-rate reductions to help support the economy.\nChief among them are various lending operations to financial institutions and asset purchases in core funding markets that the bank says have already amounted to $200 billion worth of support.\nThe bank expanded those measures on Wednesday by announcing it will soon start buying up even more bonds and other debts to help keep the economy running.\n\"The situation calls for special actions by the central bank,\" the bank said. \"To this end, the bank is furthering its efforts with several important steps.\"\nThe Bank of Canada announced last month that it would buy $5 billion worth of federal government debt every week in order to support the economy. On Wednesday, it said it would keep doing that but also buy up to $50 billion worth of provincial debt and up to $10 billion worth of corporate debt in order to ensure there is enough of what central bankers refer to as \"liquidity\"— a complicated term that boils down to the simple notion of making sure there is enough cash in the system to allow normal transactions to happen.\nBy buying up bonds from governments and companies and taking it off their books, the central bank is freeing up cash that those entities can then use to put to work in the real economy.\n\"This helps ensure that households and businesses continue to have access to the credit they need to bridge this difficult time, and that lower interest rates find their way to ultimate borrowers,\" the bank said.\nStrategist Andrew Kelvin with TD Bank thinks the move to extend liquidity help to provinces and corporations is a significant development.\n\"I don't think there was a problem in the provincial market or the corporate bond market, but the Bank of Canada just saw an opportunity to add more stimulus,\" he said. \"It's just another way of them injecting stimulus into the market.\"\nCentral banks cut their rates when they want to encourage borrowing to stimulate the economy. They raise them when they want to cool down inflation. The Bank of Canada's rate filters down into the economy by impacting rates on things like mortgages and savings accounts at banks. \nThe bank noting that its rate is as low as it can realistically go is a direct message to consumers, says James Laird, co-founder of Ratehub.ca and president of CanWise Financial mortgage brokerage.\n\"Consumers should not expect their rate to go any lower since the bank has reiterated that they are at their lower bound. The position of the bank is to leave the rate unchanged until the economic situation stabilizes.\"\nTD Bank economist Brian DePratto agrees that the bank is saying it can't plausibly cut its interest rate any more than it already has. But that doesn't mean it's going to sit on the sidelines doing nothing as the economy goes through the biggest downturn in decades.\n\"Further rate cuts may be off the table, but the bank clearly stands ready to scale up [bond] purchases as needed,\" he said.\nAlicia MacDonald with the Conference Board of Canada thought the bank's signaling that it would not put its rate down to negative territory was the right move to make. \"As interest rates approach zero, further rate cuts have a less stimulative impact...when weighing the small stimulative benefit against the feasible large cost to the financial sector, there is not a strong case for further cuts to the overnight rate at this point,\" she said.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/montreal/programs/daybreak/bank-of-canada-s-interest-rate-cut-1.5488331", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Canada's big banks cut credit card interest rates to ease coronavirus impact", "description": "Big Six will temporarily reduce credit card interest rates amid COVID-19 pandemic", "url": "http://www.cbc.ca/news/business/big-six-banks-credit-card-interest-rates-relief-covid-19-1.5522343", "urlToImage": "https://i.cbc.ca/1.5253932.1570659856!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/transunion-debt-report-20190820.jpg", "publishedAt": ["Apr 04, 2020 6:55 PM ET", "2020-04-04T22:55:15.561Z"], "source": null, "content": "Canada's Big Six banks all said they will reduce interest rates on credit cards to provide relief to customers affected by COVID-19 pandemic.\nBank of Montreal said on Saturday it will temporarily reduce credit card interest rates to 10.99 per cent for personal and small business customers receiving payment deferrals due to the outbreak. Bank of Nova Scotia announced the same change on Friday.\nThey joined Toronto-Dominion Bank, Royal Bank of Canada, National Bank of Canada and Canadian Imperial Bank of Commerce, who announced similar measures.\nTD Bank said it will cut credit card interest rates by 50 per cent for customers experiencing hardship, and Royal Bank said it will reduce the charges by the same extent for clients receiving minimum payment deferrals.\nNational Bank will reduce annual interest rates to 10.9 per cent for clients receiving three-month payment deferrals, it said.\nCIBC too will lower interest rates to 10.99 per cent on personal credit cards for users who request to skip a payment, the lender said.\nMost of the banks' credit cards charge interest between 19.99 per cent and 20.99 per cent on purchases.\nWatch: How to handle cash during the pandemic\nLast week, Prime Minister Justin Trudeau said his government had urged banks to help alleviate the burden credit card interest rates place on Canadians. This week's moves are the latest in a raft of relief measures offered by the banks to customers affected by the pandemic.\nThe banks unveiled a mortgage-relief plan two weeks ago to allow homeowners to defer or skip mortgage payments for up to six months.\nNational Bank said on Friday it will refund additional interest accrued on the deferred mortgage payments. The lender will also waive fees for transfers and stop payments on checks and pre-authorized debts, and will not charge overdraft fees on checking and high-interest savings accounts, it said.\nBMO said about 70,000 clients have taken advantage of its relief measures, and TD said the same number had applied for and been approved for mortgage payment deferrals.\nSince the mortgage-relief plan was announced, the banks have received nearly half a million requests that have been completed or were being processed.\n"}, {"author": null, "title": "Canada's big banks cut credit card interest rates to ease coronavirus impact", "description": "Big Six will temporarily reduce credit card interest rates amid COVID-19 pandemic", "url": "http://www.cbc.ca/news/big-six-banks-credit-card-interest-rates-relief-covid-19-1.5522343", "urlToImage": "https://i.cbc.ca/1.5253932.1570659856!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/transunion-debt-report-20190820.jpg", "publishedAt": ["Apr 04, 2020 6:55 PM ET", "2020-04-04T22:55:15.561Z"], "source": null, "content": "Canada's Big Six banks all said they will reduce interest rates on credit cards to provide relief to customers affected by COVID-19 pandemic.\nBank of Montreal said on Saturday it will temporarily reduce credit card interest rates to 10.99 per cent for personal and small business customers receiving payment deferrals due to the outbreak. Bank of Nova Scotia announced the same change on Friday.\nThey joined Toronto-Dominion Bank, Royal Bank of Canada, National Bank of Canada and Canadian Imperial Bank of Commerce, who announced similar measures.\nTD Bank said it will cut credit card interest rates by 50 per cent for customers experiencing hardship, and Royal Bank said it will reduce the charges by the same extent for clients receiving minimum payment deferrals.\nNational Bank will reduce annual interest rates to 10.9 per cent for clients receiving three-month payment deferrals, it said.\nCIBC too will lower interest rates to 10.99 per cent on personal credit cards for users who request to skip a payment, the lender said.\nMost of the banks' credit cards charge interest between 19.99 per cent and 20.99 per cent on purchases.\nWatch: How to handle cash during the pandemic\nLast week, Prime Minister Justin Trudeau said his government had urged banks to help alleviate the burden credit card interest rates place on Canadians. This week's moves are the latest in a raft of relief measures offered by the banks to customers affected by the pandemic.\nThe banks unveiled a mortgage-relief plan two weeks ago to allow homeowners to defer or skip mortgage payments for up to six months.\nNational Bank said on Friday it will refund additional interest accrued on the deferred mortgage payments. The lender will also waive fees for transfers and stop payments on checks and pre-authorized debts, and will not charge overdraft fees on checking and high-interest savings accounts, it said.\nBMO said about 70,000 clients have taken advantage of its relief measures, and TD said the same number had applied for and been approved for mortgage payment deferrals.\nSince the mortgage-relief plan was announced, the banks have received nearly half a million requests that have been completed or were being processed.\n"}, {"author": null, "title": "Changes to mortgage stress test rules good news for young home buyers, says P.E.I. broker", "description": "Broker says wiggle room will make a difference for people carrying extra debt", "url": "http://www.cbc.ca/news/canada/prince-edward-island/pei-mortgage-changes-trainor-1.5472793", "urlToImage": "https://i.cbc.ca/1.4868923.1539890950!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/housing-study-20180808.jpg", "publishedAt": ["Feb 23, 2020 10:41 AM AT", "2020-02-23T14:44:08.641Z"], "source": "CBC News", "content": "A P.E.I. mortgage broker says changes to Canada's stress test rules should open up the housing market to more young people. \nThe stress test was brought in two years ago to ensure potential home buyers would still be able to make their payments if their mortgage rate increased. \nTo qualify for a mortgage loan, buyers have to be able to afford payments at a rate two per cent higher than the Bank of Canada's average five-year-rate, which comes to about 5.19 per cent. \nBut starting April 6, lenders will instead use the average industry rate in that calculation.\nThat rate is currently more than a half a percentage point lower than the banks. So on a $200,000 mortgage, buyers would need to afford a payment of about $1,128 a month instead of $1,184.\nBroker Paul Trainor says that wiggle room will make a difference.  \n\"It will make it easier for people, especially younger people, to afford their first home,\" he said.\n\"Any person with a student loan debt, which seems to be the big problem with the stress test, they'll be the major beneficiaries because they've got that extra debt that, as we get older, we don't have the student loan debt. But that first-time home buyer has that. And when you make it harder, obviously they can't get into their first home.\"\nTrainor said under the arrangement, buyers will be able to qualify for more expensive homes as well. \nThe downside for buyers, he said, is that could cause home prices to increase. \"You're going to have more price increases because of that demand.\"\n"}, {"author": null, "title": "Interest rates made home buyers look beyond their comfort zone in 1979", "description": "Interest rate of almost 15 per cent drove property seekers to less desirable districts", "url": "http://www.cbc.ca/archives/interest-rates-made-home-buyers-look-beyond-their-comfort-zone-in-1979-1.5333736", "urlToImage": null, "publishedAt": ["Nov 02, 2019 8:30 AM ET", "2019-11-02T12:30:00.573Z"], "source": "CBC Archives", "content": "In the housing market of November 1979, there wasn't a lot of good news.\nAs the CBC's Fred Langan reported on The National, the mortgage rate had reached 14¾ per cent.\nHigh interest rates might have been great for those who had money sitting in the bank, but not so much for those shopping for a home. \n\"Some owners who have to renew their mortgages are selling their houses, because they can't afford the extra monthly payments,\" said Langan.\nAnyone in the position of taking out a loan for a mortgage, or renewing one, was feeling the strain.\nA monthly mortgage payment of $192, renewed at the current rate, was boosted to $245.\nPreviously, the mortgage rate had been 11 per cent.\nWendy Glaholt and her husband were looking for a house in the neighbourhood in which she grew up. But, said Langan, they were \"going to have to lower their standards because of high mortgage rates.\"\n\"We can't possibly buy in this area now,\" said Glaholt. \"We've got to look for cheaper houses in a different area, which is kind of disturbing because we really counted on this area.\" \nThe cost of taking on a new mortgage was even propelling some people to choose the mortgage first and the home it went with second. \n\"If a couple are looking for a house at a certain value, they tend to ask me more about the mortgage and financing than the house,\" said real estate agent Rob Burton. \nHis company featured listings whose chief attribute was a mortgage as low as 11¼ per cent, rather than such mundane concerns as location or number of bedrooms.  \n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1706560067565", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/ottawa/programs/allinaday/money-column-interest-rate-cut-1.5486004", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1707557955587", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "U.S. Federal Reserve leaves rates near zero as COVID-19 savages U.S. economy", "description": "Economists forecast sharpest downturn in U.S. history this quarter", "url": "http://www.cbc.ca/news/business/fed-renew-pledge-1.5548953", "urlToImage": "https://i.cbc.ca/1.5549076.1588173017!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/usa-economy.JPG", "publishedAt": ["Apr 29, 2020 12:00 PM ET", "2020-04-29T21:16:53.765Z"], "source": null, "content": "The U.S. Federal Reserve, which has pumped trillions in emergency funding into U.S. financial markets to stem the damage from the coronavirus pandemic, left interest rates near zero and repeated a vow to do what it takes to shore up the economy. \nThe central bank says the pandemic will \"weigh heavily\" on the near-term outlook and poses \"considerable risks\" for the medium term.\n\"The Federal Reserve is committed to using its full range of tools to support the U.S. economy in this challenging time, thereby promoting its maximum employment and price stability goals,\" the Fed said in a statement following a two-day policy meeting held via video conference.\nEarlier Wednesday, the Commerce Department reported the economy contracted in the first quarter at its sharpest pace since the Great Recession, ending the longest economic expansion in the nation's history.\nThat reflects a plunge in economic activity in the last two weeks of March, which saw millions of Americans seeking unemployment benefits.\nThe rapid decline in GDP has left economists bracing for a record slump in output in the second quarter.\n\"If the economy fell this hard in the first quarter, with less than a month of pandemic lockdown for most states, don't ask how far it will crater in the second quarter, because it is going to be a complete disaster,\" said Chris Rupkey, chief economist at Mitsubishi UFJ Financial Group in New York.\nPlunging consumer spending on the back of widespread stay-at-home orders to curb the spread of the virus helped drive a 4.8 per cent decline on an annualized basis in first-quarter gross domestic product. The economy, which grew at a 2.1 per cent rate in the fourth quarter, was in its 11th year of expansion, the longest on record.\nAn increasing number of U.S. states are reopening their economies or at least setting out plans for easing stay-at-home restrictions, leading to fears there could be a resurgence of infections over the coming months and a headache for the Fed as it seeks to estimate the swiftness of the economic recovery.\nWith so much uncertainty around the economic outlook, the Federal Reserve said it expects to maintain the target range for its benchmark overnight lending rate \"until it is confident that the economy has weathered recent events.\"\nThe statement reflects a sharp downgrade in the Fed's assessment of the job market, household spending, energy markets and the outlook for inflation since its last meeting in March, before most U.S. states had done much to curtail economic activity and put the brakes on the exploding outbreak.\nLast month, the Fed said only that it will keep rates near zero \"until it is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals.\"\nIt slashed rates to near-zero in March and rolled out a mix of new and refurbished crisis programs aimed at shoring up credit markets and backstopping companies and local governments reeling from forced shutdowns and sharp drops in revenue.\nFed Chair Jerome Powell held a news briefing following the meeting, and warned the economy will decline at an \"unprecedented rate\" in the current quarter.\nBut Powell also said the economy will pick up as lockdown restrictions are lifted and vowed the central bank would continue to support the recovery.\n\"[The Fed has] really put themselves in the forefront of trying to lead this recovery back,\" said Rick Meckler, partner at Cherry Lane Investments in New Vernon, N.J. \"They have been aggressive and probably are a big reason for some of the strength the market has shown even in light of some really negative economic news.\"\nThe market did rally on Wednesday. U.S. stocks surged following drugmaker Gilead Sciences' announcement that its drug remdesivir is showing promise as a potential COVID-19 treatment, giving a boost to the broader market and sending its shares up 5.7 per cent.\nThe Dow and S&P 500 are both within 20 per cent of their record levels, with the tech-heavy Nasdaq now within 10 per cent of its high.\nMeanwhile, the depth of the economic slowdown is starting to become clear, with more than 26 million people filing new claims for unemployment benefits since March 21. But the Fed and other analysts are still trying to get a handle on the likely shape of the recovery.\nMost U.S. states still have stay-at-home measures, though a handful are beginning to reopen even as cases of COVID-19, the respiratory illness that has killed more than 57,000 people in the United States, continue to grow.\nMany health experts have also begun to predict a seasonal resurgence of COVID-19 in the fall, whatever containment measures are put in place, raising the possibility that stay-at-home restrictions may need to be reintroduced, and with them, a new downturn in economic growth.\n"}, {"author": null, "title": "Why high interest rates were a problem for '80s renters, too", "description": "They didn't have mortgages, but their landlords did", "url": "http://www.cbc.ca/archives/why-high-interest-rates-were-a-problem-for-80s-renters-too-1.5501499", "urlToImage": null, "publishedAt": ["Apr 03, 2020 8:30 AM ET", "2020-04-03T12:30:00.428Z"], "source": "CBC Archives", "content": "It didn't matter if you owned a home or not -- high interest rates were a pain for everybody.\nForty years ago, The National was looking at why those higher interest rates were costing those who rented apartments more money.\n\"Like everything else, apartment rents keep going up and nowhere has that been more true than in Alberta,\" the CBC's Don Newman explained to viewers on April 3, 1980, back when he was reporting from the westernmost Prairie province.\n\"People moving from other parts of Canada to take advantage of the booming economy have kept the demand for apartments high -- and now spiralling mortgage interest rates are putting even more pressure on rents.\"\nSeveral factors were at play in Alberta at that time.\nOne was that an existing set of rent controls was coming to an end, which meant many tenants were scrambling for affordable digs.\n\"I think the times have gone by where you looked for something luxurious. It's just whatever you can afford,\" said Mary Harasim of Edmonton's Landlord and Tenant Advisory Board, whose name was misspelled on screen on The National.\n\"It's rather sad,\" she added.\nAnother co-existing factor was that the rising interest rates were becoming tough for homeowners, who were going to end up having to sell their homes and move to apartments themselves.\nNewman said \"real estate people\" believed interest rates were likely to rise further.\nWithin a few short years, the apartment market would completely change in Alberta, with renters having lots of choice after a punishing recession left many apartment units vacant in that province.\n"}, {"author": "Pete Evans", "title": "Bank of Canada makes emergency interest rate cut", "description": "Move comes on top of previous 50-point cut last week", "url": "http://www.cbc.ca/news/business/bank-of-canada-1.5497098", "urlToImage": "https://i.cbc.ca/1.4934852.1584134626!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/bank-of-canada-poloz-20181024.jpg", "publishedAt": ["Mar 13, 2020 2:20 PM ET", "2020-03-15T17:28:57.584Z"], "source": "CBC News", "content": "The Bank of Canada has made an unexpected rate cut, cutting the central bank's benchmark interest rate by 50 basis points to 0.75 per cent.\nThe central bank already cut its rate to 1.25 per cent at a previously scheduled meeting on March 4 to help counteract the impact of the coronavirus. Friday's decision takes that one step further.\n\"This unscheduled rate decision is a proactive measure taken in light of the negative shocks to Canada's economy arising from the COVID-19 pandemic and the recent sharp drop in oil prices,\" the bank said.\nUnder normal circumstances, the bank meets every six weeks to set its interest rate, and only takes action outside of those time frames when the situation calls for it.\nFriday's decision shows just how seriously Canadian policy-makers are taking the coronavirus situation. It's the first time the bank has moved its rate higher or lower outside of a scheduled meeting since the financial crisis in 2009.\n\"Pretty sure I've never seen that: a rate cut on a Friday afternoon,\" said Doug Porter, chief economist with the Bank of Montreal. \"Shows you just how unusual these times are to have the Bank of Canada to make an announcement like that at two o'clock on a Friday afternoon.\"\nThe bank's next scheduled rate decision is set for April 15, at which point the central bank says it will \"provide a full update of its outlook for the Canadian and global economies.\"\nPorter thinks the bank will indeed cut again, but likely not before that scheduled meeting. \"At this point, we're penciling in another 50-basis-point cut … which will take them down to 0.25, which is as low as we got during the financial crisis.\"\nThe bank's rate impacts the rates that Canadian savers and borrowers get for things like savings accounts and mortgages.\nWatch: Ottawa announces 'significant fiscal package' as COVID-19 spreads\nJames Laird, president of mortgage brokerage Canwise Financial and co-founder of Ratehub.ca, says anyone with a variable rate mortage can expect to feel the impact of the two 50-point rate cuts soon, if they haven't already.\n\"For every one per cent a variable mortgage rate drops, borrowers stand to save approximately $584 per year for each $100,000 of their mortgage balance,\" he said.\nAll things being equal, the bank raises its rate when it wants to cool down an economy that is overheating with high inflation. It cuts when it wants to encourage people to borrow, spend and invest.\nTD Bank economist Brian DePratto called the move \"a solid step in the right direction.\"\n\"Seemingly, every day this week has brought new challenges and negative headlines related to COVID-19,\" he said. \"A response was clearly required — and not only was one delivered, but it came with the promise of more to come.\"\nIndeed, Bank of Canada governor Stephen Poloz said the bank \"stands ready to adjust monetary policy further,\" but at 0.75 per cent, there is only so much room to cut.\nWhile the bank has other policy tools at its disposal, Poloz told reporters following the rate cut that he \"doesn't like the idea of negative rates that much,\" referring to the policy that other central banks have implemented, where their rates actually go below zero.\nNegative rates are \"very unlikely to be needed\" in Canada, Poloz said.\nThe global coronavirus pandemic has many worrying about what will happen to Canada's economy as workers are quarantined and trade routes grind to a halt.\nThe Royal Bank of Canada said Friday it expects Canada to go into a recession later this year.\n"}, {"author": null, "title": "Fewer homes on the market could mean bargains for buyers still on the hunt during COVID-19", "description": "Real estate market has slowed to a halt, leaving buyer's market during COVID-19 pandemic", "url": "http://www.cbc.ca/news/canada/calgary/brad-van-de-walle-josh-tagg-realtor-landlord-mortgages-1.5514064", "urlToImage": "https://i.cbc.ca/1.5119539.1556766415!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-sale-sign.jpg", "publishedAt": ["Mar 29, 2020 12:38 PM MT", "2020-03-29T18:38:55.484Z"], "source": "CBC News", "content": "Buying or selling a home in Alberta is becoming increasingly challenging.\nSome Alberta realtors are seeing sales plummet due to social distancing measures amid the COVID-19 pandemic, just when the spring market is normally heating up.\n\"My phone isn't ringing as much and there's really no showings,\" said Brad Van De Walle, a Calgary-based realtor who has been in the business for more than a decade. \"Realtors that I'm talking to are in tears because they don't know what they're going to do.\"\nSome clients are taking their homes off the market.\n\"Even with social distancing, we found a lot of people don't want their homes to be shown over fear the virus might come in their home,\" he said.\nSome realtors are turning to video conferencing or FaceTime calls to take clients inside a home, or only taking clients to vacant properties.\nIn the midst of the current slowdown, some people still need to sell quickly — and that could be good news for stable-income buyers.\nCalgary-based mortgage broker Josh Tagg said there are many factors to take into account such as unpredictable interest rates and the day-to-day uncertainty that comes with the pandemic.\n\"We will likely see a downward movement in prices, and we'll see sellers who really, really need to get out,\" Tagg said.\n\"As a buyer, you'd have a stronger negotiating position.\"\nWith open houses now banned, most listings are being marketed online, said realtor Steve Kabachia.\n\"We're definitely seeing higher traffic for people browsing online,\" Kabachia said. \"The number of people saying they're ready to buy is down a bit, but those that are ready to buy, they're really committed.\"\nKabachia said the increased online traffic means that for sellers, it's more important than ever to make sure a listing is well presented with staging and photos.\n\"We're seeing how important it is to have good quality photos,\" Kabachia said. \"Making sure that people who are looking online can see how the space works, the dimensions of the room, and how the space can be used.\"\nVan De Walle said the next 60 days will significantly impact the future of the market.\n\"The benefit of doing it now, is because people are fearful,\" he said.\n\"Like, look at the stock market. The reason why the stock market went down is because everybody went and pulled out their money. So, if people are sitting here and they have to sell their house and they're worried about not being able to afford it, you might be able to catch somebody and you might be able to catch a good deal right now.\"\n"}, {"author": null, "title": "Quebec lost 264,000 jobs to COVID-19 crisis last month", "description": "Quebec's unemployment rate rose to 8.1 per cent last month", "url": "http://www.cbc.ca/news/canada/montreal/quebec-job-numbers-unemployment-covid-19-1.5527589", "urlToImage": "https://i.cbc.ca/1.5502523.1584613186!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/closed-sign-coronavirus-covid-19.jpg", "publishedAt": ["Apr 09, 2020 10:50 AM ET", "2020-04-09T21:35:14.957Z"], "source": "CBC News", "content": "Quebec lost an estimated 264,000 jobs last month, shooting the province's unemployment rate up above eight per cent, according to Statistics Canada.\nThe agency's monthly labour force report, released Thursday, said the closest comparison to the sudden decline in economic activity and employment caused by COVID-19 was the 1998 ice storm, which affected Quebec and Ontario.\nIn all last month, Canada lost more than one million jobs. Economists had been expecting the figure to come in at around 500,000 jobs lost, which already would have been the worst month for job losses on record.\n\"The increase in absences the week of March 15 to 21 was more than eight times greater than that observed in 1998,\" the report said.\nQuebec's unemployment rate rose 3.6 per cent to 8.1 per cent, the largest increase in the country, followed by British Columbia, where the rate increased 2.2 per cent to 7.2 per cent, and Ontario, where it went up by 2.1 per cent to 7.6 per cent. \nQuebec also had the sharpest decline in employment in education, with 73,000 jobs lost. In Ontario, 25,000 jobs were lost.\nOn March 12, Quebec banned large gatherings. The next day, the province declared a public health emergency and announced closed schools, universities and daycares would close.\nBy midnight March 24, all non-essential businesses in the province were closed.\nThe COVID-19 crisis has led to the most sudden and severe impact in the labour market of all Statistics Canada's records, which date back to 1976, said statistician Andrew Fields. \n\"Typically, when we look at recessions in the past, they occur over many months or years even,\" Fields said. \"The 2009 recession didn't just occur in one month. The unemployment rate picked up over the course of two years.\"\nThe accommodation and food services industry saw the largest declines overall, which Fields says is not surprising because \"those were the earliest businesses to close.\"\nDavid Lefebvre of Restaurants Canada, a national service industry association, agrees that it's not a surprise.\nAccording to the association, about 10 per cent of restaurants in Quebec are already saying they won't be able to get back on their feet after the COVID-19 crisis — and Lefebvre says more are expected to join them. \n\"We think lots of jobs will come back, but not every job will come back,\" Lefebvre said.\n\"To have jobs, you need strong businesses, and we want as many to be able to weather the storm and be able to relaunch the economy and of course the food service sector in due time.\"\nSebastien Viau of L'Alliance de l'industrie touristique du Québec, a Quebec tourism association, says the timing couldn't be worse for a crisis to hit.\n\"It's just before the summer season where all the festivals are happening,\" Viau said.\nHowever, he's hopeful the industry will be able to bounce back.\n\"Tourism has always been part of the economy bouncing back. It could drive the economy more regionally, more locally,\" Viau said.\nThe association is already planning a relaunching strategy for when measures ease up. \n"}, {"author": null, "title": "Mortgages that pay you and savings accounts that don't — the new rules of low rates", "description": null, "url": "http://www.cbc.ca/news/business/mortgage-rates-feature-1.5464563", "urlToImage": "https://i.cbc.ca/1.5249952.1565974687!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/germany-markets.jpg", "publishedAt": ["Feb 14, 2020 3:15 PM ET", "2020-02-15T15:44:36.589Z"], "source": null, "content": "Imagine a mortgage that pays you the interest, not the other way around. Or a savings account where it's the bank, not the saver, who collects interest.\nWelcome to the upside-down world of ultra-low and negative interest rates that is taking hold in many parts of the world where economic growth has been sluggish. Now more than a decade old, economists think it could be a feature of the global economy for years to come and change the way people save and invest.\n\"This will mean that we must save more, work longer, and expect less,\" said Olivia Mitchell, an economics professor at the Wharton Business School at the University of Pennsylvania.\nThe latest chapter is the drop in interest rates on some bank deposits below zero as central banks, particularly in Europe and Japan, try to support the economy amid uncertainty about trade by making borrowing cheaper to spur spending and investment. Official data released Friday showed that Germany's growth ground to a halt at the end of last year.\nEconomists think there are also longer-term factors causing low rates, such as aging populations in rich countries and high rates of savings in China and other emerging economies.\nLow rates first hit in the wake of the global financial crisis. The U.S. Federal Reserve, Bank of England, Bank of Japan, and European Central Bank slashed rates close to zero. In 2014, the ECB went negative.\nUltra-low rates have helped push up stock markets to record highs, as vanishing returns on safe assets lead to a search for returns elsewhere. Pushing people to invest in riskier assets is part of the stimulus effect central banks are trying to impart. But there are also fears that very low rates can cause markets to bubble up, and crash back down with painful consequences. So far, the dire predictions haven't come true. The current bull market in U.S. stocks turns 11 years old on March 9.\nIn Germany, some banks are now telling companies and others with large amounts of cash that they must pay a rate on large deposits instead of accruing interest. The penalty typically applies to big accounts, such as more than 500,000 euros (about $727,000 Cdn), according to financial website Biallo.de. Banks are doing this because they themselves have to pay a 0.5 per cent penalty on deposits they hold at the European Central Bank. If banks can't find a home for depositor money, it winds up in their ECB holdings and results in their being charged.\nSmall depositors like individual consumers are so far not being charged on savings. The idea is politically toxic, especially in Germany.\nBut the low rate environment raises questions about preserving wealth, especially for those trying to save for retirement. German newsmedia are full of stories about \"penalty rates\"and criticism of the European Central Bank for, as they put it, expropriating savers.\nGerhard Michel, a financial coach in Duesseldorf, says people need to be aware that inflation eats away at savings even in more normal times, though people may be less aware of it when rates are above zero.\n\"If you look at it historically, people with savings accounts never had any kind of interesting performance,\" he said. \"The inflation rate ruins any returns on the government bond market or the savings market - and it has always been that way historically. What shocks people now is that people must say the word zero, or even negative, interest.\"\nMichel, who is 53, teaches his coachees about value investing, a more time-consuming approach that analyzes financial statements to look for companies the market may be underestimating.\nHis approach with his own money: \"I will buy stocks until the end of my days.\"\nFour trillion euros worth of government bonds of the 19 countries that use the euro now yield less than zero. Trillions more in Japanese and other government bonds trade below zero around the world. Even Greece, which defaulted on government bonds in 2012 and carries the highest debt load in Europe, was able to sell three-month notes at a negative rate.\nWhy, in fact, would anyone pay for the privilege of buying a bond?\nOne way of viewing the phenomenon is that the investor is paying for the safety of the investment. Or buyers may hope to sell the bond at a profit. That is possible if rates go even lower - as some analysts think they will.\nOn the positive side of the ledger, low or negative interest rates can make it easier for companies and consumers to borrow, stimulating economic activity. The European Central Bank says its policies created 11 million new jobs since 2013. In the U.S., home sales have picked up as mortgage rates have fallen to 3.7 per cent.\nNow, even some home buyers can get into the negative rates game.\nThe Danish bank is unusual in offering the negative rate, but mortgage rates for credit-worthy borrowers are also not far above zero in Germany. For instance, a 10-year mortgage with a large down payment can carry interest of only 0.7 per cent.\nIt's worth noting that real interest rates — in other words, when official and market rates are below the rate of inflation — have been negative at several points in history, such as in the 1970s, when inflation in the developed world ran into double digits.\nWhat's unusual today is that the actual quoted rates are below zero and that rates have been low for so long.\nInterest rates are always a tradeoff, says economist Adalbert Winkler, professor of international and development finance at the Frankfurt School of Finance & Management. \"Low real rates favour borrowers like mortgage holders at the expense of savers, and when rates rise it's the other way around.\"\n\"This is always the case when you have expansionary monetary policy and it doesn't make sense to deny that,\" he said.\nLow rates make it easier for governments to borrow and build infrastructure that can spur economic growth, although political pressures have meant that Europe's biggest economy, Germany, prefers to balance its budget than borrow. Other governments, such as Italy, are constrained by high debt.\nNegative rates have not yet appeared in the United States, but they could if the economy stumbles into recession, some economists say. The Federal Reserve would almost certainly cut the short-term rate to nearly zero, as it did for seven years beginning in the Great Recession.\nSince the U.S. 10-year yield is already very low by historical standards, at 1.6 per cent, it wouldn't take much to push it below zero, said Ryan Sweet, senior economist at Moody's Analytics. The Fed may try to prevent it from happening, possibly by selling Treasuries, but it's not clear they would succeed.\n\"We're not immune to it,\" he said. \"That's a kind of Alice in Wonderland-type world that we don't want to go into.\"\nSo far, Federal Reserve officials have downplayed the potential for negative rates in the U.S.\n\"That's not a tool we're looking at,\" Federal Reserve Chair Jerome Powell said Tuesday during a congressional hearing. He cited research that negative rates can hurt banks' profits and restrain their willingness to lend.\nThe German Economic Institute in Cologne studied multiple factors believed to cause low rates and concluded it's not just due to central banks but represents a longer-term trend. So low or negative rates could be around for years.\nWith that in mind, Mitchell, the professor, persuaded her two daughters to save 18 per cent of their salaries when they found their first jobs.\n\"We're in a very different capital market regime now than in the last 30 years,\" she said.\n"}, {"author": "Pete Evans", "title": "Ottawa unveils new mortgage stress test rules that will make it easier to pass", "description": "New rules will be in force as of April", "url": "http://www.cbc.ca/news/business/mortgage-stress-test-1.5467330", "urlToImage": "https://i.cbc.ca/1.5467396.1582053724!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-sign.jpg", "publishedAt": ["Feb 18, 2020 3:04 PM ET", "2020-02-20T19:59:49.770Z"], "source": "CBC News", "content": "Starting in April, the government will change the rules that cover mortgage lending in a way that should, in the short term at least, make it easier to qualify for a loan to buy a home.\nThe Department of Finance says that as of April 6, the so-called \"stress test\" for mortgages will be calculated in a new way.\nThe stress test was implemented in January 2018 as a way to let some of the speculation out of the housing market at the time. It does so by making sure borrowers will be able to pay down their debts even if rates move higher. A would-be borrower is tested against his or her ability to pay down the loan at a higher interest rate, and if the borrower fails the test, a lender isn't allowed to loan them money.\nThe rules had the effect of cooling the market, especially for first time buyers, which brought down prices in many markets because it shrank the pool of buyers.\nAt the time it was brought in, the benchmark was set at whatever the five-year posted rate at Canada's big banks is, which is currently at 5.19 per cent. But under new rules announced on Tuesday and set to be implemented in April, the new bar will be \"the weekly median five-year fixed insured mortgage rate from mortgage insurance applications, plus two per cent.\"\n\"This will ensure that people only take on mortgages that are appropriate for the situation, but it does mean the changes in the stress test will be there if the average … rates provided by the banks actually goes down or up,\" Finance Minister Bill Morneau said of the changes. \"It will actually adjust appropriately to dynamic market conditions.\"\nThe change tinkers with one of the major criticisms of the stress test in the first place, which was that the bar was set arbitrarily high. And non-bank lenders don't like that the stress test rules give the big banks even more control over the market than they already had. Sherry Cooper, chief economist at Dominion Lending Centres, says the banks would always drag their feet in changing their posted rates, no matter what was happening in the market, \"because it's the rate they use in calculating the penalty for breaking a mortgage,\" she said in an interview Tuesday. \"This takes the big banks out of it.\"\nJames Laird, co-founder of rate comparison website Ratehub.ca, says the industry will welcome anything that gives the big banks less power. \"The industry also did not like how the stress test rate didn't ebb and flow with real rates lowering or increasing,\" he said in an interview.\nPosted rates at Canada's big banks are often much higher than rates being offered in the real world and that gap has widened recently. It's not hard right now to find a fixed-rate mortgage for far less than three per cent, for example, despite the fact that four of Canada's five biggest banks have a posted rate of 5.19 per cent. (The fifth, TD, lowered its rate to 4.99 two weeks ago. Prior to that it was 5.34 per cent.)\nBen Gully, the assistant superintendent at banking regulator the Office of the Superintendent of Financial Institutions, said in a speech at the end of January that the watchdog was aware that the gap was a problem. \"The difference between the average contract rate and the benchmark has been widening more recently, suggesting that the benchmark is less responsive to market changes than when it was first proposed,\" Gully said. \n\"We are reviewing this aspect of our qualifying rate, as the posted rate is not playing the role that we intended.\"\nTuesday's rule changes are seemingly a result of that review and will have the effect of thinning out that gap — at least for now. That should make it easier to pass the stress test, and therefore easier to buy a home. Theoretically, that should help bump up prices because more people will be qualified to buy. \nA quick look at the numbers shows how.\nAccording to Ratehub.ca, the average rate for a five-year fixed term mortgage is currently 2.89 per cent. Under current rules, a borrower approved for that loan would nonetheless have their finances tested at the five-year posted rate of 5.19 per cent. If they don't pass the test, they can't get the loan.\nBut under the new rules, that same borrower would be tested at 4.89 per cent — a combination of their actual mortgage rate, plus two per cent. That's a difference of 30 basis points and though small it can add up to thousands more in purchasing power.\nLaird calculates that under the old rules, a buyer with an annual income of $100,000 with a 10 per cent down payment would have qualified for a mortgage at 2.89 per cent and could buy a home valued at $511,424 under today's stress test. Under the new rules, that same buyer can now afford $526,632 — that's more than $15,000 more purchasing power.\n\"It's going to be a welcome change for the mortgage industry and consumers,\" Laird said.\nCooper agrees with that assessment. \"All other things equal, it certainly boosts buying power,\" she said. \"And it's psychologically very positive.\"\n"}, {"author": "Jamie Malbeuf", "title": "Foreclosure rate steadily increasing in Fort McMurray", "description": "'There's a lot of homeowners that are very much underwater' as house prices drop", "url": "http://www.cbc.ca/news/canada/edmonton/fort-mcmurray-foreclosure-homes-1.5405220", "urlToImage": "https://i.cbc.ca/1.2001778.1513610921!/httpImage/image.jpg_gen/derivatives/16x9_780/w-foreclosure-cp-00072702.jpg", "publishedAt": ["Jan 05, 2020 8:00 AM MT", "2020-01-05T16:54:03.278Z"], "source": "CBC News", "content": "Fort McMurray saw about eight times more foreclosures on homes in 2019 than in 2015, new numbers from the province show.\nIn the 2015-16 fiscal year, there were 26 foreclosure statements of claim in Alberta's oilsands capital; in 2018-19, there were 220, according to data from Alberta Justice and Solicitor General. In the current fiscal year, there were 219 claims to the end of November.\nA drop in property prices and increase in insurance costs since the 2016 fire have put pressure on homeowners in the town. Many homeowners bought when prices were much higher and there were abundant jobs in the oil and gas industry.\nBut the work has disappeared, household incomes have dropped and many are walking away from their homes to seek opportunities elsewhere. \nForeclosure statements of claim are court documents, usually filed by a bank to begin repossessing a property from a borrower who has fallen behind on mortgage payments.\nThe process isn't complete until a judge rules and issues a foreclosure order.\nRyan Chernesky, founder of Calgary-based Alberta Foreclosure Stoppers, which helps people stave off foreclosure and get their finances back on track, says about 15 per cent of his business is coming from Fort McMurray, a community which accounts for 1.6 per cent of Alberta's population.\n\"I think the hard times are already here,\" Chernesky said. \"There's a lot of homeowners that are very much underwater and they're simply biding time, hoping the property market will increase.\"\nHe said some of his clients from Fort McMurray have seen their property value drop by 50 per cent. Even if they can sell, they get too little to cover the mortgage.\nCondo owners in the community are also struggling, said Chernesky, who owns two units in Fort McMurray. \nSoaring condo insurance rates help push Fort McMurray homeowner into bankruptcy\nChernesky, along with many others, has seen a dramatic increase in the cost of condo insurance and with the drop in value condos are becoming difficult to keep or sell. \nThe insurance premium on one of his condos jumped $150 a month. \n\"It's a real drain on my personal resources,\" said Chernesky. \"There are individual unit owners, they're getting foreclosed. They simply can't afford it.\"\nAccording to the Fort McMurray Real Estate Board, seven foreclosed homes were sold in Fort McMurray in the 2015 calendar year. That number grew to 178 by 2018. As of Dec. 11, 2019, 177 foreclosed homes were sold.\nAndrew Weir, realtor and director with the Fort McMurray Real Estate Board, said the number of foreclosures on the market at any one time over the last few years has been stable at around 100 units.  \n\"The market is a lot more balanced now than it was, and there's a lot less inventory out there,\" Weir said. \n\"Prices have fallen a lot, to the point where we are more in line with communities outside, throughout the rest of Alberta,\" he said.\nThose prices are now more affordable for potential homeowners, he added. Indeed, a 2018 market analysis found Fort McMurray is the most affordable place to buy a home in Alberta.\nWeir owns multiple properties in Fort McMurray, acquired over a number of years. \n\"It's been a ride, but I'm not pulling my hair out.\"\n\"As somebody that pays very close attention to the market ... when I look at the numbers they're not telling me as scary a story as what a lot of homeowners would believe it is.\"\nPaul McLeod recently moved from Fort McMurray to Lac La Biche because there wasn't enough work for his company Vancon Services Ltd. \nHe considered selling his downtown bungalow which he bought in 2011 for about $610,000, but figured he could get only half of what he paid. \n\"I would like to sell. Would I like to lose all that money? Absolutely not,\" McLeod said. \nHe's now renting out the home, but the income doesn't cover half of the monthly bills. \nHe said more of the commuter population needs to settle in Fort McMurray to bring more people into the market. \n\"It's about the oilsands turning around and providing workers with the living-out allowance in order to live back in the community,\" McLeod said. \n"}, {"author": null, "title": "Metro Vancouver housing market to see modest price growth in 2020 and 2021, predicts CMHC", "description": "Buyers and renters can expect price increases due in part to continuing population growth across the region", "url": "http://www.cbc.ca/news/canada/british-columbia/metro-vancouver-housing-market-to-see-modest-price-growth-in-2020-and-2021-predicts-cmhc-1.5333608", "urlToImage": "https://i.cbc.ca/1.5277359.1582646722!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/cmhc-housing-starts-20190809.jpg", "publishedAt": ["Oct 24, 2019 1:18 PM PT", "2019-10-24T20:18:19.443Z"], "source": "CBC News", "content": "The Metro Vancouver housing market will remain \"balanced\" over the next two years with home prices expected to increase in line with population growth, according to the latest housing market outlook report from the Canada Mortgage and Housing Corporation.\nHousing sales and prices have dipped recently as a result of multiple factors — including rising mortgage rates and new taxes — but the CMHC predicts that starting in 2020 and through 2021, there will be a modest increase both in prices and sales volume. \nAttached homes, condos and apartments priced under $700,000 are expected to generate the strongest demand because \"homes in this price range can be accessible to buyers making a purchase based on their income compared with properties requiring substantial equity for a down payment,\" says the report. \nThe report says housing starts are expected to remain high, especially multi-family homes, which currently account for 88 per cent of unit starts.\n\"As densification continues and affordability challenges remain, multi-family units will account for the vast majority of new home construction,\" said Eric Bond, CMHC's Vancouver senior specialist.\nEmployment in the region is expected to help drive the new home market as unemployment rates remain low and job vacancy rates high. The report suggests employers in the region may need to increase wages in order to attract and retain employees.\n\"Full employment and rising wages will both contribute to household finances and consumer confidence, which in turn support major purchases such as housing,\" said the report. \nRenters are unlikely to see much relief. The report says the tight rental market will continue, driven by the net gain of population into the region, which will push up demand and rents.\nThe CMHC's chief economist said international trade tensions are considered a downward risk to the Canadian housing market.\n\"Arrears rates are very low on mortgages and that's a very positive thing,\" said Bob Dugan. \"But the level of debt in Canada is high and should there be some sort of a shock that causes unemployment to rise or the level of employment to drop, that can really have an impact on the performance of loans.\"\n"}]