[{"author": null, "title": "Alberta Energy Regulator blocks sale of Shell assets over clean-up concerns", "description": "AER said it wasn't happy with how the deal would have split the liability for cleaning up the sites", "url": "http://www.cbc.ca/news/canada/calgary/aer-alberta-energy-regulator-pieridae-shell-canada-1.5570875", "urlToImage": "https://i.cbc.ca/1.5176373.1560540061!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_780/alberta-energy-regulator.jpeg", "publishedAt": ["May 14, 2020 7:28 PM MT", "2020-05-15T01:28:22.766Z"], "source": null, "content": "Alberta's energy regulator has cited clean-up concerns in blocking the sale of sour gas wells, pipelines and other facilities from an energy giant to a much smaller company.\nIn a decision released Thursday, the regulator said Calgary-based Pieridae Energy's attempted purchase of the southern Alberta assets from Shell Canada goes against the intent of environmental laws.\nThe issue was seen as a test case of the regulator's determination to avoid clean-up costs for energy facilities falling to the taxpayer.\nIn its written decision, the Alberta Energy Regulator said it wasn't happy with how the deal would have split the liability for cleaning up the sites, especially at a pair of gas processing plants. The terms of the sale would have had Shell responsible for existing contamination and Pieridae on the hook for future problems.\n\"The scope and extent of the contamination at the site is not well known and is not well described in the applications,\" the decision said. \"To date, the contamination at the sites has not been fully understood.\"\nWithout knowing that, the regulator said, it would be impossible to know which company would have been responsible for what.\nThe decision also said the company that made the mess should clean it up.\n\"Shell is the polluter,\" said the decision. \"The ... applications appear to request that the AER, by way of approval, override or at least significantly dilute Shell's obligations.\n\"The AER is of the view that it cannot, by way of approval, carve up and redistribute fundamental regulatory obligations in a manner that is contrary to or inconsistent with (the law).\"\nThe two companies agreed to the deal last summer. It involves 284 wells, 66 facilities and 82 pipelines in the southern Alberta foothills.\nIt came shortly after the regulator had promised a closer eye on such licence transfers to ensure purchasers are able to cover reclamation costs. At the time, Pieridae's market value was less than the price of the Shell assets and its stock value was less than a dollar.\nThe number of energy facilities left unreclaimed by struggling producers has boomed in recent years. As of May 14, Alberta alone had more than 10,000 unreclaimed wells, pipelines, facilities and sites.\nIn April, the federal government pledged $1.7 billion for such so-called orphan wells in Saskatchewan, Alberta and British Columbia, although they are supposed to be reclaimed by an industry-funded group.\nThe energy regulator said the two companies were free to restructure their deal and try again to get the licence transfers approved.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1725703235509", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "U.S. Senate intelligence committee chair steps aside during insider-trading investigation", "description": "FBI served search warrant for Sen. Richard Burr's phone as part of probe", "url": "http://www.cbc.ca/news/world/u-s-senate-intelligence-committee-richard-burr-1.5569669", "urlToImage": "https://i.cbc.ca/1.5569679.1589476408!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/virus-outbreak-fauci.jpg", "publishedAt": ["May 14, 2020 1:13 PM ET", "2020-05-14T18:49:06.561Z"], "source": null, "content": "Sen. Richard Burr, a Republican from North Carolina, temporarily stepped aside as chairman of the Senate intelligence committee on Thursday after the FBI served a search warrant for his cellphone as part of an ongoing insider-trading investigation tied to the coronavirus pandemic.\nSenate majority leader Mitch McConnell announced the move, saying he and Burr had agreed that it was in the committee's best interests.\n\"We agreed that this decision would be in the best interests of the committee and will be effective at the end of the day tomorrow,\" McConnell said in a statement.\nBurr had denied wrongdoing. He said he relied solely on news reports to guide decisions on stock sales, amid reports that he and other senators sold shares after private briefings on the risks of the coronavirus crisis.\nHe told reporters at the U.S. Capitol on Thursday he decided to step aside because he did not want the investigation to distract the intelligence committee from its work.\n\"I thought this was the best thing to do,\" Burr said.\nU.S. President Donald Trump, speaking to reporters at the White House before travelling to Pennsylvania on Thursday, said he was unaware that Burr was leaving his intelligence post.\n\"I know nothing about it — never discussed it with anybody,\" Trump said. \"That's too bad.\"\nFBI officials showed up at Burr's home with the warrant on Wednesday, two people familiar with the investigation said Thursday, marking a significant escalation into the Justice Department's investigation into whether Burr broke the law with a well-timed sale of stocks before the coronavirus caused markets to plummet. The people spoke on condition of anonymity because they were not authorized to discuss an ongoing investigation.\nThe search warrant was served on Burr's lawyers, and FBI agents went to Burr's home in the Washington area to retrieve the cellphone, a senior Justice Department official said. The decision to obtain the warrant, which must be authorized by a judge, was approved at the highest levels of the department, the official said.\nThe official could not discuss the ongoing investigation publicly and spoke to The Associated Press on condition of anonymity.\nThe Justice Department declined to comment. Burr's attorney did not respond to phone and email messages, but said in a statement last month that the law is clear that any senator can participate in stock market trading based on public information \"as Sen. Burr did.\" Attorney Alice Fisher said that Burr welcomed a review of the stock sales, \"which will establish that his actions were appropriate.\"\nBurr has denied wrongdoing but has also requested an ethics review of the stock sales. Burr is an amiable member of the Senate, and his quick call for an ethics investigation and willingness to co-operate with authorities appears to have bought him some goodwill among colleagues tapping down immediate calls for him to step aside.\nSenate records show that Burr and his wife sold between roughly $600,000 US and $1.7 million in more than 30 transactions in late January and mid-February, just before the market began to nosedive and government health officials began to sound alarms about the virus. Several of the stocks were in companies that own hotels.\nBurr was not the only lawmaker to sell off stocks before the market slide.\nSen. Kelly Loeffler, a new senator from Georgia up for re-election this year, sold hundreds of thousands of dollars worth of stock in late January and February, as senators began to get briefings on the virus, according to records. So did fellow Georgia Sen. David Perdue, another Republican lawmaker running for re-election, and also Republican Sen. James Inhofe of Oklahoma and Democratic Sen. Dianne Feinstein of California.\nSenators did receive a closed-door briefing on the virus on Jan. 24, which was public knowledge. A separate briefing was held Feb. 12 by the Senate health, education, labour and pensions committee, which Burr is a member of. It's unclear if he attended either session.\nIt's unclear who will take Burr's place. The next several Republican members in seniority are already chairs of other committees, though they could choose to switch.\nNext in seniority is Idaho Sen. James Risch, who told reporters on Thursday that he didn't know if he would keep his current perch as chair of the Senate foreign relations committee or move to the intelligence panel.\nFollowing him is Florida Sen. Marco Rubio, who heads the Senate small business committee. He said he wasn't aware that Burr was stepping aside and that the decision on who takes over the panel was up to McConnell.\nBurr's six-year term ends in 2023, and he does not plan to run for re-election.\nHe was first elected to the Senate in 2004 and chaired the Senate intelligence committee as the panel conducted its own investigation into Russian election interference in the 2016 presidential election. The committee recently issued a report supporting the intelligence community's conclusion that Russia had interfered on Donald Trump's behalf.\nThe Los Angeles Times first reported the search warrant.\n"}, {"author": null, "title": "Tesla loses $13B in market value after CEO Elon Musk tweets 'stock price is too high'", "description": "Subsequent share drop erased nearly $3B US from the value of Musk's stake", "url": "http://www.cbc.ca/news/business/elon-tusk-tesla-stock-too-high-tweet-1.5553109", "urlToImage": "https://i.cbc.ca/1.5553124.1588370113!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/elon-musk.jpg", "publishedAt": ["May 01, 2020 6:03 PM ET", "2020-05-01T22:51:55.658Z"], "source": null, "content": "Shares of Tesla tumbled nine per cent on Friday after CEO Elon Musk tweeted that the electric carmaker's high-flying stock was overly expensive.\n\"Tesla stock price is too high,\" Musk said on Twitter in one of several unusual messages, including ones quoting parts of the U.S. national anthem and that he would sell almost all his physical possessions.\nThe subsequent share drop erased around $13 billion from Tesla's market value and nearly $3 billion US from the value of Musk's stake. Still, shares remain up almost 50 per cent from the start of April.\nMore than two hours after the tweets began, Tesla had not responded to requests for comment. Twitter declined to comment. \nThe Wall Street Journal reported that Musk had responded to an email asking whether he was joking or whether his tweet was vetted by saying, \"No.\"\nTesla stock price is too high imo\nI am selling almost all physical possessions. Will own no house.\nMusk has a history of sending provocative tweets. In August 2018, he tweeted that he had secured funding to possibly take Tesla private at a big premium, which led a fraud case by the U.S. Securities and Exchange Commission.\nMusk settled by agreeing to pay $20 million US and have a Tesla lawyer pre-screen tweets with important information about the company.\n"}, {"author": null, "title": "How Canadians can interpret COVID-19's volatile effect on the stock market", "description": "Is it too soon to invest hope in the latest round of market gains?", "url": "http://www.cbc.ca/radio/costofliving/the-economy-with-a-capital-e-1.5542514/how-canadians-can-interpret-covid-19-s-volatile-effect-on-the-stock-market-1.5542515", "urlToImage": "https://i.cbc.ca/1.5496168.1587913387!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/aptopix-financial-markets-wall-street.jpg", "publishedAt": ["Apr 24, 2020 10:30 AM ET", "2020-04-24T14:30:00.920Z"], "source": "CBC Radio", "content": "The COVID-19 pandemic has sent stock markets on a roller-coaster ride since March.\nInvestors are seeing steep, historic drops — followed by multi-day rallies. They're not the only ones feeling the whiplash.\nSo Cost of Living host Paul Haavardsrud asks just how should we interpret the latest round of gains on the stock markets?\nClick \"listen\" at the top of the page to hear this segment, or download the Cost of Living podcast.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1729104451748", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "COVID-19 on P.E.I.: What's happening Thursday, May 14", "description": "COVID-19 has brought out the worst in some Islanders, says premier", "url": "http://www.cbc.ca/news/canada/prince-edward-island/pei-covid-19-thursday-may-14-1.5569155", "urlToImage": "https://i.cbc.ca/1.5540244.1587502213!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/lobster-fishing-season-stock-photos-2018.jpg", "publishedAt": ["May 14, 2020 7:10 AM AT", "2020-05-14T10:10:32.803Z"], "source": "CBC News", "content": "Some lobster fishermen are concerned about their ability to physical distance on boats.\nBridal shops are planning to reopen, now that rules have been changed to allow customers to try on clothes.\nPremier Dennis King said he is saddened and disappointed at the behaviour of some Islanders over the last eight weeks. He said while COVID-19 has brought out the best in many Islanders, it has brought out the worst in others.\nKing has laid out the basics of P.E.I.'s child-care plan.\nP.E.I. businesses say they are keen to reopen, but aren't sure what it's going to look like.\nThe P.E.I. Native Council says members are facing mental health, housing and other struggles through the pandemic.\nSome prominent P.E.I. restaurateurs say they are sure they will lose money this year, but they plan to open anyway.\nAnother 264 negative COVID-19 tests came back from Monday to Wednesday. The number of confirmed cases on P.E.I. remains at 27. All have recovered.\nWhat are the symptoms of COVID-19?\nCommon symptoms include:\nBut more serious symptoms can develop, including difficulty breathing and pneumonia, which can lead to death.\nHealth Canada has built a self-assessment tool.\nWhat should I do if I feel sick?\nIsolate yourself and call 811. Do not visit an emergency room or urgent care centre to get tested. A health professional at 811 will give you advice and instructions.\nHow can I protect myself?\nMore detailed information on the outbreak is available on the federal government's website.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1704849475631", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1709167171581", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1709170243575", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1708995139657", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/ottawa/programs/ottawamorning/coronavirus-and-the-stock-market-1.5482115", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1713828931570", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1703688771992", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1668997187803", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Hamilton realtor was first time stock market investor, 'then, the pandemic happened'", "description": "He's lost about $200 so far", "url": "http://www.cbc.ca/news/canada/hamilton/stock-market-covid19-1.5527376", "urlToImage": "https://i.cbc.ca/1.5521507.1585948545!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/financial-analyst-adviser-reviews-numbers.jpg", "publishedAt": ["Apr 09, 2020 8:21 AM ET", "2020-04-09T12:21:08.480Z"], "source": null, "content": "Adam George Palios knows a thing or two about investing in the real estate market.\nThe Hamilton-based realtor bought his first home nearly a decade ago. In the years since, he's renovated the property (in a bid to increase its value) and rented part of it out (to help cover mortgage costs). He's also helped countless clients make the most of their own real estate purchases.\nBut until very recently, stock market investing was a foreign world to him. \"If you asked me a month ago what an ETF (exchange traded fund) was, I'd have no idea,\" Palios says. \"Honestly, I was completely green.\"\nPalios waited to start investing until all he'd paid off all off his debts and had a substantial savings fund to withdraw from. Once he achieved both financial milestones, he enrolled in an investing crash course, and by the end of the program he'd outlined a plan for purchasing his first stocks.\n\"And then, the pandemic happened,\" Palios says.\nHe was wrapping up his last lesson when the country moved into a lockdown state and stock prices plummeted. He'd already settled on his investment criteria (no fossil fuel or mining companies; only companies with at least one woman on their board of directors; and special focus on companies building health-care or renewable energy technologies). After seeing how low stock prices had fallen, he finally took the leap: Palios purchased $5,000 in stocks.\nInvesting a solid chunk of cash in a market on the decline may feel like a risky move for many — and it's one that experts say isn't advisable for those who've been laid off or are currently taking financial hits. But for millennials with stable income streams, current market prices may offer an opportunity to scoop up quality stocks at low prices.\nPalios admits the value of the sum he put into the stock market has declined by about four per cent in the few weeks since doing so. But he's taking a long-game approach to investing and says he'll be happy if sees noticeable returns in five or ten years.\n\"It's not money, it's part ownership and shares of a company that currently is trading at a lower value than history tells us it's worth, so... I don't feel panicked when I look and see that my $5,000 that I transferred over is now only worth $4,800,\" Palios says.\nHe says investing as a first-timer is only advisable for those with the flexibility to take a similar approach. Anyone who's hoping to see returns within the next year or two should stay away from the stock market, which may remain volatile for the next couple years before rebounding again. He also suggests staying away from investing if you're still paying off debt or don't have the security of a built-up rainy day fund (both lessons were among the first he learned in his online crash course).\nToronto-based personal finance expert Barry Choi takes a similar approach. Buying stocks solely because they are \"on discount\" right now is not enough of a reason to take financial risks, especially as a first-timer, Choi says.\nHe suggests new investors start with diversified portfolios, like ETFs or mutual funds, and use dollar-cost averaging (continuing to contribute a fixed amount on regular intervals despite volatility in the stock market) to grow their assets over time. The latter approach is proven to work primarily because it prevents investors from making large lump-sum investments that are poorly-timed with stock market prices.\n\"Quite often people will see things that are 'attractive,' like bank stocks, airlines, and stocks that are near all-time lows but traditionally have been more valuable in the past,\" Choi says. \"Choosing which stock will be the next winner is like gambling.\"\nHe suggests a low-risk approach for first-timers and veteran investors alike in times of market turbulence. If you've been laid off or are facing financial difficulty and don't have emergency savings to turn to, there's no shame in reducing your contribution or selling your stocks off, even at a loss, Choi says.\nBut it's a decision that should be made with caution. If you're economically stable but prone to bouts of anxiety related to market turmoil, hastily selling shares is probably not the way to go. Instead, turn off the news, limit how often you check your portfolio, and find a way to stay distracted while riding the recession out.\n\"What we have learned is things will eventually rebound, Choi says. \"So once you are employed again or you've got the cash flow, as long as you keep investing on a regular basis, and you've got time on your side, then eventually your portfolio will go back up in value.\"\n\"As long as you're dollar cost averaging,\" Choi says. \"You'll probably come out ahead in the long run.\"\n"}, {"author": "Vera-Lynn Kubinec", "title": "Manitoba securities commission warns investors about letter exploiting COVID-19 stock market anxiety", "description": "Gold mining company named in letter says it’s not involved", "url": "http://www.cbc.ca/news/canada/manitoba/manitoba-securities-commission-investor-alert-covid-19-1.5528585", "urlToImage": "https://i.cbc.ca/1.5528624.1586471738!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/coronavirus-letter.JPG", "publishedAt": ["Apr 09, 2020 5:42 PM CT", "2020-04-09T23:08:52.522Z"], "source": "CBC News", "content": "Financial regulators are warning Manitobans about a letter delivered to mailboxes in what's being called an attempt to exploit fears of a recession related to the COVID-19 pandemic.\nThe Manitoba Securities Commission issued an investor alert Thursday \"warning the public to exercise extreme caution about aggressive promotion of Crestview Exploration Inc., a British Columbia gold mining company,\" an MSC release said.\nThe promotion came in the form of a letter sealed in a white envelope without a return address, marked in bold red letters, \"CORONAVIRUS AFFECTING MARKETS: READ NOW.\"\nCopies were delivered to homes in Manitoba, Saskatchewan, Alberta and B.C. this week, the MSC said.\nThe letter from someone describing himself as a \"stock analyst and geologist\" makes \"exaggerated claims about Crestview, predicting that its stock price 'will soar as the recession hits'\", the MSC said.\nThe regulator received complaints about the letter this week, said Jason Roy, a senior investigator with the MSC.\nCrestview Exploration, listed on the Canadian Securities Exchange and the Frankfurt Stock Exchange, issued a statement Wednesday saying it was not responsible for the letter.\n\"...To the best of the company's knowledge, no officers and or directors were involved in disseminating this letter,\" the statement said.\n\"Crestview has not paid any compensation nor has it requested for this analyst to endorse the company nor its stock.\"\nThe company urged investors to visit its website for up-to-date information about the company and its mining assets.\n\"Crestview advises all investors and potential investors to properly verify the information provided by any individual and or third parties regarding buy recommendations,\" the statement said.\nRoy told CBC News the MSC investigation is underway and it has not yet determined who distributed the letters. He said it hasn't determined yet whether the individual named in the letter uses a pseudonym.\nThe investigation will look into whether it's similar to a case of \"pump and dump\", Roy said.\nIn that scenario, the MSC says anonymous people talk up a stock they own, quoting supposed \"inside information\". When people buy into the hype and start buying the stock, its value shoots up.\n\"The original promoters sell their stock at the inflated price and the stock price soon drops. The rest of the group is left holding stock that is worth far less than they paid for it,\" the MSC explains on its investment fraud website.\nRoy said the MSC wanted to get a warning out to Manitobans while the investigation continues.\nOther provincial securities regulators including those in Alberta and B.C. have also issued warnings about the letters.\nThe securities commission underlined the importance of doing research before buying or selling an investment, adding that aggressive promotions \"may make false claims of large profits and baseless stock price projections,\" the MSC said. \n\"Most aggressive stock promotions in recent years have been done through unsolicited email or social media, but promotions delivered through the mail carry the same risks,\" the regulator said. \nThe Manitoba Securities Commission investor alert:\n"}, {"author": "Pete Evans", "title": "Oil plunge, coronavirus fears prompt panic selling on stock markets", "description": "Oil prices fall as much as 30 per cent; stock markets halted and bond yields plunge", "url": "http://www.cbc.ca/news/business/markets-stocks-oil-1.5490697", "urlToImage": "https://i.cbc.ca/1.3412591.1583762400!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/market-plunge-us-economy.jpg", "publishedAt": ["Mar 09, 2020 10:05 AM ET", "2020-03-09T20:36:05.851Z"], "source": "CBC News", "content": "The TSX had its worst day in decades on Monday as plunging oil prices caused investors already spooked by coronavirus to sell off just about everything.\nNorth American stock markets sold off heavily throughout the day, which had began with circuit breakers designed to slow down panic selling kicking in within minutes of opening Monday.\nThe NYSE, Nasdaq and TSX were all briefly shut down by automatic breakers that the stock exchanges have in place to calm down trading activity and allow cooler heads to prevail.\nAll hit what's known as a level 1 trading halt within minutes of opening on Monday morning. Such a halt automatically suspends all trading on the market for 15 minutes after a decline of more than seven per cent\nA level 2 halt is automatically imposed after a decline of 13 per cent, for another 15 minutes. If the decline hits 20 per cent, a level 3 halt comes in to shut down trading for the rest of the day.\nWhen the halts lifted, cooler heads were in short supply as the sell-off continued.\nThe TSX fared worse than just about anyone, with the benchmark index closing down more than 1,660 points, or more than 10 per cent, to 14,514. That's the worst day for the TSX since Black Monday in 1987 — worse than any single day during the financial crisis of 2009.\nIt also means that the TSX has lost more than 18 per cent of its value in less than a month, as the TSX was flirting with the 18,000-point level as recently as Feb. 20.\nThings were almost as bad in New York, too, as the Dow Jones lost more than 2,000 points, or almost eight per cent, while the broader S&P 500 lost 226 points, or 7.6 per cent of its value.\nEven the technology-focused Nasdaq fell by seven per cent.\n\"This is basically panic selling,\" said Peter Cardillo, chief market economist at Spartan Capital in New York. \"There's a lot of fear in the market and … it's an indication that a global recession is not far away.\"\nWall Street's so-called \"fear index,\" known as the VIX, which spikes during times of volatility, jumped by 14 points to 56.61. That's its highest level since 2009, during the financial crisis.\nThe panic started on Sunday evening after Saudi Arabia kicked off an all-out price war in the oil market, announcing it would be removing any production caps. That move sent the price of crude crumbling more than 25 per cent, and came on top of existing fears over the coronavirus currently spreading around the world.\nToronto-based money manager John Zechner called the sell-off \"a selling panic.\"\n\"It's a sell now and ask questions later kind of thing,\" he said in an interview. \"The probability of recession has gone up very dramatically.\"\nTSX was hit more than most stock exchanges because so many energy companies trade on the exchange. Canadian energy companies sold off hard. Suncor lost more than 17 per cent of its value. Cenovus closed down 51 per cent. MEG Energy closed down 55 per cent.\nBond yields in the U.S. and Canada fell to their lowest levels on record as investors fled for safety. Investors flock toward things like bonds because they are perceived to be safer than other assets, as governments are unlikely to default on their loans.\nAll that bond buying pushes up their price, which counterintuitively drives their yields down — because governments don't have to offer a very good interest rate to find a willing buyer for their debt.\nAt one point on Monday morning, the yield on the Canadian government's 10-year bond dipped below 0.3 per cent, its lowest level on record. That means a buyer of that bond is effectively willing to loan the government $1,000 for an entire decade, and is only going to get $3 a year for their troubles. With inflation factored in, they're actually losing money. But they are willing to accept that meagre return because it is preferable to other options where they think they'll do even worse.\nThe U.S. 10-year is telling a similar story, falling to a record low of 0.3228 per cent at one point on Monday morning\n\"The lower it does go, the more people are likely to panic even further,\" said Rick Meckler, a partner with Cherry Lane Investments in New Jersey. \"The more it goes down, the more people will be nervous about it.\"\n"}, {"author": null, "title": "TSX and NYSE closed for Good Friday but Asian stock markets rise", "description": "Oil loses ground again after producing nations still can't agree on production cuts", "url": "http://www.cbc.ca/news/business/markets-dollar-oil-friday-1.5529047", "urlToImage": "https://i.cbc.ca/1.5246630.1565796598!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/germany.jpg", "publishedAt": ["Apr 10, 2020 8:14 AM ET", "2020-04-10T12:17:07.064Z"], "source": null, "content": "Asian shares were steady in quiet Good Friday trading after Wall Street closed out its best week in 45 years thanks to the Federal Reserve's titanic effort to support the economy through the coronavirus crisis. The price of oil fell back after major oil-producing countries struggled to finalize a deal on output cuts.\nEuropean and U.S. markets are closed for Good Friday. The long weekend offers a respite from the drama that has wracked markets for weeks due to the coronavirus outbreak.\nIn Asia, Japan's Nikkei 225 index advanced, gaining 0.8 per cent to close at 19,498.50. In South Korea, the Kospi jumped 1.3 per cent to 1,860.70. Shares also rose in Taiwan, Thailand and Malaysia. But the Shanghai Composite index lost 1 per cent, to 2,796.63.\nOvernight, in Europe, the countries that use the euro currency agreed on measures that will help each other bear the burden of the costs of the crisis. The package of 500 billion euros (about $550 billion US) does not include, however, a more ambitious proposal to borrow money together.\nEarlier, the U.S. central bank announced programs to provide up to $2.3 trillion US in loans to households, local governments and businesses as the country tips into what economists say may be the worst recession in decades.\nThe Fed's actions completely overshadowed a government report that another 6.6 million people applied for unemployment benefits last week. Stock investors expected such dismal numbers, and some are looking ahead to a possible reopening of the economy.\n\"It looks like the Feds are on a mission to blow holes in every dam that stops the flow of credit. And it sure sounds like they have plenty more dynamite if needed,\" Stephen Innes of AxiCorp. said in a commentary.\nThe stock market is not the economy, and that distinction has become even more clear this week. For the week, the S&P 500 jumped 12.1 per cent, its best performance since late 1974.\nStock investors are continuously looking ahead to where the economy will be a few months or more in the future, which largely depends on the state of the coronavirus pandemic and on the mass shutdowns meant to contain it.\nOn Thursday, the S&P 500 rose 39.84 points to 2,789.82. The Dow Jones Industrial Average added 1.2 per cent, to 23,719.37, and the Nasdaq climbed 0.8 per cent to 8,153.58.\nWhile hopes are building that a plateau may be arriving for infections in several hotspots, it's not assured.\nThursday's gains were capped by another downdraft in oil prices, which have collapsed amid the coronavirus pandemic.\nBenchmark U.S. crude oil fell $2.33, or 9.3 per cent, to $22.76 per barrel after investors learned that Russia and members of OPEC had reached a preliminary agreement to reduce production by 10 million barrels a day. That is far short of what would be needed to offset the steep decline in demand because of the coronavirus shutdowns, said Dave Ernsberger, global head of commodities pricing at S&P Global Platts.\nBrent crude fell $1.36, or 4.1 per cent, to $31.48 per barrel.\nOPEC said Friday that approval of the proposal for gradual cuts in output hinges on gaining Mexico's agreement. The Group of 20 major economies will hold a teleconference Friday to further discuss global output.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1711059011900", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Stock market rally fizzles as oil turns negative again", "description": "TSX, Dow and S&P 500 all up by about three per cent early but gave up gains", "url": "http://www.cbc.ca/news/business/markets-dollar-oil-loonie-1.5524514", "urlToImage": "https://i.cbc.ca/1.5146859.1558630973!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/financial-markets-wall-street.jpg", "publishedAt": ["Apr 07, 2020 10:03 AM ET", "2020-04-07T23:09:46.452Z"], "source": null, "content": "A rally on Wall Street evaporated after the price of crude oil took a sudden turn lower, deflating gains in the energy sector. Major indexes ended slightly lower Tuesday after being up more than 3 per cent earlier. The market was coming off an even bigger gain of 7 per cent the day before. The rally faded after the price of U.S. oil flipped from a gain to a steep loss of more than 9 per cent.\nIt had otherwise been an ebullient day for markets worldwide following encouraging signs that the coronavirus pandemic may be close to levelling off in some of the hardest-hit areas of the world.\nEven though economists say a punishing recession is inevitable, the stock market this week has been looking ahead to when economies will reopen from their medically induced coma. A peak in new infections would offer some clarity about about how long the recession may last and how deep it will be.\nInvestors could then, finally, envision the other side of the economic shutdown, after authorities forced businesses to halt in hopes of slowing the spread of the virus. In the meantime, governments around the world are approving or discussing trillions of dollars more of aid for the economy.\nMany professional investors say they've been wary of the recent upsurge and expect more volatility ahead. Those concerns were borne out Tuesday, when the S&P 500 swung up, down, up, down and back up again through the day. It is nevertheless on track to eke out one of the few back-to-back gains for the market since the coronavirus outbreak caused it to start selling off in mid-February.\n\"We are still in what you would call the relief rally off of the prior low,\" said Sam Stovall, chief investment strategist at CFRA. He noted that this kind of a rally is common within deep bear markets, Wall Street-speak for when stocks decline 20 per cent or more from a peak.\n\"There's no guarantee that the worst is behind us, yet traders believe that at least there is some short-term money to be made,\" Stovall said.\nThe Dow Jones Industrial Average closed down 26 points after leaping 900 points at opening.\nIn Toronto, the TSX eked out a small gain of 21 points, after earlier having been up by as much as 450 points.\nOil prices have been even more volatile than the stock market in recent weeks as demand dries up for energy amid a global economy weakened by the coronavirus outbreak. Russia and Saudi Arabia have also been locked in a price war, refusing to cut production even as the world is awash in excess oil.\nPresident Donald Trump said last week that he hoped and expected the two sides could agree on production cutbacks, which helped prices spurt higher temporarily. But investors still aren't convinced they can reach a deal, and benchmark U.S. crude oil fell $2.45, or 9.4 per cent, to settle at $23.63 per barrel. \nOil from Canada's oilsands lost more than half its value, closing down $5 a barrel to $3.92.\nEarlier in the trading day, stock markets in Europe and Asia climbed before oil's downward shift.\nThey rallied after China, the first country to lock down wide swaths of its economy to slow the spread of the virus, authorities reported no new deaths over the past 24 hours. Many experts, though, are skeptical of China's virus figures.\nInvestors also see signals that the number of daily infections and deaths may be close to peaking or plateauing in Spain, Italy and New York. The number of daily deaths rose in New York, the centre of the U.S. outbreak, but other statistics were more encouraging, including the average number of people hospitalized each day.\nExperts say more deaths are on the way due to COVID-19, which has already claimed at least 76,000 lives around the world. The U.S. leads the world in confirmed cases with more than 369,000, according to a tally by Johns Hopkins University.\nMore economic misery is also on the horizon. Economists expect a report on Thursday to show that 5 million Americans applied for unemployment benefits last week as layoffs sweep the country. That would bring the total to nearly 15 million over the past three weeks. Analysts also expect big companies in upcoming weeks to report their worst quarter of profit declines in more than a decade.\n"}, {"author": null, "title": "COVID-19 comes for the stock market", "description": null, "url": "http://www.cbc.ca/radio/frontburner/covid-19-comes-for-the-stock-market-1.5491912", "urlToImage": "https://i.cbc.ca/1.3650797.1466799963!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/britain-eu-british-stock-markets-plunge-after-brexit-june-24-2016.jpg", "publishedAt": ["Mar 10, 2020 5:12 AM ET", "2020-03-23T17:46:33.351Z"], "source": "CBC News", "content": "It was a historically bad day for global markets. The twin factors of COVID-19 and a collapse in the price of oil led to widespread panic and one of the worst days in the stock market in years, with consequences still to come.\nWhat just happened, and why are people freaking out? Manulife global chief economist Frances Donald is here to explain.\nSubscribe to Front Burner on your favourite podcast app.\n \n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/edmonton/programs/edmontonam/rrsps-after-the-stock-market-plummet-1.5492431", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/covid-19-comes-for-the-stock-market-1.5492060", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1709299267778", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1708858435532", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/covid-19-and-large-gatherings-stock-market-volatility-1.5492946", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/thenational/stock-markets-plunge-with-coronavirus-spread-1.5479215", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/british-columbia/programs/onthecoast/january-9-2020-stock-markets-1.5421725", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1703024707694", "urlToImage": null, "publishedAt": null, "source": null, "content": null}]