[{"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1737553475798", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1736889411699", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Bartley Kives, Jacques Marcoux", "title": "Despite bleak job losses, Manitoba possesses Canada's sunniest pandemic employment picture", "description": "COVID-19 is hammering Manitoba, but effective unemployment is worse in every other province", "url": "http://www.cbc.ca/news/canada/manitoba/manitoba-jobs-economy-analysis-1.5565090", "urlToImage": "https://i.cbc.ca/1.5565438.1589240291!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/winnipeg-open-again.jpg", "publishedAt": ["May 12, 2020 5:00 AM CT", "2020-05-12T10:00:00.411Z"], "source": "CBC News", "content": "The loss of jobs over the past two months in Manitoba has created the most bleak employment picture since the Great Depression of the 1930s.\nNonetheless, Manitoba is doing better than anywhere else in Canada based on key labour statistics.\nBetween February and April, the province lost nearly 84,900 jobs, most of them at retail stores, wholesalers, restaurants and hotels, Statistics Canada reported Friday as part of its monthly labour survey.\nThat 84,900 figure includes Manitobans who are unemployed as well as those no longer considered part of the workforce because they're unable to look for work — either because their industries don't exist at the moment or they must stay home to care for kids or other dependents.\nEconomists used the term \"effective unemployment\" to describe the number of conventionally unemployed workers plus former workers who can't even look for jobs due to the pandemic.\nEffective unemployment was 23 per cent in April in Manitoba, lower than in any other province.\nEffective unemployment paints a more complete picture than unemployment on its own, said Trevor Tombe, a University of Calgary economist.\n\"Because there are many people who are not counted as technically part of the labour force because they're out of work and not looking, we need a broader measure to truly get a sense of scale here,\" Tombe said in an interview.\nWhile there's nothing positive to be gleaned from the knowledge one in four working-age Manitobans were forced on to the sidelines in April, every other province fared worse.\nEffective unemployment hovered around 30 per cent in most provinces and approached 40 per cent in both Quebec and Newfoundland & Labrador.\nManitoba also did relatively well in two other measures of employment carnage. This province experienced the smallest percentage decline in Canada in total working hours between February and April.\nThe total hours worked in Manitoba dropped by 19 per cent over the two-month span. The loss of hours in other provinces ranged from 22.2 per cent in Saskatchewan to 36.4 per cent in Quebec.\nThe average Manitoban worker also lost fewer hours than the average worker in other provinces. The average working-age Manitoban spent 6.9 per cent fewer hours at work in April than they did in February. \nIn the rest of the country, the average worker lost anywhere from 11 per cent of their hours in Saskatchewan to 21.8 per cent of their time on the job in Quebec.\nTo be clear, these are flimsy silver livings. Still, Manitoba's relatively strong employment showing compared to the rest of the country demands examination.\nThere are a number of potential explanations.\nFor starters, Manitoba reported very few cases of COVID-19 during the initial weeks of the pandemic and relatively few cases compared to its population overall.\nGiven how disruptive the illness is — demanding quarantines and shuttering workplaces — it makes sense to see Manitoba's relatively favourable economic picture mirror its public health outcome.\nIt's also plausible the nature of Manitoba's economic shutdown threw fewer people out of work. While some provinces banned all non-essential business, Manitoba allowed retailers to continue operating with curbside pickup.\n\"Our lockdown wasn't as comprehensive as others,\" said Phil Cyrenne, a University of Winnipeg economist. \"I think that should help us in general.\"\nJust as significantly, Manitoba held on to more of its public-sector workers between February and April than did most other provinces.\nAccording to Statistics Canada, 2.1 per cent of Manitoba public-sector workers lost their jobs between February and April. Only in New Brunswick and Nova Scotia did smaller proportions of public-sector employees wind up out of work.\nIn Ontario, Alberta and B.C., closer to six per cent of public-sector workers wound up unemployed. The figure was 9.5 per cent in Quebec.\nThese tallies include all public-sector workers, not just provincial employees. In Manitoba, Finance Minister Scott Fielding said the provincial public workforce will be cut by an average of 2.2 per cent. \nThe province got closer to that goal on Monday, when Crown corporation Manitoba Hydro signalled its intention to lay off as many as 700 workers.\nThere's no guarantee Manitoba's relative good fortune in terms of job losses will translate into an earlier economic recovery. Too many variables remain unknown.\n\"I don't think businesses are ready for how long it will take to rehire people,\" said Cyrenne, noting some people collecting Canada Emergency Response Benefits are earning more than they did when they held minimum-wage jobs.\nThe even greater question is how badly the loss of 84,900 jobs will impact the rest of the economy, as the loss of consumer spending power spins off into manufacturing, transportation and other sectors of the economy.\n \n \n \n"}, {"author": "Lenard Monkman", "title": "First Nations fishermen in northern Manitoba welcome federal COVID-19 relief response", "description": "'We have faced lots of obstacles but nothing like COVID,' says Albert Ross of Grand Rapids ", "url": "http://www.cbc.ca/news/indigenous/first-nations-fishermen-manitoba-relief-1.5570593", "urlToImage": "https://i.cbc.ca/1.5570608.1589500767!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/chris-clarke.jpg", "publishedAt": ["May 14, 2020 8:05 PM ET", "2020-05-15T00:05:19.011Z"], "source": "CBC News", "content": "A couple of First Nations commercial fishermen in northern Manitoba are glad federal relief is on its way for the struggling industry.\n\"I was looking forward to fishing but it is great news. We just have to figure out what it means,\" said Chris Clarke, president of the Norway House Fisherman's Co-op.\nOn Thursday, Prime Minister Justin Trudeau announced up to $469.4 million in new support measures to help Canadian fish harvesters affected by the COVID-19 pandemic.\nThe federal government said the pandemic has resulted in reduced demand and declining prices for Canadian fish and seafood products, and has had significant impacts on the livelihoods of fish harvesters.\nThe relief covers 75 per cent of fishing income losses beyond a 25 per cent income decline threshold, according to the news release.\nClarke is a third generation commercial fisherman and said the Norway House co-op has 49 members, and employs around 200 people in the northern Manitoba First Nation.\n\"A lot of our local economies are dependent on the local fisheries,\" said Clarke. \n\"There's several million dollars that flows through our community whenever fishing is done and the majority of that revenue stays in the community.\"\nClarke's plan is to take the new federal announcement news back to his co-op board to discuss how it will work, and to figure out what their next steps will be.\nFor harvesters who won't generate enough income to file for employment insurance (EI) next year, the new support measures for fish harvesters would allow them to access EI benefits on the basis of previous insurable earnings.\nClarke is one of many self-employed commercial fishermen who are currently on EI and are set to have it expire soon. \n\"We will allow previous years to be used as eligibility so that [fishermen] won't be penalized. They will still have the ability to access that,\" said Jennifer Kuss, director of communications for the minister of Fisheries, Oceans and the Canadian Coast Guard, Bernadette Jordan.\nThe president of Grand Rapids Fishermen's Co-op, Albert Ross, said there are close to 100 co-op members in the First Nation. He has been fishing in the Lake Winnipeg region for 40 years and has been the co-op president for 15.\nRoss said he is hoping that the new support measures will help to pay for some of the operating costs that come with being a commercial fishermen, things like boating leases and equipment.\n\"We have faced lots of obstacles but nothing like COVID,\" said Ross.\n\"We got all of our equipment and we can't fish anymore. Hopefully in the fall we can fish.\"\nKuss, the DFO's director of communications, said the money will begin to flow immediately for fish harvesters across the country. The department plans on giving more details on Friday on how the support measures will affect First Nations and Métis fishermen.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1735580739577", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "East-end Toronto groups band together to launch food bank for families struggling during COVID-19", "description": "Food will be delivered directly to families to help contain the virus, organizers say ", "url": "http://www.cbc.ca/news/canada/toronto/east-end-toronto-groups-launch-food-bank-1.5570514", "urlToImage": null, "publishedAt": ["May 14, 2020 8:26 PM ET", "2020-05-15T00:26:28.360Z"], "source": "CBC News", "content": "Some east-end organizations have banded together to launch a food bank that will help Torontonians who are struggling to make ends meeting during the COVID-19 pandemic. \n\"The main thing is a lot of people have lost their jobs and there's no employment for them, so there's that challenge of getting food, groceries,\" said Aamir Sukhera, trade centre coordinator for The Neighbourhood Organization (TNO), the group spearheading the project. \nSukhera, who grew up in Thorncliffe Park, says people in East York lived paycheque-to-paycheque even before the pandemic. \nSo with thousands of neighbours in the area to feed, Sukhera said the organization is working to ensure that people without a financial safety net will know when they'll receive their next meal. \n\"Some of the volunteers, I asked them, 'Why are you here? Why are you helping out?' And they're like, 'Well, next month, we might need food too,'\" he said. \nSukhera, who also works with new Canadians to help them find work, says he personally knows hundreds — if not thousands — of people in the community who have recently lost their jobs due to the pandemic. \n\"We have to do our best and stay a community to help each other,\" he added. \n\"We're all in this together.\" \nMany community members seem to agree with that notion. \nAfter the Islamic Society of Toronto donated the warehouse space needed to operate the food bank, other community groups started chipping in with donations of their own.\nOne of those groups, The Leaside Toy Drive, organized a GoFundMe that has raised $10,000 to date. \n\"When we got the call we jumped into action,\" said Daryn Everett, who's on the committee that runs the Leaside Toy Drive. \nThe project, which officially launched two weeks ago, operates differently than a typical food bank. \nInstead of people coming to pick up the products, food is delivered by volunteers directly to families' doorsteps to avoid large gatherings and reduce the spread of COVID-19. \n\"Boxes are going to be picked up this afternoon and tomorrow by volunteers and taken to families in need — an entire high-rise community,\" said Michael Zivot, who's also a member of Leaside Toy Drive's committee. \nThe boxes have been filled with food donated by local grocery stores, community members and businesses, and will include non-perishable items, such as oil, canned goods, pasta and gift cards. \nEverett said he's proud of the food bank, which didn't exist a month ago and is already feeding families in need.\nBut he said the project will only survive if businesses and individuals continue to donate.  \n\"We're hearing directly from the TNO that there's a lot of families here that are hungry,\" he said. \n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1733823555515", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1733910083634", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Ontario Northland launches scheduled bus service between Thunder Bay, White River, Winnipeg", "description": "Service east of Thunder Bay begins May 17, western service starts May 18 with stops in Kenora, Dryden", "url": "http://www.cbc.ca/news/canada/thunder-bay/ontario-northland-bus-thunder-bay-winnipeg-1.5570191", "urlToImage": "https://i.cbc.ca/1.2962505.1573739577!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/ontario-northland-bus.JPG", "publishedAt": ["May 14, 2020 4:42 PM ET", "2020-05-14T20:42:44.973Z"], "source": "CBC News", "content": "The Ontario government announced Thursday it is launching two new bus routes to help people in the northwest access jobs, education opportunities and medical care.\nThe scheduled inter-community bus service will be provided by the Ontario Northland Transportation Commission (ONTC), the province stated in a written release.\nBeginning May 17, the ONTC will offer three return trips per week between Thunder Bay and White River.\nThen on May 18, it will start twice-weekly return trips along Highway 17 between Thunder Bay and Winnipeg, with stops in Dryden, Kenora, the Health Sciences Centre Winnipeg and the University of Winnipeg.\nPeople in northwestern Ontario \"deserve access to safe and reliable transportation that connects them to employment opportunities, medical appointments and other essential services,\" stated Caroline Mulroney, minister of transportation.\nMuch of northwestern Ontario has been without consistent bus service since Greyhound pulled out of western Canada in Oct. 2018.\nKasper Transportation had been offering scheduled bus service from White River to Thunder Bay, and on to Winnipeg via Sioux Lookout, but the company suspended operations in Ontario and Manitoba on May 2, citing a decrease in revenue due to COVID-19.\nThe company also provided freight and charter services across the province, with depots in Thunder Bay and Winnipeg, as well as stops in over 40 locations across Ontario and Manitoba.\nThe ONTC is an agency of the provincial government.\nOversight of the commission was transferred from the Ministry of Energy, Northern Development and Mines to the Ministry of Transportation on April 1, in order to centralize the oversight of government agencies delivering public transit.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1733924931751", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1724965443646", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1712952899711", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "John Paul Tasker", "title": "Liberal finance chair says government hasn't been clear enough about risks of pandemic benefit fraud", "description": "Finance Minister Bill Morneau acknowledges fraudulent applications are a 'problem'", "url": "http://www.cbc.ca/news/politics/wayne-easter-emergency-response-benefit-fraud-1.5570545", "urlToImage": "https://i.cbc.ca/1.5530922.1586800681!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/wayne-easter.jpg", "publishedAt": ["May 14, 2020 6:22 PM ET", "2020-05-15T03:21:22.048Z"], "source": "CBC News", "content": "The Liberal chair of the Commons finance committee says the federal government hasn't been clear enough with Canadians about the sanctions they could face for improperly receiving the COVID-19 emergency response benefit — and Ottawa should do more to actively discourage bogus applicants.\nCBC News has documented cases of Canadians, notably prisoners, claiming the $2,000 monthly benefit when they don't qualify.\nThe National Post has published internal memos that instruct public servants to process claims even if they suspect the applicant isn't eligible.\nWhen pressed about fraud Thursday, Prime Minister Justin Trudeau said the government was eager to get the support money out to Canadians as quickly as possible and it was willing to accept some impropriety.\n\"If it meant even accepting that 1 or 2 per cent might make fraudulent claims, that was the choice that we gladly made. We needed to get help to Canadians immediately and that's what we did,\" Trudeau told reporters at his daily briefing.\nThe government has so far refused to say how many cheques have knowingly been sent to people who are ineligible. Employment Minister Carla Qualtrough told CBC's Power & Politics Wednesday that fewer than 200,000 claims have been red-flagged so far. The government has processed more than 7.8 million payments to this point.\nP.E.I. Liberal MP Wayne Easter, the finance committee chair, said the money should be clawed back from those who are ineligible in order to protect the integrity of the system.\n\"The government has to make it clear that we're not going to accept what is outright fraud and that money will be hauled back in. I think somebody needs to be clear,\" Easter told Finance Minister Bill Morneau, who was a witness before the committee Thursday.\n\"The answer, to be honest, hasn't been clear from the minister or the prime minister on that issue,\" Easter added.\nHe acknowledged errors are inevitable in a system of this size — some of his constituents were automatically enrolled in CERB in error, he said — but the government should discourage \"outright fraud.\"\nMorneau faced repeated questions at committee from Pierre Poilievre, the Conservative finance critic, about these claimants. Morneau said again that the government's primary focus has been on getting cash to those who need it.\nBut after Easter's remarks, Morneau promised action down the line to recoup funds, saying the benefit is only intended for a certain subset of the Canadian population — those who have lost most of their income as a result of the COVID-19 pandemic.\n\"I'd encourage people to be fair and honest in their attestation because the ramifications of not being [honest will be] a problem for them afterwards,\" Morneau said, citing the terms applicants must agree to before submitting a CERB application.\n\"The fact that there are some people who are committing fraud, or that there are accidents, is a problem and we're going to have to come back to these problems. For people who are fraudulent — it's not acceptable.\"\nCliff Groen, a senior public servant in Service Canada's benefit delivery services branch, told the committee today that a departmental memo was issued to bureaucrats instructing them to process payments even in cases where they suspect abuse.\nBut Groen said there are measures available to recoup money in future for people who do not meet the program requirements.\nTo qualify for the CERB, an applicant must be a Canadian resident over 15 years of age who has been forced to stop working because of the pandemic. The applicant also must have earned a minimum of $5,000 over the last 12 months and must expect to make less than $1,000 a month while collecting the benefit.\nWatch | The National: Cracking down on CERB fraud will take time\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1713193027988", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1693717571885", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/world/employment-gains-1.5452316", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1709652035734", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "N.W.T. schools to remain closed for remainder of academic year", "description": "Education leaders to keep schools closed due to the challenges reopening presents", "url": "http://www.cbc.ca/news/canada/north/nwt-schools-staying-closed-1.5570328", "urlToImage": "https://i.cbc.ca/1.5140758.1562187661!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/ecole-allain-st-cyr.JPG", "publishedAt": ["May 14, 2020 3:00 PM CT", "2020-05-15T00:19:54.627Z"], "source": "CBC News", "content": "Schools in the Northwest Territories will stay closed for the remainder of the school year.\nIn a news release Thursday, education leaders say they are acting as a group to keep schools closed, because \"circumstances vary greatly across communities and regions in terms of capacity to reopen schools at this time.\"\nThey've decided to keep schools closed for the rest of the 2019-2020 academic year, because of \"the many complex operational challenges faced by schools at this time.\"\nThose challenges include teachers who are currently away from many communities, concerns from local governments, and a shortage of equipment needed to maintain safety according to public health recommendations, reads the press release.\nThis week Dr. Kami Kandola, the territory's chief public health officer, said elementary, middle and high schools could reopen after the first set of COVID-19 restrictions are lifted, which could happen as soon as Friday. In March, schools in the N.W.T. were recommended to close as a preventative measure against COVID-19.\nNews that schools would be allowed to reopen this spring took some school boards and the NWT Teachers' Association, the union that represents the territory's teachers, by surprise.\n\"As school boards, we have heard the recommendation that schools can reopen. Together, we have analyzed our capacity to do so and have determined that for the safety of our staff and students, we will not,\" Simon Cloutier, chair of the Commission scolaire francophone des Territoires du Nord-Ouest, says in the news release, on behalf of N.W.T. education leaders.\n\"Taking the necessary time to plan for a well-thought-out re-entry in the fall is our priority. That being said, we will continue to support our students via our continuity of learning plans until the end of June.\"\nThe news release says most schools reported they likely wouldn't be able to implement the \"rigorous risk management plans\" necessary to reopen before the summer break.\nEducation leaders have agreed to use new advice from the chief public health officer to inform their plans for the 2020-2021 school year, reads the release.\n\"I am encouraged by the recent recommendations of the N.W.T. chief public health officer regarding the safe operation of schools during the time of COVID-19,\" says R.J. Simpson, the minister of education, culture and employment, in the press release. \n\"I understand the many challenges faced by our education bodies across the territory, and support their unified decision to focus efforts on planning for the fall while supporting continued learning for all N.W.T. students for the remainder of the 2019-20 school year.\"\n\"I know it was a rough day for a lot of people,\" Simpson acknowledged in an interview with the CBC, \"and a lot of people were taken by surprise, but in the end, I think everything worked out.\"\nSimpson said the Education Department, school boards and the NWT Teachers' Association are working together on plans for the upcoming school year, \"which is really the focus now.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1716314691751", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1712505411933", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1712505411933", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/nova-scotia/programs/informationmorningcapebreton/employment-coffee-houses-for-people-with-disabilities-1.5493582", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Haley Ryan", "title": "Province's employment numbers dropped 25,000 in first impact of COVID-19", "description": "'The health-care problem is one side of this. The economic problem is going to have its own victims'", "url": "http://www.cbc.ca/news/canada/nova-scotia/nova-scotia-employment-numbers-drop-covid-19-1.5529444", "urlToImage": "https://i.cbc.ca/1.5515924.1585860844!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/calls-for-no-rent.jpg", "publishedAt": ["Apr 10, 2020 6:04 PM AT", "2020-04-10T21:04:51.316Z"], "source": "CBC News", "content": "New numbers from Statistics Canada give a \"pretty ugly\" first snapshot of the pandemic's economic impact on Nova Scotia, but business advocates say the current situation is much worse.\nThe Labour Force Survey released Thursday shows the number of employed people dropped by 25,000 in March, or 5.5 per cent, compared to the month before.\nThe survey was taken March 15-21, the first week many businesses were shutting down and laying off workers due to COVID-19 public health rules.\nEmployment figures include people who worked for pay or profit, performed unpaid family work, or had a job but were not at work due to various reasons like vacation. Those on layoff and people who had a job starting in the near future are not considered employed.\nThe employment rate — the proportion of the population 15 and older who were employed — also fell to 53.2 per cent in March. That's the lowest level since 2001.\nEmployment fell nationally by more than one million in March, or 5.3 per cent. The employment rate fell 3.3 percentage points to 58.5 per cent, the lowest rate since 1997.\n\"It was predictable,\" Jordi Morgan, Atlantic vice-president for the Canadian Federation of Independent Business, said Friday about the numbers. \"They're pretty ugly,\"\nThe reference week used in the national survey was a \"tipping point\" for many businesses, Morgan said.\n\"The reality that we are going to see, I think, may be significantly worse when we get into April's results.\"\nMorgan said the CFIB has had \"tens of thousands\" of calls coming in from businesses small to large.\nThere won't be a sector left unaffected by the pandemic, he said.\n\"The stories are distressing,\" Morgan said. \"Even the people who are working, you know, our phones are impacted by this. You have people whose livelihoods—they're seeing it going down the drain. They're afraid. They don't know where to look for help.\"\nAlthough there are many industry associations trying to find answers, Morgan said entrepreneurs need cash now, or other loan programs so they can hang on to their businesses.\nMorgan said the province's offer of rent deferral only pushes people's debt down the road. While he's pleased with the forgivable portion of federal loans, he's heard the province's new grant program is \"insufficient.\"\nHe said it's going to take some \"extraordinary\" and innovative measures to make sure everyone pulls through.\n\"The health-care problem is one side of this,\" he said. \"The economic problem is going to have its own victims.\"\nUnemployment also rose in Nova Scotia by 4,800 people, about 10.9 per cent, up to 48,500. \nThe unemployment rate — the percentage of unemployed people in the provincial labour force — jumped from 8.7 per cent in February to 10.1 per cent in March.\nThe survey also broke down job impacts by industry.\nAccommodation and food services saw employment numbers drop 22 per cent, more than 8,000 people, from 36,900 employees in February to 28,700 in March. \nBut Luc Erjavec, Atlantic vice-president of Restaurants Canada, said Friday the reality now is much more bleak.\nThe organization's own survey, conducted March 25-29, shows 24,500 jobs in food service have been lost in Nova Scotia alone.\nThe province's $2.1-billion food-service industry represents 4.6 per cent of the province's GDP. Erjavec expects sales to be down $440 million for the second quarter of 2020.\n\"We're going to be decimated,\" Erjavec said, adding that many full-service restaurants haven't been able to make the jump to takeout or delivery that is now the only option.\nErjavec said these job losses and closures have quite the \"ripple effect,\" since each dollar spent in the restaurant industry triggers $1.85 in spending in the rest of the community.\nWhen asked about the Labour Force Survey in the COVID-19 press conference Thursday, Premier Stephen McNeil agreed it has yet to capture the \"full impact\" of what's happening in the province.\nHowever, he thanked those people still out working and following the physical distancing protocols. He added the province is hoping to pull forward infrastructure projects in the coming months to help the economy rebound when restrictions are eased.\n\"I have every bit of confidence that once we see our way through this pandemic, Nova Scotia's entrepreneurs will do what they've always done — start to rebuild and their government will be there with them,\" McNeil said.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1720854083727", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1720807491526", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Employment minister outlines N.W.T.'s changes to income support during pandemic", "description": "One-time allowance, changes to program introduced as part of territory's COVID-19 relief package", "url": "http://www.cbc.ca/news/canada/north/income-support-details-nwt-covid-19-1.5519037", "urlToImage": "https://i.cbc.ca/1.5459901.1581447970!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_780/r-j-simpson-talking-head.jpeg", "publishedAt": ["Apr 02, 2020 11:03 AM CT", "2020-04-02T17:03:14.065Z"], "source": "CBC News", "content": "The N.W.T.'s employment minister says that most people in the territory on income assistance should have already seen a one-time emergency allowance distributed as part of the territory's COVID-19 relief package in their bank accounts.\nMinister R.J. Simpson discussed details of the allowance, as well as other changes to the income assistance program, with The Trailbreaker's Loren McGinnis on Thursday morning.\nThe one-time allowance — of $500 for a single recipient, or $1,000 for households with two or more people — is being automatically distributed to everyone on income assistance in the territory in March, Simpson said, and recipients don't need to apply again to receive it. He said that as of the last update he had been given, over 70 per cent of those eligible had already received the funding.\n\"It's rolling out to everyone, and hopefully within a day or two, everyone should have it, who was eligible,\" he said.\nThe allowance is part of an $8.2 million \"wave two\" relief package announced by the government earlier this week. That complements an initial $13.2 million package, announced earlier in March.\nSimpson also outlined temporary changes to the income assistance program, including the exemption of \"gifts or unearned income\" until June 30 from calculations.\nThis change, he said, was designed to allow people to receive funds for on-the-land activities from their First Nation or other COVID-related assistance, without having it count against their reported income for income assistance.\n\"We didn't want to punish those people who receive that money,\" said Simpson. \"Any money you receive that's related to COVID[-19], essentially, we're not going to count against your income.\"\nOther changes to the program include the elimination of monthly income reporting for the time being. Instead, clients will report their income every three months, a change Simpson said was designed to keep people in their homes and out of the income assistance offices, which are currently closed.\nNew clients will also apply over the phone instead of in person, he said.\nThe final change Simpson outlined relates to \"productive choice,\" a requirement for clients to participate in their communities through activities like schooling or volunteering.\n\"What we've done is moved everyone who collects income assistance to one productive choice, and that is to take care of yourselves and your family, and essentially stay home,\" Simpson said.\nFor those seeking more information or looking to apply for income assistance, Simpson said that they can look for information on the department's website, or call their regional office.\n\"The client service officers are still working, and they'll be the ones in the best position to let people know how to apply and what they may be eligible for,\" he said.\n"}, {"author": "Tory Gillis", "title": "Sask. students feeling summer employment crunch due to COVID-19", "description": "University of Regina's depleted emergency fund calls for donations while students search for jobs", "url": "http://www.cbc.ca/news/canada/saskatchewan/students-feel-summer-employment-crunch-1.5517858", "urlToImage": "https://i.cbc.ca/1.3661986.1563311920!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/university-of-regina.JPG", "publishedAt": ["Apr 01, 2020 3:08 PM CT", "2020-04-01T21:08:38.244Z"], "source": "CBC News", "content": "Post-secondary students are nearly finished with their winter semester. For many, that means it's time to start searching for summer employment. \nThat task is one of many commonplace activities that have been drastically impacted by to the COVID-19 pandemic. \n\"The search has been pretty difficult,\" said third-year University of Regina political studies major Katarina Ewert. \"If you go on like, [job search website] Indeed, there are so many people hiring in Regina for waitressing jobs, but now all that's been shut down. So that was my plan, but it's not doable at the moment.\"  \nEwert said she's been able to secure provincial government employment in the past as a summer student. She has applied this year, too, but she's not sure there will be as many seasonal jobs available.\n\"They're usually around $17 per hour to start with, so you can make all your money during the summer and live on that for the rest of the year,\" she said.\nEwert knows she's not alone in her struggle. \nShe said that while it's nice to see governments deferring payments for student loans, that's not helpful for people like her who are still in the midst of their studies. \nMeanwhile, the University of Regina is calling for donations to its emergency fund, which awards bursaries to students for housing, food security, technology, medical care, necessary travel or unforseen circumstances. The school also offers emergency loans, but in the context of the COVID-19 pandemic it's highlighting the bursary program. \nThe university's interim president and vice chancellor, Thomas Chase, said the bursary fund normally awards $90,000 to students annually. Right now, it's seeing three times the amount of daily applications it normally sees. \nChase said the fund is dealing with the added difficulty of being unable to host its usual fundraiser events due to restrictions around the pandemic, so it's asking people to donate online at urgiving.ca/emergency.\nChase said the university knows its students are facing hardship around summer employment. \n\"There's no question. One group that we would think of immediately is people who work in restaurants, many of whom are students,\" Chase said. \"That's a terrific blow, and that's just one group.\"\nHe said many of the school's partners in co-op work experience programs and internships 'have maintained what they've been able to do,' but that there are exceptions such as education student-interns, who will not be able to work in a classroom while the province's classes are out indefinitely. \n\"It's kind of happening on a case-by-case and employer-by-employer basis,\" he said. \n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/711592003765", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/2548861945", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1712918083738", "urlToImage": null, "publishedAt": null, "source": null, "content": null}]