[{"author": "Pete Evans", "title": "Canada's economy was slowing down even before COVID-19 hit, February GDP numbers suggest", "description": "Rail blockades and Ontario teacher strikes helped wiped out growth", "url": "http://www.cbc.ca/news/business/february-gdp-statscan-1.5550479", "urlToImage": "https://i.cbc.ca/1.5468906.1582144174!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/wet-suwet-en-blockade-edmonton.jpg", "publishedAt": ["Apr 30, 2020 10:14 AM ET", "2020-04-30T16:32:41.640Z"], "source": "CBC News", "content": "Canada's economy was slowing down even before the COVID-19 pandemic hit, new data from Statistics Canada suggests.\nThe data agency says Canada's gross domestic product was essentially unchanged for the month, as output slowed in the education, transportation and warehousing sectors.\nFebruary's slowdown followed three straight months of slight gains in the months preceding it.\nRotating strikes by teachers in Ontario contributed to a 1.8 per cent contraction in educational services while the transportation sector shrank by 1.1. per cent as some rail traffic was halted across the country on account of protests and rail blockades in support of Wet'suwet'en hereditary chiefs who opposed a natural gas pipeline slated to pass through their traditional lands in British Columbia.\nManufacturing also shrank, by 0.2 per cent.\n\"Factors that limited growth back then ... look like rounding errors next to StatCan's [March forecast] showing a record nine per cent decline in March GDP,\" Royal Bank economist Josh Nye said.\nOutside of those sectors, most parts of the economy eked out gains. Real estate was a strong point, as activity at brokerages grew by 5.9 per cent, the biggest monthly gain since 2017. Realtors say the spring housing market was on track to be a hot one before COVID-19 hit, throwing the industry into a deep freeze.\nThe mining, quarrying and oil and gas sector also had a good month in February, expanding by 0.9 per cent.\nWholesale trade, finance and insurance and the retail sector all grew.\nWhile the numbers were basically flat for the month, the economic carnage that has come since then make the numbers largely redundant.\n\"Real estate has gone from running hot to virtual stasis in less than a month's time, and the necessary hit to sectors like accommodation and food services and arts, entertainment and recreation will be historically unprecedented,\" Toronto-Dominion Bank economist Brian DePratto said of the February data,\n\"Fortunately, with economic re-opening plans starting to take shape across the country, there is a little bit of light beginning to form at the end of the tunnel.\"\nIn a preliminary estimate for March released earlier this month, the agency said the economy posted a nine per cent decline for the month as business came to a standstill because of measures taken to slow the spread of the novel coronavirus.\nThe official estimates of GDP for March and the first quarter of 2020 will be released on May 29.\n"}, {"author": null, "title": "Canada's economy was slowing even before COVID-19 hit, January GDP numbers show", "description": "Transportation, retail and oil and gas sector were contracting", "url": "http://www.cbc.ca/news/business/january-gdp-1.5515908", "urlToImage": "https://i.cbc.ca/1.5515923.1585659941!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/cda-coronavirus-20200125.jpg", "publishedAt": ["Mar 31, 2020 9:27 AM ET", "2020-03-31T13:27:42.927Z"], "source": "CBC News", "content": "Canada's economy expanded by 0.1 per cent in January as manufacturing and the financial sector grew while transportation, mining, oil and gas and the retail sector all shrank.\nStatistics Canada reported Monday that Canada's gross domestic product expanded by 0.1 per cent during the month, slightly less than what economists were expecting. It's also less than the 0.3 expansion seen in the previous month.\nThe spectre of COVID-19 was already casting a shadow on the economy in January as reduced trade with China and travel restrictions held back Canada's economy two months before the full brunt of the outbreak hit North American shores.\nManufacturing grew by 0.8 per cent during the month, while construction activity picked up by 0.2 per cent from December's level. Wholesale trade grew by 1.2 per cent while the financial sector expanded by 0.9 per cent.\nOn the downside, the mining and oil and gas sector shrank by 0.6 per cent, while the retail sector was down by 0.4 per cent. The transportation sector shrank most of all, by 1.7 per cent, largely because of winter storms wreaking havoc with travel plans.\nBank of Montreal economist Benjamin Reitzes did note expansion in one sector that he thinks could be poised to continue in the coming months. \"One sector that picked up steam with its biggest gain in a year is public administration,\" he said. \"Expect a lot more of that as the federal and provincial governments step in to support the economy through the COVID-19 shock.\"\n\"January numbers are ancient history now given how the economic landscape has drastically shifted,\" he said. \"While the year got off to a decent enough start, the near-total halt in activity in the second half of March will have a hugely negative impact.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/2676409093", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Canada's economy rebounded with 0.1% GDP increase in November", "description": "October contraction reversed by slight expansion in November", "url": "http://www.cbc.ca/news/business/canada-gdp-november-1.5447173", "urlToImage": "https://i.cbc.ca/1.3929916.1484087814!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/gas-metre.JPG", "publishedAt": ["Jan 31, 2020 9:07 AM ET", "2020-01-31T14:07:58.811Z"], "source": null, "content": "Canada's economy grew 0.1 per cent in November, driven largely by higher utility costs and mostly offsetting October's surprise decline, Statistics Canada data showed on Friday.\nAnalysts in a Reuters poll had forecast no change after an unexpected 0.1 per cent decline in October. Goods-producing industries and the services sectors both posted a 0.1 per cent gain. Increases were reported in 15 of the 20 industrial sectors tracked by Statscan.\nUnseasonably cold weather in central Canada caused utilities to jump 2.1 per cent in November, the agency said, the largest gain in more than a year.\nNovember's GDP gain also comes despite notable declines in mining, quarrying and oil and gas extraction, as well as the transportation and warehouse sectors, in part because of an eight-day rail strike at Canadian National Railway, Canada's largest railway.\nMining, quarrying and oil and gas extraction, Statscan said, fell 1.4 per cent. Meanwhile, temporary mine closures in the Western Canadian province of Saskatchewan because of weak international demand caused potash mining to decline 18.2 per cent.\nLast week the Bank of Canada, which has sat on the sidelines for more than a year even as several of its counterparts have eased, held its overnight interest rate steady but opened to the door to a possible future cut should a slowdown in domestic growth persist.\n"}, {"author": null, "title": "Canada's debt-to-GDP ratio isn't a major election issue. But should it be?", "description": "Spending is always an important issue in any federal election campaign", "url": "http://www.cbc.ca/radio/costofliving/the-cost-of-running-either-for-election-or-a-deficit-1.5323745/canada-s-debt-to-gdp-ratio-isn-t-a-major-election-issue-but-should-it-be-1.5327355", "urlToImage": "https://i.cbc.ca/1.5305286.1569975775!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/fiscal-monitor-20190927.jpg", "publishedAt": ["Oct 18, 2019 10:21 PM ET", "2019-10-19T02:21:29.636Z"], "source": "CBC Radio", "content": "Neither a borrower or a lender be, wrote Shakespeare. But the Bard of Avon didn't have Canada's enviable debt-to-GDP ratio.\nHost Paul Haavardsrud looks at why the big parties running for election this year seem so comfortable with deficits. \n"}, {"author": null, "title": "U.S. reports on GDP, consumer spending remain positive", "description": "Improvement in economic data seemingly reduces the risks of a recession in the near term", "url": "http://www.cbc.ca/news/business/us-economy-reports-1.5375050", "urlToImage": "https://i.cbc.ca/1.5375062.1574868732!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/economy-gdp.jpg", "publishedAt": ["Nov 27, 2019 10:49 AM ET", "2019-11-27T15:49:58.494Z"], "source": null, "content": "U.S. economic growth picked up slightly in the third quarter, rather than slowing as initially reported, and there are signs the downturn in business investment could be drawing to a close.\nThe economy's prospects were further brightened by other data on Wednesday showing the number of Americans filing claims for unemployment benefits dropped last week after being stuck at a five-month high for two straight weeks, and that consumer spending rose steadily in October.\nThe reports were released in the wake of data showing an acceleration in housing market activity early in the fourth quarter and a sharp decline in the goods trade deficit, as well as a solid pace of inventory accumulation by retailers.\nThe improvement in the economic data further diminished the risks of recession in the near term. The Federal Reserve last month cut interest rates for the third time this year and signaled a pause in the easing cycle that started in July when it reduced borrowing costs for the first time since 2008.\nGross domestic product increased at a 2.1 per cent annualized rate, the Commerce Department said in its second estimate of third-quarter GDP. That was up from the 1.9 per cent pace estimated last month. The economy grew at a 2.0 per cent pace in the April-June period.\nEconomists polled by Reuters had forecast third-quarter GDP growth would be unrevised at 1.9 per cent.\nThe upward revision to GDP reflected more inventory accumulation than initially thought, as well as a less steep pace of contraction in business investment. Inventories increased at a $79.8 billion US pace instead of the $69.0 billion rate reported last month.\nWhen measured from the income side, the economy grew at a 2.4 per cent rate in the last quarter. Gross domestic income (GDI) increased at a rate of 0.9 per cent in the second quarter. The income side of the growth ledger accelerated despite a drop in profits.\nSecond-quarter GDI growth was revised down by 0.9 percentage point, with growth in wages and sales during that period slashed by $46.7 billion to $62.1 billion.\nAfter-tax profits without inventory valuation and capital consumption adjustment, which corresponds to S&P 500 profits, decreased $11.3 billion, or at a rate of 0.6 per cent, as they were held down by legal settlements with Facebook and Google. Profits increased at a 3.3 per cent rate in the second quarter.\nThe average of GDP and GDI, also referred to as gross domestic output and considered a better measure of economic activity, increased at a 2.3 per cent rate in the July-September period, quickening from a 1.4 per cent growth pace in the second quarter.\nU.S. stock index futures briefly extended gains and U.S. 10-year Treasury yields rose after the release of the data. The dollar strengthened against a basket of currencies.\nGrowth has slowed from the 3.1 per cent rate notched in the first three months of the year. The slowdown is largely blamed on the Trump administration's trade war with China, which has eroded business confidence, contributing to the second straight quarterly decline in business investment.\nThe fading stimulus from last year's $1.5 trillion tax cut package is also sapping momentum from the expansion, now in its 11th year. But there are some hopeful signs for business investment.\nThe Commerce Department said on Wednesday consumer spending, which accounts for more than two-thirds of U.S. economic activity, increased 0.3 per cent last month as households spent more on electricity and gas, offsetting a drop in new motor vehicle purchases.\nWith consumer spending rising moderately, inflation remained benign in October. Consumer prices as measured by the personal consumption expenditures (PCE) price index rose 0.2% last month, lifted by food, energy goods and services prices. The PCE price index was unchanged in August and September.\nWages increased 0.4 per cent in October after climbing 0.1 per cent in September. Wages were boosted by a $7.2 billion adjustment to account for General Motors strike pay and payments associated with a new contract for members of the United Automobile Workers union.\nWith spending outpacing income growth, savings fell to $1.29 trillion from $1.34 trillion in September.\nOrders for non-defence capital goods excluding aircraft, a closely watched proxy for business spending plans, surged 1.2 per cent last month, the largest gain since January, after falling 0.5 per cent in September. These so-called core capital goods orders were boosted by increased demand for machinery, computers and electronic products and fabricated metals.\nEconomists had forecast core capital goods orders would drop 0.3 per cent in October. Shipments of core capital goods increased 0.8 per cent last month. Core capital goods shipments are used to calculate equipment spending in the GDP measurement.\nCore capital goods shipments fell 0.8 per cent in September.\nBusiness investment dropped at a 2.7 per cent rate in the third quarter, rather than contracting at a 3.0 per cent pace as previously reported. The declines in spending on nonresidential structures such as mining exploration, shafts and wells, were not as steep as previously estimated.\nA report from the Labor Department showed initial claims for state unemployment benefits declined 15,000 to a seasonally adjusted 213,000 for the week ended Nov. 23. Claims had been stuck at a five-month high over the previous two weeks, pointing to some easing in the labor market.\nStill, the labour market remains on solid footing, helping to underpin consumer spending. Growth in consumer spending, which accounts for more than two-thirds of U.S. economic activity, was unrevised at a 2.9 per cent rate in the third quarter.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada-s-debt-to-gdp-ratio-isn-t-a-major-election-issue-but-should-it-be-1.5327513", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "New Zealand plans spending spree to counter virus job losses", "description": "Finance Minister Grant Robertson unveiled a budget Thursday unlike any in nation's history", "url": "http://www.cbc.ca/news/world/new-zealand-budget-1.5569118", "urlToImage": "https://i.cbc.ca/1.5569130.1589434734!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/new-zealand-budget.jpg", "publishedAt": ["May 14, 2020 2:47 AM ET", "2020-05-14T10:49:58.433Z"], "source": null, "content": "New Zealand's government plans to borrow and spend vast amounts of money as it tries to keep unemployment below 10 per cent in the wake of the coronavirus pandemic.\nFinance Minister Grant Robertson on Thursday unveiled a budget unlike any in the nation's history. Debt would shoot up from just over 20 per cent of GDP to 54 per cent by 2023, and thousands of jobs created by putting people to work building homes and improving the environment.\nStill, the increased spending will not be enough to offset the economic devastation caused by the pandemic. Unemployment is expected to rise from just over four per cent to nearly 10 per cent by June. And Robertson acknowledged that tourism, which had accounted for about 10 per cent of the economy, was not going to be the same for many years to come.\n\"We face a global economic and health crisis not seen since the Great Depression,\" Robertson said.\nThe budget was released on the same day the nation lifted most of its lockdown restrictions.\nMalls, retail stores and restaurants all reopened, and many people returned to their workplaces. That reflected the country's success to date in its attempts to eliminate the virus. Health authorities on Thursday reported zero new infections for the third day in a row. New Zealand has reported a total of about 1,500 confirmed infections and 21 deaths.\nUnder the budget plan, the government will spend 50 billion New Zealand dollars ($42 billion Cdn) over four years to help boost the economy.\nThe government had entered the crisis running a surplus and with its books in good shape compared to many other countries. Robertson said the crisis called for increased spending rather than cutting back.\n\"I'm not a fan of austerity,\" he said.\nMore than half of all workers in New Zealand are currently being subsidized by the government under a scheme that was quickly set up as the nation went into a strict lockdown in March. The budget would extend the scheme for hard-hit businesses.\nThe plan also calls for 11,000 environmental jobs to be created, some of them temporary. People would be put to work killing pests and restoring wetlands. And up to 8,000 new homes would be built, creating thousands of construction jobs. Spending would also be increased on everything from health care and education to school lunches and the postal service.\nLawmakers were expected to approve the budget later Thursday.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1626791491581", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "John Paul Tasker", "title": "Federal deficit likely to be higher than $252 billion, parliamentary budget officer says", "description": "PBO says it's possible federal debt will hit $1 trillion because of pandemic relief spending", "url": "http://www.cbc.ca/news/politics/federal-deficit-higher-than-252-billion-1.5566768", "urlToImage": "https://i.cbc.ca/1.5138746.1558027091!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/phoenix-pay-system.jpg", "publishedAt": ["May 12, 2020 5:34 PM ET", "2020-05-13T17:44:54.995Z"], "source": "CBC News", "content": "The parliamentary budget officer (PBO) says the federal deficit likely will exceed what he projected at the end of April as the federal government continues to spend billions of dollars on COVID-19 support programs with no clear end in sight.\nSpeaking before the Commons finance committee Tuesday, Yves Giroux said the $252 billion figure he cited only a few weeks ago is a low-ball estimate of just how much the programs will cost the federal treasury this fiscal year.\nHe said Finance Minister Bill Morneau should provide a fiscal update soon to give Canadians a better sense of how much Ottawa is spending on the pandemic.\nThe $252 billion figure was based on the data the PBO had as of April 24. Since then, said Giroux, new aid programs have been announced for commercial rent support, the agricultural sector, students and seniors — things he called \"very expensive measures.\"\n\"I think $252 billion is on the very optimistic side, as things stand now,\" Giroux said.\n\"In all likelihood the deficit will be higher than $252 billion. If I had to bet on that number, I'd say it's more likely to be worse than that than better than that.\"\nAs a result, the federal debt will rise to more than $900 billion — or roughly $24,000 for every man, woman and child in Canada.\nGiroux said it's \"not unthinkable\" that the federal debt could reach $1 trillion, and it's both \"possible and realistic\" that the debt could hit 13 figures by this time next year.\nIn fact, depending on how long the pandemic lasts, it's possible that pandemic programs could cost more than what the entire federal government spent last year on everything — which was roughly $337.8 billion for the 2018-19 fiscal year.\nWatch: Prime Minister Justin Trudeau's full press conference for Tue. May 12:\nMeanwhile, the debt-to-GDP ratio — a fiscal benchmark the Liberal government cites often to justify borrowing — is also likely to increase from the 48.4 per cent projected on April 30, Giroux said. Before the pandemic, the government projected a ratio closer to 30 per cent.\nWhile that figure is high, Giroux said it's still well below the 66 per cent debt-to-GDP ratio the country reached in the 1990s — when the Wall Street Journal branded Canada \"an honourary member of the Third World.\"\nThe cost of financing this massive increase in government spending, and the resulting debt, will be relatively low, Giroux said. He said interest rates have hit rock bottom — the Bank of Canada's benchmark interest rate is now at 0.25 per cent — and the cost of servicing the debt will be manageable.\n\"We anticipate that debt charges will not go up, which is surprising and counterintuitive,\" Giroux said. \"Interest rates are so much lower than what we anticipated them to be just two or three months ago. It doesn't cost that much to finance that growing debt.\n\"Is the government in a worrisome position right now? The answer is no.\"\nHe said the debt load could become \"unbearable\" in the event of a sizeable spike in interest rates and added the prospect of such an increase is \"concerning.\"\nThe Liberal members of the committee asked Giroux what the cost to Canadians would have been if the government hadn't stepped in to flow funds to Canadians through programs like the Canadian Emergency Response Benefit (CERB) and the wage subsidy.\nGiroux said that, without government support, Canadians would have suffered considerable economic pain because of the pandemic.\n\"We would have seen widespread — and I mean widespread — bankruptcies at the individual and corporate level,\" he said. \"There would be lots of defaults on mortgages, repossession of homes and cars, credit card debts that would go unserviced.\n\"The cost of doing nothing would be high.\"\n"}, {"author": null, "title": "England tiptoes out of lockdown as economy dives", "description": "U.K. economy contracted by a record 5.8 per cent in March from February", "url": "http://www.cbc.ca/news/world/england-lockdown-1.5567345", "urlToImage": "https://i.cbc.ca/1.5567352.1589365190!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/1224544629.jpg", "publishedAt": ["May 13, 2020 7:30 AM ET", "2020-05-13T13:51:40.106Z"], "source": null, "content": "England tentatively began easing its coronavirus lockdown on Wednesday with some people who cannot do their jobs at home urged to return to work, as stark economic data showed the disastrous impact of the pandemic.\nThe worst-hit country in Europe with more than 40,000 deaths from COVID-19 — including 275 health and care workers, according to official data — Britain has been in lockdown since March 23.\nThe government is loosening restrictions only gradually for fear of triggering a second peak of infections. As of Wednesday morning, people in manufacturing and certain other sectors were being asked to return to work if they could.\nAnswering questions in Parliament, Prime Minister Boris Johnson said it was \"very notable\" that in some countries where lockdown guidelines had been relaxed, there were signs that the rate of contagion was rising again.\n\"That is a very clear warning to us not to proceed too fast or too recklessly,\" he said.\nJohnson has described the process as a \"supremely difficult\" balancing act between public health and the economy.\nGross domestic product (GDP) data on Wednesday showed the economy shrank by a record 5.8 per cent in March from February, and the April data is likely to be even worse as the country was under lockdown for the entire month.\n\"We are seeing one (quarter of GDP contraction) here with only a few days of impact from the virus, so it is now, yes, very likely that the U.K. economy will face a significant recession this year, and we are in the middle of that as we speak,\" Finance Minister Rishi Sunak said.\nScotland, Wales and Northern Ireland, which have semi-autonomous governments, are sticking with a \"stay at home\" message for now, leaving England, the most populous U.K. nation, to take the lead in sending some people back to work.\nJohnson has been criticized for confusing the public about what can and can't be done safely. People have struggled to reconcile the advice to go to work with strong discouragement from using public transport, and with the lack of child care while schools remain closed.\nMany have also asked why people were not allowed to let friends and relatives into their homes, but are now authorized to allow prospective homebuyers in to view their properties.\n\"All those who talk about confusion or mixed messages are grossly overstating the position,\" Johnson said. \"The common sense of the British people is shining through ... They can see where we want to go, they can see where we need to go.\"\nIn London, commuter trains appeared busier than in past weeks, though still very far from pre-pandemic overcrowding. Many people wore face masks, and made noticeable efforts to observe distancing.\nAt Stratford, a usually busy hub in east London, a one-way system for entering and exiting the station was in place, with loudspeakers telling passengers where to walk.\nRoad traffic into the city was steady, though also well below traditional rush hour levels. Digital information panels said: \"Stay home, essential travel only, save lives.\"\nMayor Sadiq Khan posted a message on Twitter to tell Londoners not much had changed.\n\"Lockdown has not been lifted. Please keep social distancing and stay at home as much as possible,\" he wrote. \"If you have to make an essential journey by public transport, wear a non-medical face covering to protect others.\"\nThe government has faced a barrage of criticism that its new guidance — \"stay alert, control the virus, save lives\" — was confusing and that people were being given mixed messages about how safe it was to have contact with others.\nAppearing on Sky News TV, Transport Minister Grant Shapps was asked why estate agents were being allowed to resume house viewings when people could not have relatives to visit.\n\"The truth of the matter is, you have to start somewhere. The lockdown message was very straightforward — it was just stay at home. Now as we start to unlock, of course, there have to be decisions made,\" Shapps said.\n\"There is no perfect way of doing this, and we'd ask people to use their common sense ... Right now, there has to be a cut-off somewhere.\"\nWorkers were being advised to avoid public transport if possible, and schools remained closed, prompting questions about how parents and people who could not get to work by other means should apply the new guidance.\nEmployers faced the daunting task of creating safe environments for staff, with detailed guidance on one-way systems at entry and exit points and in stairwells, spacing out workstations and other minutiae.\nFor those working from home or unable to work, there was little change. People were now allowed out to exercise more than once a day, and two people from separate households were allowed to meet outdoors if they kept two metres apart.\nFines for transgressions have been increased.\nAnyone hoping to alleviate the tedium by planning a summer holiday would be taking a risk, Shapps told the BBC.\n\"Right now you can't travel abroad. If you are booking it then you are clearly, by the very nature, taking a chance on where the direction of this virus goes and therefore where the travel advice is in the future,\" he said.\n"}, {"author": "Bobby Hristova", "title": "Hamilton economy in 'extraordinary pain' but will see strong comeback next year: report", "description": "Hamilton has lost roughly 8,500 jobs during the pandemic but all of them will likely return in 2021", "url": "http://www.cbc.ca/news/canada/hamilton/hamilton-economy-coronavirus-1.5566804", "urlToImage": "https://i.cbc.ca/1.5516763.1585689847!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19.jpg", "publishedAt": ["May 13, 2020 4:02 AM ET", "2020-05-13T08:02:00.736Z"], "source": "CBC News", "content": "Hamilton has lost roughly 8,500 jobs as its economy goes through a period of \"extraordinary pain\" during COVID-19 according to a new report from the Conference Board of Canada.\nBut it predicts the city is poised to see a strong recovery.\nTodd Crawford, the Conference Board of Canada's associate director of economic forecasting, told CBC News said this pandemic has hit the economy harder than anything in the past few decades because both supply and demand were down with most businesses forced to close.\nThe city's unemployment rate jumped from 4.5 per cent in 2019 — a record low — to 7.4 per cent this year according to the data. That 7.4 percent is slightly higher than most other cities in Ontario and will account for almost 10 per cent of all jobs lost in the province. \nCrawford predicts unemployment will be at its worst right now, in the middle of the second quarter.\n\"Employment, we forecast, will contract by almost six per cent in the second quarter alone,\" he explained.\n\"It's really concentrated in this period of forced closures for businesses right now and it's really not a huge surprise things are declining.\"\nThe city said it was dealing with a pandemic-related $23-million budget shortfall in the middle of April.\nAlso not a surprise for Crawford, hotels and restaurants are being hit the hardest. He said the industry could contract by 40 per cent.\nThe report notes real estate and population growth have been stunted by COVID-19 as well.\n\"The pandemic and its resulting travel restrictions will slow Hamilton's recent strong growth in net in-migration, which hit 8,325 in 2019—the highest level since 1989. This year we expect 6,520 net new arrivals—a 21.7 per cent decline compared with last year. This will cut Hamilton's population growth to 8,094, down from 9,133 in 2019,\" reads the report.\n\"The local retail trade sector will contract in 2020, as a depressed economy, a weak labour market, and slower household disposable income growth force nervous consumers to tighten their purse strings. Retail sales are forecast to fall by 3.3 per cent, leading retail trade output to contract by 3.8 per cent. A rebound of 5.2 per cent is expected in 2021.\"\nHamilton's GDP is set to decline by 3.2 per cent this year but will jump by 6 per cent and kick off a steady and strong resurgence — as long as the pandemic continues to become less of a threat and there isn't another set of shutdowns.\n\"When economic activity contracts so swiftly, on the other side of it you will have a stronger rebound,\" Crawford said.\nHe added Hamilton was in a great economic position before the pandemic, which has softened the impact.\nThe city is also planning an economic recovery task force to deal with the aftermath of COVID-19.\nBy summer, if the virus hasn't rebounded, Crawford thinks people will begin spending more as businesses open up and restrictions fade away.\n\"If cities like Hamilton, which have seen very strong population growth, which do have a strong and vibrant housing market, which do benefit from high-paying jobs … can just get through this lockdown period and successfully navigate the re-opening hopefully we can all put this in our rearview mirror and start the recovery in mid-summer moving on into the fall.\"\n"}, {"author": null, "title": "Ontario confirms 308 new COVID-19 cases, state of emergency to be pushed to June 2", "description": "COVID-19 death toll in Ontario sits at 1,733", "url": "http://www.cbc.ca/news/canada/toronto/covid-19-coronavirus-may-11-emergency-order-extended-1.5564397", "urlToImage": "https://i.cbc.ca/1.5543698.1587736372!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/to-lockdown.jpg", "publishedAt": ["May 11, 2020 10:46 AM ET", "2020-05-11T14:47:42.294Z"], "source": "CBC News", "content": "Ontario reported 308 additional cases of COVID-19 on Monday, the third straight day of that the growth rate in new cases has been below 2 per cent.\nThe province has now seen a total of 20,546 cases of COVID-19 since the outbreak began in late January. Nearly 74 per cent of those who contracted the novel coronavirus have now recovered.\nOntario's official death toll rose to 1,669, an increase of 35 since the last update. Data compiled from regional public health units by CBC News, however, puts the actual death toll at at least 1,733.\nThe province's network of labs processed 13,970 tests, a decrease from a record 17,618 the day before last and below the 16,000 tests per day target instituted last week. The backlog of tests now sits at 9,018.\nMeanwhile, Ontario's legislature will sit Tuesday and is expected to extend the province's state of emergency to June 2, while also holding question period again.\nA statement from the government house leader's office says unanimous consent is expected to quickly vote on all stages of the bill to extend the state of emergency past its current expiry of May 19.\nPoliticians have returned to the chamber — with physical distancing protocols — several times since the pandemic began to extend the state of emergency, but have now also agreed to regular question periods.\nThe sessions will be held Tuesday, as well as May 19, 20, 26, 27, June 2 and 3.\nThe government says it is consulting with opposition parties about the possibility of extending sittings into the summer.\nOnly 42 out of Ontario's 124 members will be allowed in the chamber at any given time to ensure physical distancing.\nMeanwhile, stores in Ontario are allowed to reopen Monday for curbside pickup after a weekend that saw the spread of COVID-19 slow to a pace not seen since March.\nThe measure announced last week is meant to help ramp the economy back up after the pandemic caused unprecedented job losses in March and April.\nAll retail stores with a street entrance will be allowed to open today to provide both curbside pickup and delivery — a move Premier Doug Ford has said will allow thousands of people to return to work.\nOn Friday, the government allowed garden centres and nurseries to fully reopen, and hardware stores could do the same on Saturday.\nAccording to data released Friday by Statistics Canada, 689,200 Ontarians lost their jobs in April, in addition to the 403,000 the agency says were lost in March.\nIn its spring fiscal outlook published today, Ontario's Financial Accountability Office estimated that the COVID-19 pandemic and measures taken to curb it will cause the province's real GDP to drop by nine per cent this year, \"the largest annual decline on record.\n\"Assuming the pandemic measures are lifted gradually and progressively through the second half of 2020, the province's real GDP is forecast to largely rebound in 2021, rising by 8.5 per cent,\" it added.\nThe FAO also projected that the province's will deficit will quadruple to a record $41 billion this fiscal year. Though as the economy recovers, the deficit is expected to decrease to $25.3 billion the following year — still more than double last year's figure.\nFord also announced over the weekend that provincial parks will reopen Monday, though beaches, camping areas and playgrounds will remain closed and physical distancing must be maintained.\n"}, {"author": "Mia Urquhart", "title": "Provincial parks, trails and other tourist attractions set to reopen", "description": "Some services may be altered or eliminated because of COVID-19 restrictions", "url": "http://www.cbc.ca/news/canada/new-brunswick/covid-provincial-parks-trails-reopen-1.5568329", "urlToImage": "https://i.cbc.ca/1.3579738.1530905679!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/fundy-parkway.jpg", "publishedAt": ["May 13, 2020 6:16 PM AT", "2020-05-13T21:18:58.088Z"], "source": "CBC News", "content": "New Brunswick's tourism industry is open for business — although it's more self-serve than full-service at the moment. \nWhile the government gave the green light for parks, trails, campgrounds and restaurants to open, they still have to abide by the conditions for the orange phase of the province's economic recovery plan. \nAs part of this phase, provincial parks and attractions will reopen with limited services, no events, and no programming or co-coordinated activities, said Tourism Minister Bruce Fitch on Tuesday. \n\"There'll be some attractions that won't have some of those interactive things for them … and I'm thinking more of King's Landing or some of the Acadian villages again, where we don't want to put our staff and maybe some of the visitors at risk,\" he said. \n\"It's going to be a little different, but I think, by and large, people will be able to enjoy the venues.\" \nOak Bay provincial park will open Thursday, and several more will follow Friday, including Mactaquac, New River Beach, and the Fundy Trail Parkway. \nSeveral others will open later in the month or in June, many with reduced services. \nFitch said it was important to ensure proper staff training and that everything meets government guidelines, including appropriate signage and personal protective equipment for staff members. He said all employees will be screened before they start working. \n\"Services will be offered differently than before but, by following the Public Health directives, we will be able to enjoy again the wonders and beauty of our province while continuing to contain the spread of the COVID-19 virus.\"\nSome trails, for example, will be one way, he said. \nThe head of the province's tourism and hospitality association said many businesses have had to make adjustments to their summer plans.\n\"They're struggling obviously, because it's additional costs for them to meet the regulations,\" said Carol Alderdice. \n\"Some of them aren't even bothering to open because, you know, for the short amount of time that they would be open, and the amount of dollars that it would cost to get ready, they're just going to not open this summer.\"\nOthers have had to modify their summer plans and cut back on anything that doesn't conform to the province's rules for opening.\nAlderdice said the \"new normal\" will include putting cleaning protocols on full display — something that would have been thought \"rude\" before a global pandemic. \nShe said it will be important for patrons to see things being cleaned in front of them, \"where you tend to do that behind the scenes or when nobody's looking.\"\nAlderdice is also a big fan of the \"staycations\" that government has been promoting. \n\"This province is the most beautiful province anywhere, and a lot of us have not seen it the way that we should,\" she said.\n\"So this is a perfect opportunity to visit all these beautiful places.\"\nAlderdice said New Brunswickers should be proud that we've been able to keep the coronavirus at bay.\n\"So let's continue that pride and visit our beautiful province so that we can all be ambassadors or advocates for the province when people do start to visit.\"\nWhen the borders are open, she said it may not be easy to convince people that it's safe to travel, but setting a good example within our borders will be a start. \nBut she knows that not all businesses will be around to greet out-of-province tourists when they're allowed to visit. Her group did a survey at the beginning of the state of emergency and 20 per cent of respondents said they wouldn't survive beyond three months and would have to close permanently. \nOthers have decided to write off the 2020 season. The Reversing Falls Restaurant, in Saint John, is one of them. \nOwner Max Kotlowski said his restaurant — and the skywalk that sits atop it — will not open this year at all.\n\"We don't feel like it's worthwhile,\" said Kotlowski. \nHe said he was gearing up to open for the tourist season on May 8. But on March 13, he made the decision to close for the entire season. He hopes to be back in business for the 2021 season. \nThe Reversing Falls Restaurant had been open year-round until last December, when Kotlowski decided to become a seasonal business.\nEven if the borders were to open with Prince Edward Island and Nova Scotia, there still wouldn't be enough visitors to warrant opening, he said. \n\"We were actually hoping for a gain of 10,000 visitors. Last year, we had 17,000 visitors to the skywalk and we were hoping to increase that, but with a decline of this proportion, it's a no-brainer that there's not going to be enough business for us to open.\"\nFitch said it's important to get tourism going for more than just economic reasons.\n\"People have been working very hard, who continue to work, and there's other people that have been cooped up a little bit and been isolated. So both of those folks need to get out and enjoy some wide open space and some down time.\"\nHe said tourism is also \"a significant factor in contributing to our GDP, and a significant number of employees are associated with the tourism industry.\" \n\"So it's key. It's key for the mental health of everyone in New Brunswick and it's key to get the economy going again.\"\nFitch echoed Premier Blaine Higgs's invitation for New Brunswickers to explore our own province this summer. \n\"It's amazing\" that so many New Brunswickers haven't visited some of the province's tourist attractions, he said. \n\"There are some wonderful opportunities in the province of New Brunswick that people have an opportunity to explore this summer. They don't necessarily need to go to one of our sister provinces — as beautiful as they are. They can have a wonderful summer right here in New Brunswick.\" \nBut he stressed the importance of continuing to abide by the conditions imposed by parks and trails and other destinations. \n\"Hopefully, New Brunswickers can realize that this pandemic's not over yet, and they need to be diligent in making sure that they abide by those rules, so it doesn't come back in a second wave and we find ourselves back isolated again.\"\nThe following provincial parks will reopen with services limited to trails and beaches, public washrooms, limited restaurant services (where applicable), seasonal and daily camping.\nOak Bay \nMactaquac\nNew River Beach\nAnchorage (Grand Manan Island)\nFundy Trail Parkway\nHerring Cove (Campobello Island)\nMount Carleton\nMurray Beach\nParlee Beach\nde la République\nVal-Comeau\nSugarloaf Provincial Park trails, but camping won't start until May 29. The bike park with chairlift service will open on June 13.\nThe Village Historique Acadien — June 9\nHopewell Rocks Provincial Park — June 5. \nNB Botanical Gardens — June 6\nKings Landing (Wednesday to Sunday) — June 3. \nCape Enrage\nMiscou Island (Lighthouse and Visitor information centre)\nDoak Provincial Heritage Place\nBonar Law Provincial Heritage Place\nSheriff Andrews Provincial Heritage Place\nMinisters Island Provincial Heritage Place\nMacDonald Farm Provincial Heritage Place\nThe provincial government's website says that since provincial borders remain closed to non-essential travel, \"provincial parks, campgrounds and other tourist attractions are only accessible to New Brunswick residents and other individuals that have the proper authorization to be in the province.\"\nThe province also warns that \"openings are subject to change in accordance with the state of emergency and directives from Public Health and the provincial government.\"\n"}, {"author": "Joel Dryden", "title": "With $20B Alberta deficit possible, Kenney warns province won't be able to 'insulate everyone'", "description": "Projections show Alberta's debt-to-GDP ratio could approach 20% this time next year", "url": "http://www.cbc.ca/news/canada/calgary/alberta-jason-kenney-covid-19-coronavirus-trevor-tombe-1.5544476", "urlToImage": "https://i.cbc.ca/1.4838477.1587913300!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/alta-kenney-india-20180924.jpg", "publishedAt": ["Apr 25, 2020 1:05 PM MT", "2020-04-26T16:17:45.241Z"], "source": "CBC News", "content": "The province is prepared to take every possible step to protect Albertans from a coming \"terrible economic storm,\" Premier Jason Kenney said Thursday — but for many, it won't be enough.\n\"We cannot save every business that is going to be distressed right now,\" Kenney said during a Facebook livestream. \"What makes me emotional and gives me an enormous amount of anxiety is … realizing there is not enough fiscal power in the government in Alberta to insulate everyone from the economic adversity we are going through.\"\nKenney said Alberta is likely to hit a deficit somewhere in the range of $20 billion this fiscal year — an entirely reasonable figure given the situation the province now finds itself in during the pandemic, said University of Calgary economist Trevor Tombe.\nBut though COVID-19 has presented new challenges for Alberta, Tombe said it's important to remember that the province was already experiencing a significant period of no growth.\n\"Basically, Alberta has been experiencing a rising level of debt-to-GDP [gross domestic product] since the financial crisis,\" he said, referring to the ratio between what a government owes to its economic output. High levels of debt-to-GDP mean countries and provinces are not generating enough money to pay off their debts.\n\"In 2007, we had net assets equivalent to 15 per cent of GDP, where we actually owned more than we owed — we had negative net debt. Then the financial crisis turned the corner, and our financial situation has been deteriorating ever since.\"\nAlberta has been accumulating debt for well over a decade now, Tombe said. He estimates the coming fiscal year could see deficits hit somewhere between $15 and $20 billion.\n\"So you have to borrow to cover that, when you're spending more than you're bringing in,\" Tombe said. \"In addition, the government borrows for capital investment projects, and that could be about $3 billion to $4 billion more, and that's not counted as a deficit that still needs to be borrowed.\"\nOn top of that, Tombe said it's possible that the economy could shrink.\nProjections vary, but taking a real gross domestic product figure at a rate of eight per cent — paired with a drop in oil prices — could mean a shrinkage in the entire total income in the province by about 15 to 20 per cent.\nPut it all together, and Tombe said it would roughly double Alberta's debt-to-GDP ratio from just under 10 per cent to just under 20 per cent at this time next year.\nOn Twitter, Lindsay Tedds, an associate professor of economics at the University of Calgary, said that debt-to-GDP ratio would still allow the government to support more Albertans than Kenney suggests.\nRestarting this. Fixed <a href=\"https://twitter.com/jkenney?ref_src=twsrc%5Etfw\">@jkenney</a> quote in the article to be factual. At 20% debt to gdp ratio will still have the lowest ration in the land with substantial tax room to support it. Let us be clear, the Alberta premier is choosing, not constrained, not to help more people. <a href=\"https://t.co/C9rJro4HdX\">https://t.co/C9rJro4HdX</a> <a href=\"https://t.co/4GxBHyGE8b\">pic.twitter.com/4GxBHyGE8b</a>\nDuane Bratt, a political scientist at Mount Royal University in Calgary, said Kenney was being \"very pragmatic\" by going into deficits contrary to his ideological beliefs — but said things will change in a year or two when the deficit needs to be paid down.\n\"Will the government respond by saying that its debt-to-GDP ratio is still relatively low, hoping oil prices climb back to $50 or $60 [a barrel], increase taxation or reduce spending?\" Bratt said in an email. \"My guess is the Kenney government will double down on cuts to spending in health care and education.\" \nTombe's projections are close to those released in a report from the conservative think-tank Fraser Institute on Thursday, which said low oil prices and COVID-19 will move Alberta's economy into its third recession in a little more than a decade.\nThe Fraser Institute projects Alberta is likely to have more than $56 billion in net debt by the end of the fiscal year, bringing the debt-to-GDP ratio to 17.7 per cent.\n\"Alberta's fiscal position [net debt or assets relative to GDP] will have deteriorated in 14 consecutive years once this one is over, and it would be a mistake to assume that trend will reverse itself on its own,\" the report stated.\nThough Tombe said he anticipated the federal government would design programs to increase transfers to provinces to cushion the blow of the COVID-19 crisis, there are other ways to raise revenue in a province such as Alberta.\n\"The most efficient and least economically costly way to do it is through broad-based consumption taxes. There's pros and cons to every choice, and so reasonable people can disagree,\" Tombe said.\n\"But if we're going to raise revenue, then I would recommend doing it in a way that hurts the economy the least, and that's through sales taxes.\"\nTombe said Alberta will also have to re-evaluate its fiscal plan given its reliance on oil prices, which he said were \"very optimistic numbers even at the time the budget was realized, but now [are] just crazy.\"\n\"We have now been experiencing large economic shocks for many, many years in a row, and we haven't fundamentally changed policy in this province,\" Tombe said. \"If this crisis is not the moment for us to take a hard look at how we've been doing things, I don't know what is.\"\nThis week, Alberta Finance Minister Travis Toews was authorized to borrow up to $25 billion for government programs and services and the COVID-19 response, nearly four times what was expected.\n"}, {"author": null, "title": "Ontario confirms 308 new COVID-19 cases, state of emergency to be pushed to June 2", "description": "COVID-19 death toll in Ontario sits at 1,776, according to a CBC count", "url": "http://www.cbc.ca/news/canada/toronto/covid-19-coronavirus-may-11-emergency-order-extended-1.5564237", "urlToImage": "https://i.cbc.ca/1.5543698.1587736372!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/to-lockdown.jpg", "publishedAt": ["May 11, 2020 9:55 AM ET", "2020-05-12T01:29:10.034Z"], "source": "CBC News", "content": "Ontario reported 308 additional cases of COVID-19 on Monday, the third straight day that the growth rate in new cases has been below 2 per cent.\nThe province has now seen a total of 20,546 cases of COVID-19 since the outbreak began in late January. Nearly 74 per cent of those are now resolved.\nOntario's official death toll rose to 1,669, an increase of 35 since the last update. Data compiled from regional public health units, however, puts the actual death toll at at least 1,776.\nThe province's network of labs processed 13,970 tests, a decrease from a record 17,618 the day before last and below the 16,000 tests per day target instituted last week. The backlog of tests now sits at 9,018.\nAfter dropping by 55 on Sunday, the number of COVID-19 patients being treated in hospitals shot back up to 1,027, an increase of 66. The number of those in intensive care units remained steady, falling by one to 194, while patients on ventilators increased by seven to 147.\nDr. David Williams, Ontario's chief medical officer of health, said the last several days represent a welcome \"down-going trend,\" which may allow the province to move into its next recovery phase. Ontario has said it is looking for a two to four week decline in new cases before lifting some measures.\n\"We're anticipating whether we can really enter the next phase of the recovery from the pandemic,\" Williams said Monday afternoon.\nOntario Premier Doug Ford also generated some confusion during his Monday news conference when he announced that two of his daughters visited his home on Sunday to celebrate Mother's Day.\nThe six-person gathering appears to have contravened public health guidelines around physical distancing, which call for Ontario residents to avoid gatherings of more than five people, unless they all live in the same household.\n\"I think if we can keep it to as small as possible gatherings that would be very helpful,\" Ford said of the visit.\nOntario's legislature will sit Tuesday and is expected to extend the province's state of emergency to June 2, while also holding question period again.\nA statement from the government house leader's office says unanimous consent is expected to quickly vote on all stages of the bill to extend the state of emergency past its current expiry of May 19.\nThe state of emergency is dealt with separately from the emergency orders, which cover closures of bars and restaurants, except for take-out and delivery, theatres, outdoor amenities such as playgrounds, and child care centres.\nPoliticians have returned to the chamber — with physical distancing protocols — several times since the pandemic began to extend the state of emergency, but have now also agreed to regular question periods.\nThe sessions will be held Tuesday, as well as May 19, 20, 26, 27, June 2 and 3.\nThe government says it is consulting with opposition parties about the possibility of extending sittings into the summer.\nOnly 42 out of Ontario's 124 members will be allowed in the chamber at any given time to ensure physical distancing.\nMembers are also expected to agree to authorize virtual sittings of the finance committee so it can conduct four-week studies of the economic impacts of COVID-19 on various sectors, including tourism, culture and heritage, municipalities, construction and building, infrastructure, and small and medium businesses.\n'It is expected to wrap up the overall study by Oct. 8.\nMeanwhile, stores in Ontario are allowed to reopen Monday for curbside pickup after a weekend that saw the spread of COVID-19 slow to a pace not seen since March.\nThe measure announced last week is meant to help ramp the economy back up after the pandemic caused unprecedented job losses in March and April.\nAll retail stores with a street entrance will be allowed to open today to provide both curbside pickup and delivery — a move Ford has said will allow thousands of people to return to work.\nOn Friday, the government allowed garden centres and nurseries to fully reopen, and hardware stores could do the same on Saturday.\nSeveral Toronto-area malls said some of their stores with street entrances were offering curbside pickup Monday, or would be in the coming days.\nYorkdale Shopping Centre in north Toronto said close to a dozen stores — including food services and department stores — were taking advantage of the newly loosened rules, while the downtown Eaton Centre said four were doing so.\nSquare One Shopping Centre in nearby Mississauga, Ont., said a department store and sporting goods store were offering curbside pickup Monday, with others making preparations.\nFord also announced over the weekend that provincial parks will reopen Monday, though beaches, camping areas and playgrounds will remain closed and physical distancing must be maintained.\nAccording to data released Friday by Statistics Canada, 689,200 Ontarians lost their jobs in April, in addition to the 403,000 the agency says were lost in March.\nIn its spring fiscal outlook published today, Ontario's Financial Accountability Office estimated that the COVID-19 pandemic and measures taken to curb it will cause the province's real GDP to drop by nine per cent this year, \"the largest annual decline on record.\n\"Assuming the pandemic measures are lifted gradually and progressively through the second half of 2020, the province's real GDP is forecast to largely rebound in 2021, rising by 8.5 per cent,\" it added.\nThe FAO also projected that the province's deficit will quadruple to a record $41.0 billion this fiscal year. Though as the economy recovers, the deficit is expected to decrease to $25.3 billion the following year — still more than double last year's figure.\nDuring his Monday news conference, Ford also indicated that his government is nearing a decision about the remainder of the school year.\n\"We're going to make it clear next week,\" Ford said, adding that fine details are still being worked out.\nMinister of Education Stephen Lecce also announced on Monday his support for a plan to postpone ceremonies such as proms and graduations until it becomes safe to hold them again. He listed summer and fall as viable possibilities.\n\"I spoke directly to many graduating students and their parents. Their stories have moved me to act,\" Lecce said in a statement. \n\"I firmly believe Ontario students deserve this positive conclusion to their academic journey, even if ceremonies are delayed.\"\nHowever, decisions around postponements ultimately lie with individual school boards and local public health authorities.\n"}, {"author": "John Paul Tasker", "title": "Liberal government 'not thinking about raising taxes' right now, says Morneau", "description": "Trudeau dismisses calls for a budget in the short term as PBO warns debt could hit $1 trillion", "url": "http://www.cbc.ca/news/politics/trudeau-budget-one-trillion-1.5568031", "urlToImage": "https://i.cbc.ca/1.5503854.1584659454!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/coronavirus-bill-morneau.jpg", "publishedAt": ["May 13, 2020 2:50 PM ET", "2020-05-14T01:53:26.834Z"], "source": "CBC News", "content": "Finance Minister Bill Morneau says his government is not currently thinking about raising the GST or any other taxes but that Canada will have to face tough questions about how to pay for the COVID-19 pandemic response that is costing billions.\n\"We're not thinking about raising taxes,\" Morneau told CBC's Rosemary Barton during a town hall special Wednesday evening. \"What we're thinking about is preserving our economy for the future, making sure that we can get back to a vibrant place.\"\nMorneau said he is focused on ensuring the Canadian economy is strong enough to grow once the pandemic ends so that Canadians who have lost their jobs in one sector may be able to pick up a job in a different one.\nAsked if his government will either cut services or raise taxes to increase government revenues in an effort to pay off the pandemic debt, Morneau said that was a problem Canadians would have to face once they are back on their feet. \n\"We know that we are going to need to face up to those challenges. We also recognize that raising taxes is not what Canadians want us to do,\" he said. \"\nWatch: Morneau 'not thinking about' raising GST despite COVID-19 relief spending:\nMorneau's comments come as Prime Minister Justin Trudeau today sounded a similar tone, downplaying the need for a federal budget in the short term, saying the fast-moving effects of the COVID-19 pandemic would render any projections moot.\nBut members of the Conservative opposition are demanding that Morneau heed calls from the parliamentary budget officer (PBO) — who estimated that this year's budget deficit could be more than $250 billion — to table some sort of update to give Canadians a better sense of the country's fiscal health as government spending reaches levels not seen in decades.\nMorneau was set to deliver a federal budget at the end of March. The pandemic disrupted those plans.\nSince then, Ottawa has rolled out hundreds of billions of dollars in supports for workers and employers — programs that have pushed the 2020-21 deficit to an estimated $251 billion.\nThe PBO said Tuesday that deficit estimate, first reported on April 30, is already outdated and likely will need to be revised upwards.\nHe said a federal debt topping $1 trillion by year's end is \"not unthinkable\". At the start of the year, the federal debt was roughly $700 billion.\nBut Trudeau said today he has no immediate plans to table a budget because the government simply doesn't know how the economy will fare in the months ahead, as social distancing measures continue to cripple economic activity.\nHe also seemed to rule out tabling some sort of document that could be updated as the fiscal situation stabilizes.\nTrudeau said the government is focused on \"immediate\" needs over long-term budgeting.\n\"A budget is usually something that projects what's going to happen to the Canadian economy for the next 12 months and right now, we're having a lot of difficulty establishing with any certainty what's going to happen in the next 12 weeks,\" Trudeau said today at his daily briefing with reporters.\n\"The situation is changing extremely rapidly.\"\nIn the midst of the 2008-09 global recession, the previous Conservative government tabled a budget in January 2009 and a fiscal update followed in September as the Tories responded to a cratering economy.\nWhen asked if there were any plans for a fiscal update this year, a spokesperson for Morneau said the department had no comment beyond what Trudeau said at his press conference.\nConservative members pressed Morneau in the Commons today, asking if the government had any projections of how much it would cost to finance the growing debt.\nMorneau said he will give a full accounting of the costs of the government's pandemic measures \"when we have the ability.\"\nThe PBO said the cost to service the debt will be manageable for now, because interest rates are at record lows — but a spike in those rates would be very \"concerning.\"\nWhile cabinet ministers have been reluctant to say if or when the next fiscal update will be released, a senior public servant told the Senate's national finance committee Tuesday that work is underway on such a plan.\n\"We're in the process of beginning that fiscal update, which, of course, involves consultation with the private sector, and we expect to be able to provide a fiscal update in the coming weeks,\" said Alison McDermott, an official in the economic and fiscal policy branch of the Department of Finance.\n\"I don't think the government has made any announcements about the timing of that at this point.\"\nKevin Page, the country's first PBO and the president and CEO of the Institute of Fiscal Studies and Democracy at the University of Ottawa, said Morneau should produce a fiscal update by June to make Canadians feel confident that the government has its fiscal house in order.\nPage said nobody is expecting a traditional 500-page budget — \"We're not in that world right now, we get that,\" he said — but there's still a need for some sort of planning document. He said the prime minister should face pressure to release some numbers soon.\n\"It's pretty hard to say we don't need a fiscal strategy right now. The way to engender confidence is to be transparent,\" he told CBC News. \"I don't think they can get away getting much past early June without a fiscal statement ... there's no accountability without a plan. We need to see a tally.\"\nHe said people need to know if the government intends to continue programs like the Canadian Emergency Response Benefit (CERB) and the wage subsidy, and, if so, for how long.\n\"Just tell people — this is the situation, this is how we're going to respond. We need a strategy. We need to tell people what to expect over the next few months,\" he said.\nSuch information is also important for would-be bondholders, Page said, who will be extending credit to a money-hungry government.\nSahir Khan, Page's former deputy PBO, said the government is probably reluctant to release numbers now because opponents could pounce if the fiscal situation rapidly deteriorates.\nBut if health officials are expected to release modelling for COVID-19 infections and deaths, he said, federal finance officials should do the same with deficit spending and debt.\nAs spending continues unabated, former prime minister Stephen Harper voiced concerns Tuesday with the debtload much of the Western world has taken on in recent weeks in response to this crisis.\nHarper, an economist by training, said balance sheets have become an \"unholy mess\" and some states are likely to face sovereign debt crises in the months ahead.\n\"If they fail to practice mild austerity proactively, a brutal kind will be thrust on them,\" Harper said in an op-ed published in the U.S.-based Wall Street Journal.\nHarper said \"leftists\" are trying to capitalize on this crisis to permanently expand the size of government by pushing ideas like a \"guaranteed minimum income.\"\n\"A new era of big government in the economy is unlikely, undesirable and far from inevitable,\" Harper said.\n\"When focus shifts from the pandemic to the economy, it will need to shift from a lot more government action to a lot less.\"\nBut Page, who was appointed by Harper, said now isn't the time to talk about austerity.\nHe said Canada is still in a strong fiscal position compared to other industrialized nations, with roughly half the average debt-to-GDP ratios of other advanced economies.\n\"We're nowhere near code red,\" Page said, when asked if belt-tightening is needed now.\n\"If you phoned someone from Washington, D.C. and told them Canada is hitting $1 trillion they'd say, 'Boy we wish we had your numbers,'\" Page said, citing the country's projected debtload.\nPage said that, rather than austerity, the government should start talking about a stimulus package — measures beyond direct payments to Canadians. \"We have to take care of our citizens or else we'd be in a Great Depression-mode.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1732957251767", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Pete Evans", "title": "It's official — Canada's economy is in a recession, C.D. Howe says", "description": "Influential business group declares that slowdown meets bar to declare a recession", "url": "http://www.cbc.ca/news/business/canada-recession-economy-1.5552135", "urlToImage": "https://i.cbc.ca/1.5000113.1548942788!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/ford-factory-idle.jpg", "publishedAt": ["May 01, 2020 11:25 AM ET", "2020-05-01T19:56:53.655Z"], "source": "CBC News", "content": "Canada is officially in a recession that's been caused by the COVID-19 pandemic, the C.D. Howe Institute's Business Cycle Council declared Friday.\nThe council, which monitors recessions and recoveries in Canada, said the economy peaked in February, just before drastic measures to slow the spread of the coronavirus that causes COVID-19 were implemented across the country.\n\"Members agreed that by applying the council's methodology to the preliminary data available, Canada entered a recession in the first quarter of 2020,\" the council said in a statement.\nThere are no hard and fast rules for declaring a recession, although one rule of thumb used by economists is that an economy is probably in one if it has shrunk for two three-month periods in a row.\nThe council rejects the \"two quarters\" rule and instead defines a recession as a \"pronounced, persistent and pervasive decline in aggregate economic activity\" based largely on GDP and the job market.\nThe COVID-19 pandemic is still less than two months old in Canada, but the council said Friday that the slowdown is already so swift and deep that it's safe to declare a recession already.\n\"The council agreed the magnitude of the contraction makes it extremely unlikely that any future adjustments will overturn the conclusion of a major drop in economic activity in the first quarter,\" the council said.\nDeclaring a recession is always controversial, since there is no unanimous view as to what qualifies as one. By the \"two quarters of economic decline\" definition, Canada had a brief, slight recession in late 2014 and early 2015, as the price of oil crashed.\nBut the Business Cycle Council still says that slowdown didn't meet the bar as an official recession by their metrics.\nIn the council's view, this is the first recession Canada has seen since the financial crisis that began in 2008. And the data suggests this one is on track to be quite a bit worse than that one.\nThe March jobs report showed more than a million jobs were lost in the month, while a preliminary estimate by Statistics Canada suggested the economy contracted by nine per cent in the same month. Those are the biggest one-month plunges in jobs and GDP on record in Canada.\nWhile the decline in March was record-setting, economists expect the data for April will show an even bigger drop, with the measures taken to slow the spread of the coronavirus in place for the entire month.\nThe eight-person council, which normally meets once a year in December, decided to meet twice last month, once it became clear that something dramatic was happening to Canada's economy.\nStephen Gordon, an economics professor at Université Laval and member of the council, says the current economic slowdown is a great example of how the \"two quarters of contraction\" definition of a recession is too dogmatic.\nIn a series of tweets on Friday, he noted that if the slowdown had started in April as opposed to March, the entire first quarter would have been excluded. And since a rebound in the summer is quite plausible, that would make the current recession only one-quarter long — deep though it may be.\n\"This episode would fail the two-quarter test, even though it's obviously a recession,\" he said.\nThe current episode is a good illustration why the the \"2 quarters of declining GDP\" definition of a recession is not a hard-and-fast rule. 1/\nStatistics Canada reported Thursday that economic growth had stalled going into the crisis, with real gross domestic product essentially unchanged in February due to teacher strikes in Ontario and rail blockades across many parts of the country.\nThe official estimates of GDP for March and the first quarter of 2020 will be released on May 29.\n"}, {"author": "David Cochrane", "title": "Deficit reduction will have to wait for the economic recovery, federal officials say", "description": "Federal aid programs could continue well into the recovery phase, says government official", "url": "http://www.cbc.ca/news/politics/covid-pandemic-coronavirus-deficit-debt-1.5561513", "urlToImage": "https://i.cbc.ca/1.5561869.1588962494!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-consumer-motivations-20200507.jpg", "publishedAt": ["May 09, 2020 4:00 AM ET", "2020-05-09T08:00:00.610Z"], "source": "CBC News", "content": "As the fallout from COVID-19 adds hundreds of billions of dollars to the national debt, senior federal officials say there will be no aggressive attempts at deficit reduction until Canada's economic recovery is well underway.\nInstead, the immediate aim will be to keep using the government's balance sheet to extend federal aid programs and eventually ramp up stimulus spending, instead of trying to quickly reduce the deficit.\n\"I think [deficit reduction] really can't happen until you know the full extent of the damage and until you get a measurement of what this did to us,\" said a senior federal official speaking on background.\n\"If you want to make this as painless as possible for people, you wouldn't rush it.\"\nThe federal deficit is ballooning due to the combination of multi-billion dollar aid programs and an economic slump that dwarfs any other recession in modern history.\nParliamentary Budget Officer [PBO] Yves Giroux forecast the deficit for this year will amount to at least $250 billion — essentially more than a decade of the Trudeau government's annual deficits in a single year.\nAs troubling as those numbers are, there are others that worry the government more.\nThe most recent data from Statistics Canada show that three million Canadians lost their jobs during the first stage of the pandemic. Millions more have lost most of their work hours. In total, 5.5 million people have either lost their jobs or have been working far less since the week of April 12.\n\"These numbers tell us what we already knew – that right now, Canadians are hurting because of this pandemic,\" Prime Minister Justin Trudeau said Friday. \nThe hurt likely goes even deeper than those numbers suggest.\nAlready, 7.7 million Canadians are getting cheques through the Canadian Emergency Response Benefit, while 1.7 million workers have qualified for the federal emergency wage subsidy.  More than 45 per cent of the labour force is now receiving some sort of federal government support.\nWatch: The pandemic and essential workers\nEven as some provinces inch toward reopening their economies, there are few signs of rapid economic improvement. The PBO's office projects the economy could shrink by as much as 30 per cent in the second quarter.\nIn a recent article for Policy Magazine, former parliamentary budget officer Kevin Page said the staggering economic data left the government with two clear choices: run up the debt to help households and businesses and increase the odds of recovery and longer-term growth — or offer less help, minimize debt growth and diminish the chances of recovery.\n\"All countries will wake up after the global pandemic with much higher debt levels. Canada is fortunate because we are starting at a much lower net debt-to-GDP level,\" Page wrote. \"If low interest rates are maintained, there is no good policy case for rushing to austerity — either spending cuts or tax increases. The economic recovery will likely be much too weak and fragile for austerity.\"\nFederal bureaucrats are in the middle of a review of pandemic-related aid programs, primarily to see if they need to be tweaked or extended. What could emerge from that process is what the senior official described as a \"glide-and-launch phase,\" where some direct aid programs slowly wind down while economic stimulus programs are launched.\nTrudeau revealed one of the first steps of that review on Friday when he announced that the wage subsidy program would continue beyond June to help kick-start the reopening of provincial economies and allow people to move from the CERB to paid work.\n\"We need an economy to come back to and direct support is a key part of that,\" said a finance official speaking on background. \"Everything is going to be largely dependent on where we are and what the needs are.\"\nBut even as the federal government prepares for the next phase of its pandemic response, it's still busy trying to deal with the first wave of challenges. The already-extended wage subsidy is still in the getting-money-out-the-door phase. There's also the unfulfilled promise of direct financial help for seniors to address. And hard-hit sectors such as airlines, energy and hospitality will need some kind of sector-specific bailouts.\n\"The big business bailout is the hardest one to do out of all of them,\" said the senior federal official. \"How do you bridge people to a better time and what do you get in return for that?\"\nPart of the government's concern here is the risk of being seen bailing out companies that use tax havens or engage in tax avoidance. There's a desire at the federal level to make sure that any bailout includes a degree of public oversight and can support the argument that it was done in the public's interest.\n\"We will, over the coming days, start looking at specific sectoral supports,\" Trudeau said Friday. \"But even then, our focus will be on the workers … and not on the corporate well-being of an industry or sector.\"\nAnd while airlines have been promised some sort of help, public transit companies are also knocking on Ottawa's door. The Trudeau government is a big booster of mass public transit and a big spender when it comes to capital investment to boost transit capacity.\nBut transit operations are largely a municipal responsibility. Ottawa is trying to find a way to help that sector without becoming a long-term player in transit policy.\nAs this crisis continues, jurisdictional lines are blurring. Many municipal and provincial governments were in precarious financial situations going into the pandemic and will be even more vulnerable as they emerge from it. The Bank of Canada already has launched a multi-billion dollar program to buy provincial government bonds because provinces like Newfoundland and Labrador have had trouble borrowing on the open market.\nAll of this will require Ottawa's attention when the dust settles — and billions of dollars more in federal spending may be required. Senior Liberals are already conceding they may need to go slower and be less aggressive on their campaign commitments, because the virus has presented them with an urgent new set of priorities.\n\"We are not yet talking about stimulus,\" Trudeau said. \"We are still very much in the support and emergency phase right now.\"\nBut the costs will keep growing. We still have no clear idea of how much this will cost the country. And the government's view is that it's still too early to talk about paying the bill.\n"}, {"author": "Jordan Press", "title": "Federal deficit could top $252 billion, says budget officer", "description": "PBO report assumes real GDP will contract by 12 per cent this year", "url": "http://www.cbc.ca/news/politics/pbo-deficit-covid-1.5550498", "urlToImage": "https://i.cbc.ca/1.5138746.1558027091!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/phoenix-pay-system.jpg", "publishedAt": ["Apr 30, 2020 10:21 AM ET", "2020-04-30T17:03:05.669Z"], "source": null, "content": "Parliament's budget watchdog says it's likely the federal deficit for the year will hit $252.1 billion as a result of the COVID-19 pandemic — and could go even higher if emergency measures remain in place longer than planned.\nThe figure is an estimate based on the almost $146 billion in spending measures the government has announced to help cushion the economic blow from the pandemic, estimated declines in the country's gross domestic product and the price of oil remaining well below previous expectations.\nParliamentary budget officer Yves Giroux's report assumes real GDP will contract by 12 per cent this year and help push the federal debt-to-GDP ratio to 48.4 per cent.\n\"To date, budgetary measures announced by the government are intended to be temporary. Once the budgetary measures expire and the economy recovers, the federal debt-to-GDP ratio should stabilize,\" Giroux says in a statement.\n\"But if some of the measures are extended or made permanent, the federal debt ratio will keep rising.\"\nHe also warns that extra spending may be required if the situation persists for longer than expected, or the economy is slow to recover when restrictions are lifted.\nHis report says the estimates are one possible scenario if current public health measures remain in place or are slowly — but not entirely — lifted over the rest of the calendar year.\nThe Liberals have said that they would spend what's needed in order to bridge businesses and workers through the crisis. Prime Minister Justin Trudeau wouldn't speculate Thursday on how the government would handle the massive deficit once the economy rebounds.\n\"There will be time after this is all done as we figure out how exactly this unfolds, where we will have to make next decisions on how that recovery looks,\" he said at a news conference on Parliament Hill, \"but right now our focus is on getting through this together as a country.\"\nThe restrictions that were put in place in March across the country forced non-essential businesses to close their storefronts. Many employees who could were sent to work from home, while others were laid off or had their hours slashed.\nSo far, more than seven million people have received federal emergency aid through the Canada Emergency Response Benefit, which has paid out more than $25.6 billion in benefits, based on the latest federal figures.\nThe Liberals have budgeted $35 billion for the CERB, which pays $2,000 a month for up to 16 weeks to anyone whose income has dropped below $1,000 a month. Giroux's report estimates the measures will end up costing the government $35.5 billion.\nA more detailed note explaining the figure, published separately this morning, estimates the CERB will end up reaching 8.5 million people.\nBut the note warns the estimates are \"highly sensitive\" to the course the economy takes over the coming months, as well as the spread of COVID-19. And some of the spending will depend on how the program interacts with a new wage subsidy program that begins payments next week.\nGiroux also estimates the wage subsidy program will cost $76 billion, slightly more than the $73 billion price tag the Liberals have put on the measure.\nThe subsidy will cover 75 per cent of employee salaries, up to $847 a week, for 12 weeks, retroactive to mid-March and through to the start of June.\nIn a costing note specifically about the subsidy, the PBO says the cost of the program will depend somewhat on the behavioural response of employers.\n"}, {"author": "Jesse Hajer and Lynne Fernandez", "title": "Austerity and COVID-19: Manitoba government creating, not solving, problems", "description": null, "url": "http://www.cbc.ca/news/canada/manitoba/manitoba-government-economy-covid-19-1.5539666", "urlToImage": "https://i.cbc.ca/1.5539238.1587498532!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-mba-20200415.jpg", "publishedAt": ["Apr 21, 2020 4:24 PM CT", "2020-04-21T21:24:17.437Z"], "source": null, "content": "COVID-19 has upended communities and economies across the globe. Canadian political leaders have taken unprecedented steps to slow the spread of COVID-19, including the closure of non-essential businesses, schools and universities. These measures, while necessary, have led to a severe drop in economic output and employment.\nIn response, governments in Canada, as elsewhere, are intervening in economic affairs in a manner not seen in generations.\nThe scale of the crisis and its exposure of woefully inadequate social safety nets has led to even established conservative voices calling for a permanent growth of the role of government in the economy.\nThe approach of the Manitoba government has been restrained compared to other Canadian jurisdictions, particularly with economic measures and supports aimed at low-income Manitobans and workers who have lost their jobs.\nMany of the economic measures announced to date have taken the form of tax and payment deferrals, as opposed to flat-rate cash benefits that have played a role in the federal response.\nThis week, the provincial response appears to be moving from lacklustre to straight-up counterproductive. \nTwo sets of austerity measures aimed at cutting provincial costs are planned: the first is reducing the employment and wages of public sector workers, with a target of $500 million (but under some scenarios discussed, that number would be as high as $900 million).\nThe second measure is to cut spending by $750 million through other spending control mechanisms. This has involved directing government departments to compile lists of service providers funded by the province, for the purposes of making cuts to these organizations.\nThe lack of support and cuts are in stark contrast to the way other provinces are responding. The Manitoba response is the opposite of what standard economic theory would suggest in a recession.\nMaintaining government employment and spending supports the overall \"aggregate demand\" for goods and services. This demand creates sales for businesses and supports jobs.\nEconomists statistically quantify these effects with multipliers reflecting how $1 in spending in the economy leads to more than $1 in economic activity, because that spending is revenue for someone else, and in turn stimulates more spending/revenues, etc.\nThe opposite is also true, with spending cuts having negative ripple effects throughout the economy. This is a big part of the reason the government of Canada has come up with several programs to flow money to Canadians during this crisis. \nWe can use multipliers to estimate the overall impact of the proposed government of Manitoba cuts on labour incomes, income tax revenues and economic activity in Manitoba.\nTo cut public sector employment, the government is proposing a federal work-share program where \"non-essential\" government workers would be reduced to working two or three days a week, while the federal government would pay benefits for the remaining two or three days at 55 per cent of salary, up to the maximum annual insurable earnings of $54,200.\nFor the public service as a whole, we estimate they will keep on average 67 per cent and 78 per cent under the two scenarios.\nUsing the multiplier approach, we estimate that the combined impact of the proposed work-share program and $750 million in additional cuts will result in:\nThe provincial government claims that COVID-19 expenditures and lost revenue will require a $5-billion increase to the provincial deficit, pushing us to the edge of a looming \"fiscal cliff.\"\nThis $5 billion fear-mongering assumes that the monthly deficit increase being experienced now will continue for the entire fiscal year.\nThis is not consistent with economic forecasts that predict the impact to be concentrated in one or two quarters of 2020, as social distancing measures are gradually relaxed.\nAs a comparison, the $5 billion works out to approximately $3,650 per Manitoban, while all of New York state, with a current infection rate 70 times that of Manitoba, is estimating a fiscal impact of $770 US per person.\nEven giving the province the benefit of the doubt on the questionable $5 billion estimate, what would be the actual impact of fully funding this $5 billion deficit through government borrowing?\nThis is an important question, as the government should be borrowing at this time.\nOur debt is currently at $26.7 billion. The most widely accepted measure of the effect of debt on the economy is the debt to GDP ratio (debt/GDP).\nGoing into 2020, GDP was around $74.8 billion, so our debt/GDP was 34.3 percent. Although this is higher than what it was 10 years ago, it is a perfectly manageable ratio.\nThe $5 billion extra debt will put our debt up to $31.7 billion.\nWe know that our economy, like every other economy in the world, is going to shrink. Assuming a 3.1 per cent reduction, our GDP could fall to $72.5 billion.\nThat will bring our debt/GDP to 44 per cent. A 44 per cent debt/GDP ratio is underwhelming given the enormity of the crisis we face. In fact, this new ratio is still less than some other provinces had in 2017.\nThere are also two moving parts to the debt/GDP ratio: if the Manitoba government spends and allows the debt to increase, the economy is stimulated, increasing GDP. Shoring up Manitoba's economy now will increase our capacity to weather the crisis, rescue our businesses, grow in the future and repay the debt later.\nHow much of a difference would this borrowing actually have on our debt servicing charges?\nAssuming we were to borrow the $5 billion at Manitoba's going rate of 3.2 per cent for a 30-year bond, we would incur debt servicing charges of $260 million/year. Dramatic as this number sounds, the PST cut in 2019 cost us $330 million in annual revenues.\nOnce the economy recovers, we can look at new taxes on high income earners taxes and reverse tax cuts, if necessary, to manage the debt.\nIt seems as if Premier Pallister thinks the real crisis is one of provincial government debt, whatever the amount turns out to be — not the hardships people and businesses are facing as they lose customers, jobs, wages and security.\nThe premier insists that we need all hands on deck to deal with this calamity, yet is unwilling to commit his government to do its part.\nWhere our economy lands when we come out of the pandemic depends on him stepping up to the plate sooner rather than later. That includes using government borrowing for necessary expenditures rather than putting that burden on the backs of workers and business and, as a consequence, dealing the economy another blow.\nThis column is part of CBC's Opinion section. For more information about this section, please read this editor's blog and our FAQ.\n"}, {"author": null, "title": "Diverting water from Lake Diefenbaker could help expand Sask. agriculture, Ralph Goodale says", "description": "Conduit infrastructure would cost about $3B", "url": "http://www.cbc.ca/news/canada/saskatchewan/diverting-water-from-lake-diefenbaker-could-help-expand-sask-agriculture-ralph-goodale-says-1.5560773", "urlToImage": "https://i.cbc.ca/1.4216709.1500666872!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/lake-diefenbaker.jpg", "publishedAt": ["May 08, 2020 5:00 AM CT", "2020-05-08T11:00:00.021Z"], "source": "CBC News", "content": "Ralph Goodale, former Regina MP, thinks an old idea could provide a fresh start for Saskatchewan's agricultural industry.\nThe idea — conduits in Lake Diefenbaker which could divert water in four different directions to other parts of the province — would effectively prevent flood or drought in large portions of the province's grain belt, Goodale said.\n\"I think the time has come to finish the vision,\" Goodale told CBC Radio's The Afternoon Edition on Thursday. \"It would vastly expand our productive capacity in agriculture.\"\nThe former federal cabinet minister said the diversions could irrigate about 400,000 acres of farmland — roughly 161,874 hectares — and increase its capacity for production.\n\"The other thing it does is directly addresses the consequences of climate change on the prairies by giving us the infrastructure capacity to control water flows,\" he added.\nThe idea of conduits, though they've never materialized, were motivation behind the constructions of the Gardiner Dam, Lake Diefenbaker and Douglas Provincial Park, Goodale said.\n\"You expand agriculture, more diversification, more innovation and probably in the process of building and running this project, the experts are saying you would add something like four per cent to Saskatchewan's GDP,\" he said.\nThe cost is estimated at $3 billion. Goodale said there would also have to be a thorough examination and review of the environmental impact of such a project. Indigenous communities would also have to be \"thoroughly consulted.\"\n60 per cent of Saskatchewan gets its fresh drinking water from Lake Diefenbaker, said Goodale. Despite this, he said more water evaporates than is used by the public.\nWatershed associations, livestock producers, grain farmers, irrigation farmers, academics at the universities of Regina and Saskatchewan have all expressed interest in such a project during discussions, he added.\n\"There are a number of things coming together at this moment in time that I believe will lead you to the conclusion that this idea, which emanated from the 1930s — finally its time has come.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1732927555961", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Robert Chernomas and Ian Hudson", "title": "Rowing against the tide of history: Pallister's pandemic response could do lasting damage to Manitoba economy", "description": "Wherever and whenever it has been tried, austerity has failed as an economic strategy, say U of M professors", "url": "http://www.cbc.ca/news/canada/manitoba/opinion-coronavirus-manitoba-economy-history-1.5542552", "urlToImage": "https://i.cbc.ca/1.5542627.1587662048!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/virus-outbreak-depression-era-echoes.jpg", "publishedAt": ["Apr 25, 2020 6:00 AM CT", "2020-04-25T11:00:00.271Z"], "source": null, "content": "Manitoba's provincial government is keen to have us all row in the same direction to combat COVID-19.  But currently, Brian Pallister's government is not only failing to dip its oar in the water, it's actively rowing in the wrong direction.\nWhen there is a crisis, we turn to government. In order to prevent the collapse of the economy, aggressive fiscal and monetary policy become the order of the day. \nThe Manitoba government, though, appears to disagree with the weight of historical evidence, preferring to focus on the costs to the provincial treasury rather than costs of the government's lack of action on the lives of Manitobans. \nAs economist Joseph Stiglitz put it, when you are at war, you don't ask \"Can we afford it?\" \nIn 1930, as the Great Depression took hold in the U.S., President Herbert Hoover infamously made the depression worse by focusing on balancing the budget. As the Great Depression wore on, deficit spending became widely accepted as a remedy to mitigate the crisis (as historian Michael Horn put it, \"only government could keep hundreds of thousands of Canadians from starving or freezing to death\").\nBut the spending was too parsimonious to actually end the Depression. \nWhen the Second World War began, government spending expanded significantly, essential to winning the war and finally getting us out of the Great Depression. At the end of the war in the U.S. and Canada, the debt-to-income ratio rose to historic levels — in 1946, Canada's debt was 109 per cent of GDP. \nIt declined over the next few decades while the economy prospered not because anxious post-depression governments cut public spending, but in part because they spent taxpayer dollars to develop our modern health and education sectors, making productive investments in infrastructure and research.\nRather, the government used the resulting growth in GDP to pay down the debt over time. Keynesian economics 101. \nIn the 2008 Great Recession, the opposition parties forced Conservative Prime Minister Stephen Harper to pass a massive fiscal stimulus package to prevent unemployment and bankruptcy. The Bank of Canada contributed tens of billions of dollars to shore up our financial system.\nThe Bush and Obama administrations in the U.S. did the same to stave off a potential repeat of the Great Depression. In the early days of the crisis, conservative Republican George W. Bush argued that without a government bailout of the financial sector, \"this sucker could go down.\"\nThe treasury bailed out the financial system and Obama's $800-billion stimulus bill extended unemployment benefits, rebuilt roads and bridges, prevented teacher layoffs and provided temporary help for people who lost their jobs or needed other assistance because of the poor economy. For economists like Paul Krugman, while the stimulus prevented a deeper decline in the economy, it should have been much larger.\nIn the current pandemic crisis, Prime Minister Trudeau is clearly paying attention to these lessons of history by ensuring the needy will not freeze in the dark, that the federal public sector maintains its workforce and wages, and that businesses and their workers will get support. \nHe understands that without this kind of government support, huge structural problems with the economy will prolong the pain well beyond the end of the pandemic. \nLike Hoover, though, the Pallister government is rowing in the opposite direction by pursuing its long-standing desire to reduce the size of the government with plans to cut funding for charities and non-profit organizations, the public sector and the universities.\nThe province is threatening to lay off workers and cut wages in the middle of the pandemic.\nThus far, the provincial government's underwhelming support measures consist of hiring a local firm to set up a call centre to help Manitobans access federal money and a program to give eligible small businesses $6,000 each, neither of which suggests a government committed to addressing the massive economic downturn caused by the crisis.\nEconomists Jesse Hajer and Lynne Fernandez estimate that the proposed cuts would reduce provincial GDP by between $1.3 and $1.5 billion. Members of Manitoba's business community have described the province's approach as \"penny wise and pound foolish.\"\nAs Stiglitz suggests, such cutbacks in jobs and funding \"will show up in the unemployment statistics, but the deeper effects — on our economic growth and social fabric — won't be fully apparent for years to come.\" \nNo other government in Canada has done more to damage  our future with less economic justification than the government of Manitoba.  \nAs Asper School professor Shiu-Yik Au perceptively pointed out, while Ontario and Quebec face greater health costs from the pandemic, both provinces have taken much greater responsibility to help their citizens. \nAmong its actions, Ontario increased payments to low-income seniors and families with children, and funded Indigenous communities and municipalities. In Quebec, the government has provided emergency support to small and medium businesses, the tourism industry, and workers. Both of these provinces have higher debt-to-GDP levels than Manitoba. \nAusterity has failed as an economic strategy wherever and whenever it has been tried. The Pallister government is rowing against the tide of history, creating lasting damage for Manitobans to clean up for years to come.\nThis column is part of CBC's Opinion section. For more information about this section, please read this editor's blog and our FAQ.\n"}, {"author": "Aaron Saltzman", "title": "COVID-19 has world's major economies on track for worst quarterly decline in history", "description": "Yearly numbers should be better, but economists warn recovery could take months", "url": "http://www.cbc.ca/news/business/covid19-economy-jobs-oil-gdp-1.5533030", "urlToImage": "https://i.cbc.ca/1.5533734.1586988539!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/aritzia-retail-vancouver-recession.jpg", "publishedAt": ["Apr 16, 2020 4:00 AM ET", "2020-04-16T17:49:42.553Z"], "source": "CBC News", "content": "The flood of negative economic indicators caused by COVID-19 is set to reach epic proportions in the second quarter, with the world's major economies poised to see a decline unlike any before.\n\"I don't think there's any question that the second quarter of this year is going to show the worst numbers for all major economies in recorded history,\" said Brett House, deputy chief economist at Scotiabank Economics.\nIn the U.S., Morgan Stanley economists are predicting a 30.1 per cent drop in gross domestic product from April to June compared to last year.\nThe Bank of Canada says there could be a similar decline in GDP in this country, with economic activity 15 to 30 per cent lower in the second three months of the year compared to the end of 2019. But the bank also said there's no point in releasing a formal forecast for the second quarter.\n\"The outlook is too uncertain at this point to provide a complete forecast,\" the bank said in its policy announcement Wednesday.\nScotiabank's House said recessions normally play out over multiple quarters. \"In this case, we are compressing the downturn into one [quarter]. Which means the sharpness is particularly pronounced. And that's why we're getting these record numbers.\"\nWatch: COVID-19 will hit the economy hard \nThe historic numbers, the breakneck speed of the downturn, the job losses centred in the labour-intensive services sector, the unpredictability of the virus and the long-term effect on consumer behaviour all make the COVID-19 recession unlike any other seen in modern economic history. All of those factors also make it next to impossible to determine how long it will take to recover. \n\"Economists for the first time ever are making their economic predictions based off of medical predictions. That's creating a fog of uncertainty,\" said Frances Donald, chief economist and head of Macro Strategy at Manulife Investment Management.\n\"And it's leading major central banks, including the Bank of Canada, to throw up their hands and say 'forecasting? We just can't do it.'\" \nThere are a slew of other new indicators pointing to the unprecedented nature of the economic downturn.\nNormally, Statistics Canada releases monthly GDP data 60 days after the period ends. But the pandemic prompted the agency to produce what it calls a flash estimate of GDP for March on Wednesday, even before several indicators for February are released. \nStats Can said its estimate indicates a decline of approximately 9 per cent in March, the largest one-month decline in GDP since the series started in 1961.\nWATCH | IMF lauds speed, generosity of donor countries in helping poor countries sideswiped by COVID-19\nCanada is also being hammered by collapsing oil prices, caused by a price war between OPEC members Saudi Arabia and Russia, but made exponentially worse by world lockdowns.\nA report by the International Energy Agency (IEA) released Wednesday said global demand for oil will drop by a further 29 million barrels per day in April, a record decline back to levels not seen since the mid-1990s. The IEA also said the buildup of unsold oil from the first part of the year \"threatens to overwhelm the logistics of the oil industry — ships, pipelines and storage tanks — in the coming weeks.\"\nCOVID-19 also caused Canadian home sales to plunge 14 per cent in March. But even that number is out of date.\nConsider early numbers for Toronto, Canada's largest real estate market, show a drop in listings of 64 per cent in the first two weeks of April and sales down a staggering 80 per cent. \n\"The people who are in the marketplace are serious buyers but just the sheer volume has dropped off significantly,\" said Cailey Heaps Estrin, managing director of Heaps Estrin Real Estate in Toronto.\nShe said they have had a number of sales including one this week with three bidders that sold for more than $100,000 over asking. But she said they're not proactively going out and bringing listings to market.\n\"We are having video meetings with people getting ready to launch their listings once the [lockdowns] are lifted.\" \nBut even when travel and social distancing restrictions are relaxed, few economists expect the overall economy to immediately spring back to life.\n\"It's pretty easy for us to turn a manufacturing plant back on and have widgets come out on a conveyor belt,\" said Manulife's Frances Donald. \"It's a lot harder to tell people 'go shake hands, go to a movie theatre, sit in a restaurant' when they still feel their personal safety is at risk.\" \n\"This recession, the length of it, is really going to be dependent on the evolution of the virus.\"\n"}, {"author": "Sean Kavanagh", "title": "Wage reductions, more layoffs for City of Winnipeg workers part of worst-case COVID-19 scenarios", "description": "City comes up with action plans for 3 possible outcomes of coronavirus pandemic", "url": "http://www.cbc.ca/news/canada/manitoba/winnipeg-covid-economic-analysis-layoffs-wages-1.5539511", "urlToImage": "https://i.cbc.ca/1.3720306.1471143662!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/winnipeg-city-hall.JPG", "publishedAt": ["Apr 21, 2020 11:50 AM CT", "2020-04-21T22:50:20.209Z"], "source": "CBC News", "content": "The City of Winnipeg has released three scenarios and three possible courses of action to contend with the financial implications of COVID-19.\nThe grimmest would see the city negotiate temporary wage reductions for all employees, lay off more staff and drain cash from some of its reserves.\nThat worst case is something Mayor Brian Bowman hopes will be avoided.\n\"There [are] some pretty ugly things in those tiers as you get further down to Tier 3\" in the city's scenarios, Bowman said Tuesday.\n\"We hope we are not in a position where we have to consider those, because hopefully the economy is in a position where it is doing what it should be doing, and we hope to see supports from other levels of government.\"\nThe municipal government has already laid off more than 650 temporary workers and frozen some spending.\nThe city is also already poised to reduce transit service in April, finance some capital projects instead of using cash, and freeze wages for non-union staff.\nThe latest fiscal outline is included in a presentation to the city's finance committee, which is scheduled to meet next Monday.\nThe report looks at three possible scenarios for the economic impact of the health crisis.\nIn the first, the assumption is made that COVID-19 remains a public health issue through the summer of 2020, social distancing measures begin to end by September and gross domestic product (GDP) contracts 3.1 per cent in 2020 and then grows 2.5 per cent in 2021. \nThe second projects a second wave of COVID-19 beginning in December 2020 and social distancing measures once again being put in place until April 2021. GDP contracts 3.5 per cent in 2020 and then grows 0.8 per cent in 2021.\nThe third and most dire scenario is based on a more severe second wave of COVID-19 that hits the economy even harder. Social distancing measures stay in place until May 2021, non-essential businesses are shuttered and there is another global economic slowdown. \nIn the worst-case scenario, GDP contracts 3.5 per cent in 2020 and a further one per cent in 2021.\nEven the best-case scenario predicts unemployment levels over 10 per cent in 2021 and at worst 15.6 per cent that year.\nThe report says the city's goals through the economic fallout from COVID-19 (beyond maintaining essential services such as police and fire) are to \"sustain employment both privately and publicly\" in the short term and \"be prepared to identify major shovel-ready infrastructure projects\" in the long term.\nThose projects would be financed by either the provincial or federal governments.\nBowman says the commitment to maintain the city's capital spending on roads, sewers and other infrastructure is \"incredibly important to the economic recovery.\"\nThat got support from the Business Council of Manitoba, whose members have grown increasingly concerned about how a recovery would take shape.\n\"The important thing with infrastructure is you get something for your money,\" said business council president Bram Strain. \n\"So you're not giving a subsidy, you're not giving out tax deferral. What … you're actually getting is a solid return. You are buying a product to improve the streets. You've improved the sewer, you've improved the utility system.\"\nRegardless of which scenario unfolds, the city's revenue will drop significantly and its fiscal stabilization fund will be used to make up for the lost income.\nThat's led to the suggestion of other cuts, such as trimming back the Winnipeg Transit schedule. Bowman told reporters Tuesday a decision on that was due soon.\nThe head of the Amalgamated Transit Union says the city should find ways to deploy staff rather than making cuts.\n\"Service cuts at this point will hurt the local economy in the short and long term, and could result in the city losing experienced personnel,\" said ATU 1505 president Romeo Ignacio.\n"}, {"author": "Shiu-Yik Au", "title": "Austerity is the wrong path for Manitoba during coronavirus pandemic: U of M professor", "description": "'We can't afford not to help those around us,' says Asper School of Business assistant prof Shiu-Yik Au", "url": "http://www.cbc.ca/news/canada/manitoba/opinion-cornavirus-manitoba-economy-austerity-1.5534427", "urlToImage": "https://i.cbc.ca/1.5534540.1587055876!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/empty-winnipeg-streets-covid-19.jpg", "publishedAt": ["Apr 16, 2020 3:19 PM CT", "2020-04-16T20:19:00.779Z"], "source": null, "content": "The COVID-19 pandemic has been a tumultuous time for both the health and wealth of all Manitobans.\nHowever, Premier Brian Pallister's and Mayor Brian Bowman's dangerous plans to reduce non-essential government spending during this pandemic — such as laying off workers or reducing government pay to just two days a week — will badly damage our economy.\nThe 2008 financial crisis showed that a better plan is to increase spending during this pandemic.\nPeople often falsely use the analogy of a province or country being akin to a family — if a family has less income, then it should cut back on its expenses. However, a province is not a family — every dollar that the province saves is a dollar (or more) that someone else in the province will not earn. \nIn economics, this is called the paradox of thrift. If everyone in the Manitoban economy cuts back spending, then everyone's income will fall — and as everyone's incomes fall, spending will once again fall, triggering a vicious cycle. Paul Krugman, 2008 Nobel laureate in economics, noted these exact same problems with austerity following the financial crisis.\nAusterity was tried in Europe following the financial crisis of 2008. There, countries desperately cut government spending to balance budgets. The International Monetary Fund found that austerity worsened the financial crisis rather than easing it, as this graph shows.\nEvery $1 reduction in deficit reduced the gross domestic product (GDP) of their country by up to $1.70!\nIf Manitoba were to cut personnel expenditures by 60 per cent for four months, the government would save approximately $118 million — but this could cost the economy up to $201 million.\nIt's clear that fiscal tightening or austerity will be damaging to our province, but that leads to the natural question — what is the best path forward? \nIn this time of fear and uncertainty, we need the government of Manitoba to spend more money. Governments can break the vicious cycle of reduced spending and income by leaning into the wind and spending more in times of crisis. \nFor example, in Ontario, the government has issued greater support for low-income seniors, helped families with children with direct payments, provided funding to Indigenous communities and emergency funding to municipalities, reduced payroll taxes, and many other items. In Quebec, the government has provided emergency support to small and medium businesses, the tourism industry, and workers.\nThe province of Manitoba should enact similar measures that focus on individuals who are less able to handle the economic shock, such as the homeless, youth, single-parent families, etc. \nThe province's existing programs could be enhanced temporarily to expand employment and income assistance, the Manitoba child benefit, rent assist, and 55 Plus, etc., to a larger group of individuals.\nFurther, the province could replicate some of the better programs from other provinces, such as emergency loans to small businesses or reducing payroll taxes. These temporary enhancements would help Manitoba weather this crisis and avoid a long-lasting recession or even a depression.\nCan Manitoba afford short-term emergency measures like this? The answer is, resoundingly, yes. \nManitoba's 2018-2019 debt was 34.4 per cent of GDP, which was lower than Ontario's and Quebec's debt levels, both of which are suffering more heavily at the hands of COVID-19. Yet both of those provinces have enacted large spending programs during the pandemic. \nWe are lucky that we both have more fiscal room to act and less damage from the virus and should act more. \nBack to the lessons learned from 2008.\nThere were European countries that increased their government spending: Belgium, Finland, the Netherlands and Slovakia were all able to tolerate large increases in government debt.\nFor example, Finland had a debt equal to 32.7 per cent of GDP before the crisis, which rose to a high of 63.4 per cent in 2015. Belgium had an 87 per cent debt level pre-crisis and that rose to a whopping 107.5 per cent in 2014.\nAll of these countries were able to increase spending and survive the increase in debt, and continue to thrive today.\nThese countries' debt-to-GDP levels typically peaked between six and seven years after the crisis, and then started to decline through a combination of increased GDP growth and controlled government spending. Thus, Manitoba could increase its debt during this pandemic and then control spending over the next six or seven years, to reduce debt to more manageable levels. \nThis is less damaging than cutting during the pandemic as the economy is less sensitive to government spending in economic boom times.\n_______________________________________________________________________\n______________________________________________________________________\nManitobans have a proud history of protecting their communities. We should continue this tradition by avoiding the dangerous short-term path of austerity and cutbacks, as this will only lead to greater economic problems. \nInstead, we should spend more to help our most vulnerable during this pandemic: the sick, the elderly, the poor and our brave essential workers. \nWe can't afford not to help those around us.\nThis column is part of CBC's Opinion section. For more information about this section, please read this editor's blog and our FAQ.\n"}, {"author": "Shiu-Yik Au", "title": "Austerity is the wrong path for Manitoba during coronavirus pandemic: U of M professor", "description": "'We can't afford not to help those around us,' says Asper School of Business assistant prof Shiu-Yik Au", "url": "http://www.cbc.ca/news/canada/manitoba/opinion-coronavirus-manitoba-economy-austerity-1.5534427", "urlToImage": "https://i.cbc.ca/1.5534540.1587055876!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/empty-winnipeg-streets-covid-19.jpg", "publishedAt": ["Apr 16, 2020 3:19 PM CT", "2020-04-16T20:19:00.779Z"], "source": null, "content": "The COVID-19 pandemic has been a tumultuous time for both the health and wealth of all Manitobans.\nHowever, Premier Brian Pallister's and Mayor Brian Bowman's dangerous plans to reduce non-essential government spending during this pandemic — such as laying off workers or reducing government pay to just two days a week — will badly damage our economy.\nThe 2008 financial crisis showed that a better plan is to increase spending during this pandemic.\nPeople often falsely use the analogy of a province or country being akin to a family — if a family has less income, then it should cut back on its expenses. However, a province is not a family — every dollar that the province saves is a dollar (or more) that someone else in the province will not earn. \nIn economics, this is called the paradox of thrift. If everyone in the Manitoban economy cuts back spending, then everyone's income will fall — and as everyone's incomes fall, spending will once again fall, triggering a vicious cycle. Paul Krugman, 2008 Nobel laureate in economics, noted these exact same problems with austerity following the financial crisis.\nAusterity was tried in Europe following the financial crisis of 2008. There, countries desperately cut government spending to balance budgets. The International Monetary Fund found that austerity worsened the financial crisis rather than easing it, as this graph shows.\nEvery $1 reduction in deficit reduced the gross domestic product (GDP) of their country by up to $1.70!\nIf Manitoba were to cut personnel expenditures by 60 per cent for four months, the government would save approximately $118 million — but this could cost the economy up to $201 million.\nIt's clear that fiscal tightening or austerity will be damaging to our province, but that leads to the natural question — what is the best path forward? \nIn this time of fear and uncertainty, we need the government of Manitoba to spend more money. Governments can break the vicious cycle of reduced spending and income by leaning into the wind and spending more in times of crisis. \nFor example, in Ontario, the government has issued greater support for low-income seniors, helped families with children with direct payments, provided funding to Indigenous communities and emergency funding to municipalities, reduced payroll taxes, and many other items. In Quebec, the government has provided emergency support to small and medium businesses, the tourism industry, and workers.\nThe province of Manitoba should enact similar measures that focus on individuals who are less able to handle the economic shock, such as the homeless, youth, single-parent families, etc. \nThe province's existing programs could be enhanced temporarily to expand employment and income assistance, the Manitoba child benefit, rent assist, and 55 Plus, etc., to a larger group of individuals.\nFurther, the province could replicate some of the better programs from other provinces, such as emergency loans to small businesses or reducing payroll taxes. These temporary enhancements would help Manitoba weather this crisis and avoid a long-lasting recession or even a depression.\nCan Manitoba afford short-term emergency measures like this? The answer is, resoundingly, yes. \nManitoba's 2018-2019 debt was 34.4 per cent of GDP, which was lower than Ontario's and Quebec's debt levels, both of which are suffering more heavily at the hands of COVID-19. Yet both of those provinces have enacted large spending programs during the pandemic. \nWe are lucky that we both have more fiscal room to act and less damage from the virus and should act more. \nBack to the lessons learned from 2008.\nThere were European countries that increased their government spending: Belgium, Finland, the Netherlands and Slovakia were all able to tolerate large increases in government debt.\nFor example, Finland had a debt equal to 32.7 per cent of GDP before the crisis, which rose to a high of 63.4 per cent in 2015. Belgium had an 87 per cent debt level pre-crisis and that rose to a whopping 107.5 per cent in 2014.\nAll of these countries were able to increase spending and survive the increase in debt, and continue to thrive today.\nThese countries' debt-to-GDP levels typically peaked between six and seven years after the crisis, and then started to decline through a combination of increased GDP growth and controlled government spending. Thus, Manitoba could increase its debt during this pandemic and then control spending over the next six or seven years, to reduce debt to more manageable levels. \nThis is less damaging than cutting during the pandemic as the economy is less sensitive to government spending in economic boom times.\n_______________________________________________________________________\n______________________________________________________________________\nManitobans have a proud history of protecting their communities. We should continue this tradition by avoiding the dangerous short-term path of austerity and cutbacks, as this will only lead to greater economic problems. \nInstead, we should spend more to help our most vulnerable during this pandemic: the sick, the elderly, the poor and our brave essential workers. \nWe can't afford not to help those around us.\nThis column is part of CBC's Opinion section. For more information about this section, please read this editor's blog and our FAQ.\n"}, {"author": "Salimah Shivji", "title": "Canada shifts its UN Security Council campaign pitch in response to pandemic", "description": "Trudeau government is convinced it needs to be at the table as nations make post-pandemic plans", "url": "http://www.cbc.ca/news/politics/un-security-council-pandemic-canada-trudeau-1.5556149", "urlToImage": "https://i.cbc.ca/1.5461160.1581528749!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/senegal-canada.jpg", "publishedAt": ["May 05, 2020 5:00 PM ET", "2020-05-05T21:00:00.638Z"], "source": "CBC News", "content": "With the United Nations poised to announce whether the vote on non-permanent Security Council seats will go ahead as scheduled in June, Canada is doubling down on its bid for a seat — and adjusting its pitch to take the COVID-19 crisis into account.\nPrime Minister Justin Trudeau's week-long trip in February to woo African countries for their votes is now a distant memory, as is his cancelled plan to attend the CARICOM summit in Barbados that same month. But the pandemic and the subsequent global economic shutdown have not slowed down Canada's efforts to secure a seat at the UN table.\nThe bid instead has been redirected toward organizing or chairing virtual global conferences the Trudeau government sees as demonstrating Canada's global leadership in a way that could win more votes.\n\"The best campaign is when we don't need to campaign, when we just show our leadership, that this is the type of voice that you would want at the Security Council,\" Foreign Affairs Minister François-Philippe Champagne told CBC News.\nCanada is in a tight fight with Norway and Ireland for the two non-permanent seats out of 10 on the 15-member council that are reserved for Western countries.\nMost experts think Norway has a lock on one of those seats, leaving Ireland and Canada to duke it out for the other one (even though Canada entered the race late).\nBut the Liberal government now sees an opportunity. Champagne said he believes Canada's international standing has grown in 2020, and not only because of its response to the pandemic. The minister also is banking on a boosted profile because of Canada's role in coordinating efforts to investigate the destruction of Ukraine International Airlines Flight 752, which was shot down over Iran in January, killing all 176 passengers and crew.\nChampagne points to the fact Canada is a member of both the G7 and G20, unlike its competitors, and argues that status allows the government to bring other leaders together and \"amplify the voice of other nations\" that are more vulnerable in the current health crisis.\nAnd the pandemic itself also could cut the cost of Canada's campaign for a Security Council seat, which already has set the government back $2 million.\n\"We do a lot of things virtually these days, so it allows us to reach more people without having to go very far,\" Champagne said.\nCritics were questioning the Trudeau government's Security Council campaign even before the global pandemic upended government agendas around the world. Now, the government is saying Canada needs to be at the big table to have a say in how the world recovers from the pandemic — even though the Security Council has been relatively silent on the crisis to date.\n\"It's also in our very selfish national interests that the recovery in other parts of the world is as strong as possible,\" said Canada's Ambassador to the United Nations Marc-André Blanchard, who has been working behind the scenes on the campaign.\n\"This is a table where the entire world wants to be, because when you're around that table you're more influential and you're more relevant.\"\nStill, the factors that made Canada's bid look like a long shot before the pandemic arrived are still in play: a faltering peacekeeping commitment and relatively low foreign aid commitments.\n\"Ireland has been peacekeeping since 1958. It's never stopped,\" said Stephen Lewis, a former Canadian ambassador to the UN who is closely following the race.\n\"Our failure on that front is our most serious Achilles heel in seeking the seat.\"\nThe pandemic has allowed Canada to boost its presence on the international stage. Trudeau participated Monday in an online pledging conference to raise funds for vaccine development, spearheaded by the European Union. While Norway's Prime Minister Erna Solberg pledged more than $1 billion US for vaccine development and eventual distribution, Trudeau pointed to $850 million Cdn Canada already had committed to accelerated vaccine development.\nThat $850 million includes $74 million that's part of the $159.5 million foreign aid package Canada's international development minister announced in April. Ottawa says it's only a beginning.\n\"This takes a global effort,\" Trudeau said Monday at his daily briefing. \"There will be more to come as the world grapples with this pandemic.\"\nStill, Lewis said Canada's international funding commitment maintains the same level of aid Canada has always offered, and the Liberal government needs to work harder to match its \"rhetoric with performance,\" particularly when it comes to the pandemic.\nCanada gives about 0.26 per cent of its GDP in foreign aid. Norway, the world's most generous donor, gives 1 per cent of its GDP.\nThe old way of winning a Security Council seat — having the prime minister or other high-profile ministers show up in foreign capitals to schmooze — is \"a bit of a sham,\" said Lewis. The vote is a secret ballot and the ambassadors who cast the votes don't always follow orders from the top.\nLewis said the popularity of Canada's ambassador could tip the scales, however.\n\"Marc-André Blanchard is the real key to this [campaign],\" he said. \"He's really first-rate and that does not happen often.\"\nGlobal Affairs Canada is campaigning as though the vote will go ahead on June 17, but there is pressure from some nations to postpone it until the fall, given the logistics involved in having 193 representatives of member states vote online.\n"}, {"author": "Alex Soloducha", "title": "Many Sask. restaurants might permanently close due to COVID-19", "description": "Owner of two Regina restaurants says business is down 90%", "url": "http://www.cbc.ca/news/canada/saskatchewan/many-sask-restaurants-might-permanently-close-due-to-covid-19-1.5560661", "urlToImage": "https://i.cbc.ca/1.5560689.1588896405!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/tony-yang.jpg", "publishedAt": ["May 07, 2020 7:03 PM CT", "2020-05-08T01:03:50.509Z"], "source": "CBC News", "content": "Many Saskatchewan restaurants have temporarily closed in the wake of the COVID-19 pandemic. Whether they'll be able to reopen when restrictions are lifted remains uncertain.\nThe province suspended all dine-in service in March, forcing some restaurants to go takeout-only, while others shuttered — some temporarily, some permanently.\nTony Yang owns both Tipsy Samurai and Wann Izakaya in Regina. Wann is still open for takeout and delivery, but he said business is down between 80 and 90 per cent.\n\"Basically what we're doing right now in one week is what we'd normally do in two, three days,\" said Yang. \"Moneywise, it's really tight right now. We have to cut a lot of costs. We have to try to save every penny we can.\"\nTipsy Samurai, a newer Japanese gastropub in the city's east end has shut down all business during the pandemic. Yang hopes it will reopen someday, but he said he's not sure if that will be possible. \nHe said about 25 employees have been laid off between both locations and some of his kitchen employees are now working as delivery drivers.\nWith last month's income, Yang said Wann is just breaking even. He has pushed some bills and is working every day to cut down on labour costs. \nHe said he's staying afloat through government subsidies and a break on rent. \n\"It's just really hard for a small business like me to make any profit anymore. Basically we're in survival mode right now.\"\nDining in will be allowed in phase three of the province's reopen plan, but restaurants will only be allowed to operate at half capacity. The date for that phase is not yet set and is dependent on the success of the first two phases. \nYang said 50 per cent won't allow for enough customers to make a typical profit, and without help from the government and his landlords, he might be worse off. He said he would still need almost a full staff and would have to limit people's dine-in time. \nJohn Hopkins, CEO of the Regina & District Chamber of Commerce, said it's not surprising that some businesses won't survive the pandemic. \n\"This is a very, very serious challenge that we face economically in this country. We have a health challenge and, no question about it, health is number one, but the economic challenge is enormous in this country and we're seeing the impact of that now.\"\nRestaurants Canada says Saskatchewan establishments are set to lose up to $450 million this quarter. The non-profit organization recently surveyed restaurants in Western Canada and found that about 70 per cent of owners fear they will not be able to pay rent or supplier costs in the next three months. \nRestaurants Canada said Saskatchewan's $2.4 billion food service industry prior to COVID-19 represented three per cent of the province's GDP and was the third-largest private sector employer. \nTwenty-five thousand jobs have been lost in Saskatchewan's food service industry due to the pandemic, it said. \nYang said he hopes local business owners receive more support going forward, both from the government and customers. \n\"I hope everything goes back to normal, like the way it was before,\" Yang said. \"But I know that's maybe a long way to go.\"\n"}, {"author": "Adam Hunter", "title": "Sask. projects revenue loss of $1B to $3B as province faces 'pandemic deficit'", "description": "Finance minister says province will provide 'all financial resources necessary' to combat COVID-19", "url": "http://www.cbc.ca/news/canada/saskatchewan/sask-revenue-projection-1.5536393", "urlToImage": "https://i.cbc.ca/1.5502103.1584565439!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/sask-budget-20200318.jpg", "publishedAt": ["Apr 17, 2020 2:25 PM CT", "2020-04-17T23:55:39.405Z"], "source": "CBC News", "content": "Saskatchewan's finance minister says revenues could decline by between $1.3 billion and $3.3 billion in 2020-21 as the province faces a \"pandemic deficit.\"\n\"The 2020-21 deficit is not a structural deficit,\" Donna Harpauer said Friday. \"It is a pandemic deficit. Saskatchewan will manage through this, because we have the strength, the foundation and the people to do it.\"\nHarpauer left revenue projections off her financial update on March 18 — which was originally supposed to be budget day — due to the economic uncertainty caused by COVID-19. Instead, the government only announced its spending plans. Harpauer announced spending of $14.15 billion for 2020-21, but said that number could rise.\nOn Friday, the province released details of three possible revenue scenarios, based on how long the COVID-19 pandemic affects the province and how low oil prices are.\n\"It is still incredibly difficult to forecast with any certainty. We believe, however, it is important that we release these different scenarios, to let Saskatchewan people know just how much of an impact the pandemic is having on our economy and revenues,\" Harpauer said.\nUnder its three scenarios, the government made assumptions on various economic factors including:\nHarpauer said the province had been on track to announce a budget surplus for 2020-21, but that was scuttled by the pandemic and oil price collapse in March.\nThe Ministry of Finance said in a statement its real GDP projection is a decline of between 4.1 per cent on the optimistic side and 14.9 per cent on the most pessimistic side.\nThe finance minister said revenue is expected to decline in all categories, and she expects spending to go beyond what was outlined in the province's partial budget release, just one month ago.\nShe was also asked whether the situation called for changes to the province's workforce or its employees' hours. \n\"There have been no discussions of needing to reduce the public service at this point in time,\" Harpauer said.\n\"With each and every budget cycle, we review all of that. And we're going to have to be very mindful of our expenditures going forward. But presently, no.\" \nPremier Scott Moe added that people of Saskatchewan can expect some challenging decisions in the future, but also some positives.\n\"They can also expect that we will honour the investments that we had tabled in the legislature, we will honour the collective agreements that are most certainly in place,\" he said.\n\"They can also expect that this is a government that is going to invest in the strength of the economy as we look ahead over the course of the next number of months and next number of years.\"\nOn Wednesday, the Conference Board of Canada released its spring 2020 outlook for Saskatchewan.\nIt is estimating a five per cent decline in the province's GDP this year.\nThe conference board report said school closures and social gathering restrictions were necessary but \"will hurt economic growth in the near term.\"\n\"Employment in the province is expected to fall by 2.8 per cent this year. By industry, we expect to see the largest job losses in the arts, entertainment and recreation, and accommodations and food sectors,\" it said.\nThe report expects both GDP and employment to rebound in 2021, by 5.4 and 2.9 per cent respectively.\n"}]