[{"author": "Pete Evans", "title": "Mortgage arrears rate could spike to double what it was in 2009, Bank of Canada says", "description": "Central bank says number of people falling behind on mortgages could almost quadruple", "url": "http://www.cbc.ca/news/business/bank-of-canada-thursday-1.5569391", "urlToImage": "https://i.cbc.ca/1.5552028.1588340177!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/canada-cenbank-governor.JPG", "publishedAt": ["May 14, 2020 10:33 AM ET", "2020-05-14T17:04:31.829Z"], "source": "CBC News", "content": "Emergency measures to deal with the economic impact of the COVID-19 pandemic are showing encouraging signs of working, but Canada's economy is still facing an uncertain future, the Bank of Canada says.\nLike other policymakers, Canada's central bank has spent the last two months making a flurry of policy decisions to ease the flow of credit, including slashing its target interest rate and embarking on an unprecedented bond-buying program.\nThe report suggests these measures have helped ease liquidity strains and provide easy access to short-term credit for companies and households.\n\"We entered this global health crisis with a strong economy and resilient financial system,\" outgoing governor Stephen Poloz said. \"This will support the recovery. But we know that debt levels are going to rise, so the right combination of economic policies will be important, too.\"\nOne of the issues on the bank's radar will be the number of people having trouble staying on top of their mortgages.\nThe bank said that if no new policies had been implemented in response to the unprecedented economic impact of COVID-19, the mortgage arrears rate may have risen to 2.1 per cent of all loans by the end of this year. That means more than one out of every 50 homeowners would be at least three months behind on their payments — almost 10 times the number that were before the COVID-19 crisis.\nAs it stands, because of some of the policies put in place, the bank says that under the current worst case scenario, the mortgage arrears rate will spike to about 0.8 per cent and remain on a much flatter curve that doesn't peak until next year, once payment deferral plans offered by the big banks at the outset of this crisis are set to expire.\nCurrently, the mortgage arrears rate is at slightly more than 0.2 per cent. If the rate peaks to 0.8 per cent, that would be roughly twice as high as its highest point during the financial crisis of 2009. \nThe bank did caution that those forecasts are assuming the worst case scenario for its stress-test modelling, and far more optimistic scenarios could play out.\n\"The unprecedented nature of the pandemic .. makes the uncertainty around the results exceptionally high,\" the bank said.\nWe already know about record-setting job losses during the pandemic, but the bank gave some new data regarding just how many people are finding it hard to make ends meet.\nBy its calculations, the bank says about one out of every five home-owning households in Canada doesn't currently have enough money to cover two months' worth of expenses, and almost one third don't have enough to cover four months' worth.\nEven despite the financial support programs, such as wage subsidies, implemented by the federal government, \"some households are likely to fall behind on their loan payments,\" the bank said. \"This typically appears first in missed credit card and auto loan payments and later in mortgage payments.\"\nWatch | Deputy governor Carolyn Wilkins on the outlook for Canada's housing market:\nThat's not just a problem for homeowners, either, Toronto-Dominion Bank economist Brian DePratto says.\n\"Renters are not immune, as they are more likely to work in industries most affected by COVID-19,\" he said. \"The longer the income shock, the greater the risk of increased consumer insolvencies.\n\"Broad-based income support measures can only last so long, making the gradual economic reopening crucial to the health of the Canadian economy's financial underpinnings.\"\n"}, {"author": "Pete Evans", "title": "Interest rates are plunging — so why aren't mortgage rates?", "description": "Bond yields and central bank rates have never been lower, but not all the savings are filtering down", "url": "http://www.cbc.ca/news/business/interest-rates-coronavirus-evans-1.5515884", "urlToImage": "https://i.cbc.ca/1.5516600.1585684340!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-applications.jpg", "publishedAt": ["Apr 04, 2020 4:00 AM ET", "2020-04-04T13:24:14.398Z"], "source": "CBC News", "content": "Central banks around the world have slashed their benchmark interest rates to pretty much zero in an attempt to stimulate the economy by making it as easy as possible to borrow, spend and invest.\nBut a curious thing is happening in Canada's mortgage market: rates aren't going down by as much as they probably should be. And in some cases, they're actually rising.\n\"Usually when the Bank of Canada cuts rates like they have, by 1.5 percentage points in a month, you can expect all rates to fall,\" said James Laird, president of mortgage brokerage CanWise Financial and co-founder of Ratehub.ca.\n\"At first they did ... but a week and a half ago, we started to see a shift [and] now we are seeing our lenders increase rates. Every two days, we get a different lender saying we are going up by point one, point two.\"\nMortgage rates tend to move up and down based on a number of factors, but one of the main ones is the costs borne by the lenders themselves.\nPeople tend to think that when someone walks into a bank to ask for a home loan, if they are approved, the bank just takes the cash out of some safe at the back, hands it over to the borrower and charges them interest over time to make a profit.\nBut, in fact, banks don't keep that much money just lying around either — they typically borrow it themselves and make money on the spread between how much they're charged for it and how much they turn around and charge the borrower for it.\nThe cost of financing a variable rate loan is strongly influenced by the Bank of Canada's benchmark rate, because banks tend to set their own prime lending rates based on whatever the central bank's rate is.\nThe bank has cut that rate by 150 basis points — 1.5 percentage points — in the past month to try to make it as easy and cheap as possible for people to borrow, spend and invest to stimulate the economy that has been waylaid by COVID-19.\nA few short weeks ago, it wasn't hard to find a variable rate mortgage for something around prime minus one — a full percentage point below whatever a bank's prime lending rate was at the time.\nBut a funny thing has happened since then. Prime lending rates have gone down more or less in lockstep with the Bank of Canada's moves, but those discount rates for mortgages have evaporated.\n\"About half of the savings have been passed along and half kept by banks for a higher margin,\" Laird said.\nThe reason they're doing that is the same as why stock markets plunged and governments rushed to implement lockdowns on millions of people: fear.\n\"Lenders are saying, 'Hold on a second,'\" Laird said. \"If a million people are going to lose their jobs and unemployment is going to rise, maybe we should build in a bit of a risk premium to our pricing to account for possible defaults for this new money we are lending.\"\nWhen the economic outlook was more clear, banks were happy to cut rates as low as possible to try to gobble up market share. But now, they're saying \"We better earn a bit more of a spread on this money because these things might default at a higher rate than we're used to,\" Laird said.\nThe impact isn't dramatic. Laird says a few weeks ago, the best mortgage rates were something in the range of between two and 2.5 per cent. Today, they're between 2.5 and three per cent because, as he puts it, \"they are demanding a higher risk premium than what they typically do.\"\nOthers aren't quite so diplomatic.\n\"It's total garbage,\" Marcus Tzaferis with mortage brokerage Cannect said. \"It's complete profit taking.\"\nWhile banks borrow at a rate slightly above that government rate, Tzaferis says \"the spread between their cost of borrowing and some of their five-year fixed mortgage rates is still around 250 points, which is highly profitable for them.\"\nFixed-rate loans aren't pegged to the Bank of Canada's rate and are instead more influenced by the bond market. And there, too, Tzaferis says what's happening in the market doesn't reflect what's happening behind the scenes.\nLenders finance fixed-rate loans on the bond market, where yields have fallen to record lows in the current COVID-19 crisis. The yield on a five-year government of Canada bond bottomed out at around 0.37 per cent this month and is currently hovering just over 0.5 per cent. \nThough banks must pay a credit spread on bond yield and that may be widening, Tzaferis says they are also widening their profit margins. Most fixed-rate mortgages are currently going for around three per cent, he points out.\nThe difference for borrowers adds up fast. Laird calculates that a theoretical buyer who put down a 10 per cent deposit on a house costing $500,000 before this crisis would likely have been able to get a mortgage rate of 2.6 per cent, which would make their payment $2,102 a month.\nIf all three rate cuts since then were to be fully factored into that loan, that borrower's monthly payment would fall as low as $1,769 a month — that's $333 per month or $3,996 per year on their mortgage payments, compared to what they were paying less than a month ago.\nThe overwhelming majority of first-time buyers opt for fixed-rate loans because they like the security of knowing that their monthly payment is guaranteed to not increase. The banks know this, Tzaferis says, and it could soon have a heavy cost for borrowers.\n\"They're using this as an opportunity to lock people into big fat juicy and profitable five-year mortgages,\" he said. \"When their rates drop those consumers are going to have massive penalties to break them ... tens of thousands of dollars.\"\n\"It's absolutely insanity,\" Tzaferis said. \"This is a totally manufactured crisis to profit.\"\nLaird and Tzferis both say that the current situation can't last forever. Economists are already predicting that the COVID-19 recession is likely to be incredibly sharp, but it's anyone's guess how long it will go on for.\nLaird says the best sign that things are getting back to normal will be when the big banks start to act in a way that seems paradoxical.\nBanks are raising their rates right now because they feel just as uncertain about the future as Canadians do. Once that cloud lifts, they'll want to start lowering rates again, and \"they won't build in that uncertainty premium like they are now,\" said Laird.\n\"As confidence returns, you'll see rates fall.\"\n"}, {"author": "Pete Evans", "title": "Why worries about the coronavirus are pushing mortgage rates down", "description": "Fear has pushed investors to buy up bonds, which is causing cheaper borrowing for home buyers", "url": "http://www.cbc.ca/news/business/coronavirus-mortgage-rates-canada-1.5443071", "urlToImage": "https://i.cbc.ca/1.5443215.1580239186!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/germany-dax.jpg", "publishedAt": ["Jan 29, 2020 4:00 AM ET", "2020-01-29T09:00:00.512Z"], "source": "CBC News", "content": "Economists are busy trying to calculate the potential economic toll of the coronavirus outbreak that's currently making its way around the world. But there's one marketplace that is already, quite unexpectedly, quantifying the full force of the bug: mortgages.\nRates for fixed- and variable-rate home loans are based on a variety of factors, but one of the biggest is the price that lenders have to pay to borrow money themselves.\nFor fixed-rate Canadian home loans, the benchmark that sets the price that consumer rates are based on is the five-year Government of Canada bond.\nInvestors who covet bonds like that one do so because they are perceived to be safe. Investors are willing to accept the relatively meagre returns that government debt offers because it's better than the alternative — losing money on whatever other, riskier investment they would have had to buy instead.\nCounterintuitively, the price of a bond and its yield move in opposite directions. So when appetite for bonds goes up, the amount they pay out goes down, because lenders don't have to offer quite as good a deal to find a buyer for their debt.\nThe price of bonds tends to increase when people are feeling fearful, a situation that certainly describes the state of affairs today amid a mysterious coronavirus emanating from mainland China that has killed more than 100 people and infected thousands more.\nThat fear is prompting investors to pour money into the safety of government bonds, and all that buying is pushing down the yield on that debt.\nAs recently as the start of the year, the yield on the five-year Canadian government bond was about 1.7 per cent. This week, it dipped as low as just above 1.3. In the staid world of bonds, a 40-point drop in a relatively short period is huge, and it's filtering down into the mortgage market.\nFixed-rate loans are highly influenced by bond yields, because a mortgage lender makes money on the spread between the bond rate and what they offer to consumers. If the five-year bond yield goes up, they can just pass that cost on to consumers. If it goes down, as it is now, the lender's cost of borrowing goes down, so they can turn around and lower their rates for consumers to drum up new business.\nThat's what seems to be happening.\nFixed-rate loans are falling, according to James Laird, CEO of mortgage broker Canwise Financial and co-founder of rate comparison website RateHub.ca. While specific rates will vary based on the borrower and what part of the country they're in, currently the best deal on offer for a five-year fixed loan is 2.64 per cent with a trust company and 2.74 per cent from a big bank. Barely a month ago, those rates would have been roughly 10 to 20 points higher.\nWhile bond yields have fallen by about 40 basis points in that period, that means lenders so far have only passed on about a quarter of those savings to consumers. But that is likely to soon change.\nLenders are always slower to pass on savings than they are to pass on added costs, Laird said, but they can only hold off for so long.\n\"If bond yields were up by 40 points, you can guarantee far more [lenders] would have changed rates and by a greater amount,\" Laird said. \"On the way down they're a little slower ... they enjoy thicker margins for a while.\"\nCoronavirus fears have really only sped up the process of a move toward lower rates that was already underway, he said.\nIn its policy decision last week, the Bank of Canada elected to keep its benchmark interest rate where it is for now. But by singling out concerns over the job market, international trade and other factors, it's clear the bank is leaning more toward rate cuts than hikes, Laird said.\nVariable-rate mortgages set their rates based on what the Bank of Canada is doing, not bond yields. And based on the central bank's last statement, traders think there's about an 80 per cent chance of at least one rate cut by the end of 2020. That means home buyers with variable-rate loans can expect some relief soon, too.\nThere's also some seasonality at play in all this. All things being equal, lenders like to hit the ground running on the busy spring home buying season, so Laird often sees rate cuts in mid-February or March, regardless of what bonds are up to. \nThe sudden impact of the coronavirus is just causing that to happen a little earlier and a little more dramatically than anticipated.\n\"It's not like rates were on the rise and the coronavirus caused them to do a U-turn,\" he said. \"I'd say this is another area which is putting downward pressure on bond yields, and therefore downward pressure on mortgage rates.\"\n"}, {"author": "Pete Evans", "title": "U.S. Fed chair rules out negative interest rates even as Trump trumpets them", "description": "U.S. president goes negative on Jerome Powell for rejection of below-zero interest rates", "url": "http://www.cbc.ca/news/business/powel-trump-negative-rates-1.5567512", "urlToImage": "https://i.cbc.ca/1.5258204.1566589338!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/869482910.jpg", "publishedAt": ["May 13, 2020 10:48 AM ET", "2020-05-13T15:17:41.088Z"], "source": "CBC News", "content": "The head of the Federal Reserve said Wednesday the U.S. central bank is not considering using negative interest rates, despite President Donald Trump seemingly pushing for them.\nIn a tweet Tuesday night, the president said other countries are enjoying the advantages of negative interest rates, and he urged his own central bank to accept the \"gift\" they would bestow on the U.S. economy.\nTypically central banks tinker with lending rates in an attempt to control inflation, raising rates when they want to cool down an overheated economy, and cutting them when they want to encourage borrowing and investment. But in recent years, central banks in Europe and Asia have gone as far as making their interest rates go below zero in an attempt to counter unprecedented economic situations.\n\"As long as other countries are receiving the benefits of Negative Rates, the USA should also accept the 'GIFT',\" Trump tweeted.\nAs long as other countries are receiving the benefits of Negative Rates, the USA should also accept the “GIFT”. Big numbers!\nThe president has long criticized his central bank chief for keeping interest rates higher than Trump would like them to be. That's largely because cheap lending rates tend to be good news for the stock market, which Trump is understood to view as a proxy for his own popularity and economic aptitude.\nCurrently, the U.S. Fed's benchmark interest rate is set at 0.25 per cent.\nSpeaking at a think-tank in Washington, D.C., on Wednesday morning, Powell addressed the economic impact of the coronavirus. He was asked by reporters afterward whether or not the bank was considering negative interest rates.\n\"I know there are fans of the policy, but for now it's not something that we're considering,\" Powell said. \"The committee's view on negative rates really has not changed …. This is not something that we're looking at.\"\nPowell's reluctance to go negative may be wise. While other countries have tried it, Karl Schamotta, chief market strategist of Cambridge Global Payments, says there is some academic research to suggest that negative rates could harm the U.S. economy by raising precautionary savings rates and reducing incentives to lend.\n\"As the euro area, Japan, Sweden and Switzerland have shown, there's no conclusive evidence to suggest that negative rates lift lending, growth or inflation,\" Schamotta said.\nWhile pouring cold water on the idea of negative rates, Powell didn't suggest the Fed planned to stay on the sidelines while the U.S. economy goes through what he described as an experience \"significantly worse\" than any recession seen since the Second World War.\nPowell cautioned that widespread bankruptcies among small businesses and extended unemployment for many people remain a serious risk.\n\"We ought to do what we can to avoid these outcomes,\" Powell said.\nBank of Montreal economist Michael Gregory said there's a lot that the Fed can still do besides negative savings rates.\n\"The Fed has more policy cards up its sleeve, and is more than willing to play them to promote economic recovery,\" he said. \"And it won't be taking these cards off the table for a while.\"\n"}, {"author": "Robson Fletcher", "title": "Mortgages in arrears in Alberta hit highest rate since 2013", "description": "Rate seen as a 'lagging indicator' of the economy, driven largely by unemployment", "url": "http://www.cbc.ca/news/canada/calgary/alberta-mortgages-arrears-august-report-from-february-2019-data-1.5246010", "urlToImage": "https://i.cbc.ca/1.3378660.1565735145!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/foreclosure-sales.jpg", "publishedAt": ["Aug 14, 2019 5:30 AM MT", "2019-08-14T11:30:00.450Z"], "source": "CBC News", "content": "More and more Albertans are falling behind on their mortgage payments, according to new numbers from the Canadian Bankers Association.\nThe rate of mortgages in arrears has been creeping upwards for the past 10 months on record and reached 0.49 per cent in February, according to the association's latest data.\nThat's the highest it's been since early 2013.\nMeanwhile, in the rest of Canada, the rate of mortgages in arrears has been going down, hitting 0.24 per cent nationwide at last count.\nFreida Richer, a licensed insolvency trustee with Grant Thornton in Edmonton, says the data matches what she's been seeing with her clients.\n\"Although we've been on this road of economic recovery now for almost two years, I can tell you that from my discussions with a lot of hardworking Albertans, there was a continued sentiment that their households are still struggling and they're simply not able to recover as quickly as they had thought or hoped,\" she said.\nShe said some of the primary reasons people fall behind on their mortgages are job loss, poor money management and family breakups.\nDivorces can be especially devastating during a downturn in real estate, she noted, as many Alberta markets have seen in recent years.\n\"If the person left with a property has to sell it, it's a matter of time,\" she said.\n\"Are they able to continue to pay the mortgage payments, in the meantime, while they try to sell the property? And what would they be selling the property for? Usually at a discounted value than what they had anticipated.\"\nThe Canadian Bankers Association considers a mortgage to be \"in arrears\" when payments are overdue for three or more months.\n\"The continued slowdown in Alberta's oil and gas sector and its associated impact on employment is one of the main drivers behind the uptick in arrears,\" the association said in an email.\nThe rate of mortgages in arrears is widely seen in economic terms as a \"lagging indicator,\" the association added, meaning it trails behind other indicators, particularly the rate of unemployment.\n\"Given that our latest stats are as of February 2019, that would mean it would be reflective of what was happening in the Albertan economy in the second half of 2018,\" the CBA said.\n\"Recall that in Alberta, the unemployment rate increased from 6.3 per cent in May 2018, to 7.2 per cent in October 2018, which explains the uptick in mortgages in arrears in the latter half of 2018.\"\nThe mortgage-arrears data includes residential loans from BMO, CIBC, HSBC Bank Canada, National Bank of Canada, RBC Royal Bank, Scotiabank, TD Canada Trust, Canadian Western Bank, Manulife Bank (as of April 2004) and Laurentian Bank (as of October 2010).\n"}, {"author": "Pete Evans", "title": "'Pretty cheap money': Canadian mortgage rates falling to their lowest level in 2 years", "description": "Fixed and variable loans have gotten cheaper because costs for lenders are down too", "url": "http://www.cbc.ca/news/business/canadian-mortgage-rates-analysis-1.5164774", "urlToImage": "https://i.cbc.ca/1.5165054.1559841646!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/open-house-housing-realtor-real-estate-sign.jpg", "publishedAt": ["Jun 07, 2019 4:00 AM ET", "2019-06-07T08:00:42.434Z"], "source": "CBC News", "content": "House prices may be as high as ever in many parts of the country, but Canadian homebuyers are being offered some of the lowest mortgage rates seen in years as lenders battle to drum up new business.\nRates on a standard five-year fixed-rate mortgage have fallen to their lowest level in two years, according to rate comparison website, Ratehub.ca. \nBorrowers just about everywhere across the country can take their pick of offerings well below three per cent at the moment, says James Laird, the site's co-founder and president of mortgage brokerage, CanWise Financial.\nThat's partly for seasonal reasons, he says, in that the spring months are typically the best ones for home buying, as families try to get moved and settled before summer vacations and then the new school year sets in.\n\"Promotions are April, May and June … when all mortgage companies try to make sure they are on track to hit their annual targets,\" Laird said in an interview. \"Anyone who's behind at this point would be aggressive with the margins they're willing to fund mortgages at right now.\"\nAt the moment, Laird says he's seeing five-year fixed rates as low as 2.64 per cent for certain buyers, and even higher-risk borrowers can easily find a loan for 2.89 per cent. That's the lowest range since the summer of 2017, he says, and a big reason why is the bond market.\nUnlike variable rate loans which take their cues from the Bank of Canada's benchmark rate, lenders finance fixed-rate loans based on the rates they can get in the bond market. Essentially, they'll borrow money themselves at one rate, loan it out to a borrower at a higher rate and make money on that spread.\nSo current rock-bottom interest rates on fixed loans are no coincidence, considering the yield on a five-year Government of Canada bond dipped below 1.3 per cent this month. If a lender can borrow funds for as little as 1.3 per cent then turn around and make money by loaning it out for twice that rate, they have every incentive to keep offering those deals.\n\"The hard cost of funding these loans is going down,\" Laird said. \"And at the same time we are at the tail end of the most competitive market, when lenders fight for [business], so that's when they are willing to thin out their margins a bit to attract volume.\"\nVariable rate loans are also sliding lower, too.\nMost borrowers prefer the peace of mind of fixed rate loans, but lenders can tempt borrowers to variable rate loans with even better rates — even if they're only temporary.\nLaird says typically it takes a spread of about a full percentage point to entice most people to make the leap. Which is why those loans are even less popular than usual because that premium has almost completely vanished.\nHe says the best variable rate loans are about 2.65 per cent at the moment, which is barely better than the fixed rate, for a lot more risk.\nAnyone signing up for that loan today is \"assuming the Bank of Canada is going to be forced to drop their rate once or twice. That would be the only way to justify taking it,\" he said. The bank's benchmark rate is 1.75 per cent. \nTrading in investments known as overnight index swaps suggests investors think there's about a 50 per cent chance of a rate cut by the central bank this year — but two would be very unlikely, and never mind any more beyond that.\nLower rates could be good news for those who've already bought, too.\nA recent report by National Bank found that a little more than one out of every six mortgages in Canada is up for renewal this year, and as recently as January the bank was calculating that most of them could expect to be paying between 70 and 90 more basis points on their next loan than they were on their current one. (A basis point is 1/100th of a percentage point, so a jump of 70 basis points would be a loan that went from 3 to 3.7 per cent, for example.)\nBut thanks to the steep slide in mortgage rates since the start of the year, most people with loans up for renewal now have no need to fear a big jump in their rate when the time comes.\n\"With the recent drop in mortgage rates, those households will be renewing at rates barely above their previous ones,\" National Bank economist Matthieu Arseneau said.\nLaird doesn't see anything on the immediate horizon that could derail the era of lower rates, but he does think the federal election in October is worth paying attention to for how it relates to housing.\nHousing policy is bound to come up on the campaign trail, and he expects to hear a lot of talk about changing stress test rules and extending amortization periods in the coming months.\nBut until that happens, Laird's expectations for the mortgage market can be summed up succinctly: \"Pretty cheap money.\"\n"}, {"author": "Bobby Hristova", "title": "Hamilton economy in 'extraordinary pain' but will see strong comeback next year: report", "description": "Hamilton has lost roughly 8,500 jobs during the pandemic but all of them will likely return in 2021", "url": "http://www.cbc.ca/news/canada/hamilton/hamilton-economy-coronavirus-1.5566804", "urlToImage": "https://i.cbc.ca/1.5516763.1585689847!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19.jpg", "publishedAt": ["May 13, 2020 4:02 AM ET", "2020-05-13T08:02:00.736Z"], "source": "CBC News", "content": "Hamilton has lost roughly 8,500 jobs as its economy goes through a period of \"extraordinary pain\" during COVID-19 according to a new report from the Conference Board of Canada.\nBut it predicts the city is poised to see a strong recovery.\nTodd Crawford, the Conference Board of Canada's associate director of economic forecasting, told CBC News said this pandemic has hit the economy harder than anything in the past few decades because both supply and demand were down with most businesses forced to close.\nThe city's unemployment rate jumped from 4.5 per cent in 2019 — a record low — to 7.4 per cent this year according to the data. That 7.4 percent is slightly higher than most other cities in Ontario and will account for almost 10 per cent of all jobs lost in the province. \nCrawford predicts unemployment will be at its worst right now, in the middle of the second quarter.\n\"Employment, we forecast, will contract by almost six per cent in the second quarter alone,\" he explained.\n\"It's really concentrated in this period of forced closures for businesses right now and it's really not a huge surprise things are declining.\"\nThe city said it was dealing with a pandemic-related $23-million budget shortfall in the middle of April.\nAlso not a surprise for Crawford, hotels and restaurants are being hit the hardest. He said the industry could contract by 40 per cent.\nThe report notes real estate and population growth have been stunted by COVID-19 as well.\n\"The pandemic and its resulting travel restrictions will slow Hamilton's recent strong growth in net in-migration, which hit 8,325 in 2019—the highest level since 1989. This year we expect 6,520 net new arrivals—a 21.7 per cent decline compared with last year. This will cut Hamilton's population growth to 8,094, down from 9,133 in 2019,\" reads the report.\n\"The local retail trade sector will contract in 2020, as a depressed economy, a weak labour market, and slower household disposable income growth force nervous consumers to tighten their purse strings. Retail sales are forecast to fall by 3.3 per cent, leading retail trade output to contract by 3.8 per cent. A rebound of 5.2 per cent is expected in 2021.\"\nHamilton's GDP is set to decline by 3.2 per cent this year but will jump by 6 per cent and kick off a steady and strong resurgence — as long as the pandemic continues to become less of a threat and there isn't another set of shutdowns.\n\"When economic activity contracts so swiftly, on the other side of it you will have a stronger rebound,\" Crawford said.\nHe added Hamilton was in a great economic position before the pandemic, which has softened the impact.\nThe city is also planning an economic recovery task force to deal with the aftermath of COVID-19.\nBy summer, if the virus hasn't rebounded, Crawford thinks people will begin spending more as businesses open up and restrictions fade away.\n\"If cities like Hamilton, which have seen very strong population growth, which do have a strong and vibrant housing market, which do benefit from high-paying jobs … can just get through this lockdown period and successfully navigate the re-opening hopefully we can all put this in our rearview mirror and start the recovery in mid-summer moving on into the fall.\"\n"}, {"author": null, "title": "Housing starts up in some parts of Canada despite COVID-19", "description": "Multi-unit housing projects remained strong in some provinces in April, CMHC says", "url": "http://www.cbc.ca/news/business/housing-starts-april-1.5561214", "urlToImage": "https://i.cbc.ca/1.5358323.1573674927!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/cranes-front-spadina.jpg", "publishedAt": ["May 08, 2020 2:17 PM ET", "2020-05-08T18:17:56.530Z"], "source": null, "content": "Canada Mortgage and Housing Corp. says construction of multi-unit housing projects remained strong in some provinces last month despite the fight against the COVID-19 pandemic.\nCMHC estimates a 10.8 per cent month-over-month increase in its national seasonally adjusted annual rate last month compared with March, excluding Quebec.\nThe federal agency says there was growth in multi-family starts in Ontario, Saskatchewan and Manitoba in April but Quebec was left out of the monthly national tally because the province's COVID-19 containment measures were in place until April 20.\nThe April seasonally adjusted annualized rate, excluding Quebec, was 166,415 units, up from 150,224 units in March.\nExcluding Quebec, multiple dwelling starts in urban areas of Canada were up 35.7 per cent from March, while urban single-family starts fell 27.1 per cent. Rural starts were estimated at 7,285 units.\nOntario accounted for the largest number of starts at 93,628, up 42 per cent. British Columbia had the second-largest seasonally adjusted rate, at 27,767, down 10 per cent from March. Alberta's starts were down 28 per cent from March, at a seasonally adjusted rate of 23,262 units.\n"}, {"author": "John Paul Tasker", "title": "Federal deficit likely to be higher than $252 billion, parliamentary budget officer says", "description": "PBO says it's possible federal debt will hit $1 trillion because of pandemic relief spending", "url": "http://www.cbc.ca/news/politics/federal-deficit-higher-than-252-billion-1.5566768", "urlToImage": "https://i.cbc.ca/1.5138746.1558027091!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/phoenix-pay-system.jpg", "publishedAt": ["May 12, 2020 5:34 PM ET", "2020-05-13T17:44:54.995Z"], "source": "CBC News", "content": "The parliamentary budget officer (PBO) says the federal deficit likely will exceed what he projected at the end of April as the federal government continues to spend billions of dollars on COVID-19 support programs with no clear end in sight.\nSpeaking before the Commons finance committee Tuesday, Yves Giroux said the $252 billion figure he cited only a few weeks ago is a low-ball estimate of just how much the programs will cost the federal treasury this fiscal year.\nHe said Finance Minister Bill Morneau should provide a fiscal update soon to give Canadians a better sense of how much Ottawa is spending on the pandemic.\nThe $252 billion figure was based on the data the PBO had as of April 24. Since then, said Giroux, new aid programs have been announced for commercial rent support, the agricultural sector, students and seniors — things he called \"very expensive measures.\"\n\"I think $252 billion is on the very optimistic side, as things stand now,\" Giroux said.\n\"In all likelihood the deficit will be higher than $252 billion. If I had to bet on that number, I'd say it's more likely to be worse than that than better than that.\"\nAs a result, the federal debt will rise to more than $900 billion — or roughly $24,000 for every man, woman and child in Canada.\nGiroux said it's \"not unthinkable\" that the federal debt could reach $1 trillion, and it's both \"possible and realistic\" that the debt could hit 13 figures by this time next year.\nIn fact, depending on how long the pandemic lasts, it's possible that pandemic programs could cost more than what the entire federal government spent last year on everything — which was roughly $337.8 billion for the 2018-19 fiscal year.\nWatch: Prime Minister Justin Trudeau's full press conference for Tue. May 12:\nMeanwhile, the debt-to-GDP ratio — a fiscal benchmark the Liberal government cites often to justify borrowing — is also likely to increase from the 48.4 per cent projected on April 30, Giroux said. Before the pandemic, the government projected a ratio closer to 30 per cent.\nWhile that figure is high, Giroux said it's still well below the 66 per cent debt-to-GDP ratio the country reached in the 1990s — when the Wall Street Journal branded Canada \"an honourary member of the Third World.\"\nThe cost of financing this massive increase in government spending, and the resulting debt, will be relatively low, Giroux said. He said interest rates have hit rock bottom — the Bank of Canada's benchmark interest rate is now at 0.25 per cent — and the cost of servicing the debt will be manageable.\n\"We anticipate that debt charges will not go up, which is surprising and counterintuitive,\" Giroux said. \"Interest rates are so much lower than what we anticipated them to be just two or three months ago. It doesn't cost that much to finance that growing debt.\n\"Is the government in a worrisome position right now? The answer is no.\"\nHe said the debt load could become \"unbearable\" in the event of a sizeable spike in interest rates and added the prospect of such an increase is \"concerning.\"\nThe Liberal members of the committee asked Giroux what the cost to Canadians would have been if the government hadn't stepped in to flow funds to Canadians through programs like the Canadian Emergency Response Benefit (CERB) and the wage subsidy.\nGiroux said that, without government support, Canadians would have suffered considerable economic pain because of the pandemic.\n\"We would have seen widespread — and I mean widespread — bankruptcies at the individual and corporate level,\" he said. \"There would be lots of defaults on mortgages, repossession of homes and cars, credit card debts that would go unserviced.\n\"The cost of doing nothing would be high.\"\n"}, {"author": "Mark Ting", "title": "Time to buy? What the pandemic means for Vancouver's real estate market", "description": "Mark Ting, On the Coast's finance columnist, on what lies ahead for buyers and sellers amid COVID-19", "url": "http://www.cbc.ca/news/canada/british-columbia/covid-19-may-real-estate-1.5562836", "urlToImage": "https://i.cbc.ca/1.5532588.1586915106!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19-vancouver.jpg", "publishedAt": ["May 10, 2020 7:00 AM PT", "2020-05-10T15:57:12.928Z"], "source": null, "content": "According to April's real estate numbers, sales activity and housing inventory in Greater Vancouver dropped 39 per cent and 34 per cent respectively.\nPrices remained flat as buyers balked at the thought of moving during a pandemic while sellers were hesitant to open their homes for viewings, resulting in significant declines in both supply and demand.\nOverall, the market appears to be balanced. Bidding wars are still occurring and it remains a sellers' market for condos under $700,000 and detached homes around $1.6 million, whereas the market for more expensive homes tends to favour buyers.  \nSo far, there hasn't been a lot of panic or forced selling, but I believe that could change in the fall.\nWhen trying to forecast where the market is heading, there are two variables that I will be closely monitoring — the post COVID-19 employment numbers and the expansion or introduction of new government programs created to combat the financial effects of the pandemic. \nA low unemployment rate does wonders for real estate valuations as it is an indicator that the economy is functioning well. Strong economies attract new investments, businesses, immigrants, temporary workers, international students, refugees — all of which increases demand for housing and results in higher rents and house prices. \nA weak economy does the opposite. People will not move here unless they think they can find a job, while recently laid off workers with few ties to Vancouver may leave. In other words, we see less demand and more supply.\nAccording to Moody's analytics, for every one per cent increase in unemployment, house prices typically drop about 4 per cent. Based on this ratio, if our unemployment rate were to double from pre-COVID-19 levels, home values would drop by roughly 20 per cent.\nThe main reason house prices are not currently dropping is due to government intervention. The various levels of government stepped in with a series of temporary programs to replace or subsidize the income of those affected by COVID-19. They also arranged for many of our expenses to be deferred — such as utility bills, taxes and mortgage payments. All these programs have bought struggling homeowners some time, and have taken the pressure off to sell their homes. \nBut what happens when the safety nets disappear? That is when the ill-prepared or vulnerable homeowners will be forced to sell.  Many of the government programs are expected to wind down in the summer and fall, and we may see a spike in new listings — a great time for buyers but terrible for sellers.\nIf I had plans to sell my home sometime in 2020 or early 2021, I would be listing my home sooner rather than later. While I'm not expecting a 20 per cent drop in value over the short term, it also wouldn't surprise me if it did happen. I also wouldn't be surprised if the government bailed out the housing market and valuations returned to all time highs. The B.C. government's tax base is heavily reliant on the construction and housing industries, so they can't afford to have housing valuations drop too low.   \nWhile I'm very cautious on real estate over the short term, I still think it's a solid long-term investment.\nMy advice to prospective buyers, if valuations drop by 15 to 30 per cent in 2020 or early 2021, consider leaving the sidelines as it could be the buying opportunity that many of you have been waiting for.\nIf you have a COVID-19-related story we should pursue that affects British Columbians, please email us at impact@cbc.ca\n"}, {"author": "Vianne Timmons", "title": "Put yourself in their shoes: Let's thank the women on the front line of the pandemic", "description": "Women are often in harm's way in this pandemic, says MUN president ", "url": "http://www.cbc.ca/news/canada/newfoundland-labrador/vianne-timmons-pov-women-1.5559214", "urlToImage": null, "publishedAt": ["May 09, 2020 9:00 AM NT", "2020-05-09T11:30:00.782Z"], "source": null, "content": "Chances are the last time you bought your groceries, you were checked out by a woman.\nWomen are the majority of cleaners, cashiers and food-service workers. Low-paying jobs, but they are on the front line of the COVID-19 pandemic, just like many working directly in the health-care system.\nAccording to Katherine Scott, senior researcher at the Canadian Centre for Policy Alternatives, we're not all in this together. This is not an equal opportunity pandemic.\nA United Nations policy brief notes that women's roles put them on the front line of the COVID pandemic. Seventy per cent of health and social service workers are women — nurses, medical laboratory technicians, respiratory therapists, personal support workers. They are on the front line.\nOn Wednesday, an excellent article in the Telegram focused on women's issues during this pandemic.\nA CBC story on April 30 included a photo of 17 women — staff at the COVID 19 unit at the Health Sciences Centre. It's a powerful image. At least one hadn't hugged her three-year-old son since April 1. For safety reasons, he's living with his grandparents.\nAs a mother of four, I can imagine how challenging that would be.\nThink again about the supermarket cashier — and put yourself in her shoes.\nAs has been noted many times in recent weeks, this is not a typical recession. Men are not losing their jobs at the same rate as women. Women are concentrated in sectors and industries hardest hit by isolation measures. According to Statistics Canada, between the ages of 25-54, the rate of decline for jobs held by women was more than twice that of men.\nThose women are home, sometimes taking care of children and doing a hundred other things women traditionally do, including tending to elderly relatives.\nSome might be locked at home with an abusive partner.\nAcross any sphere, from health to the economy, security to social protection, the impacts of COVID-19 are exacerbated for women and girls, simply by virtue of their gender, again from the UN policy brief.\nResearchers are taking the opportunity to learn from this.\nFor example, Dr. Alyson Byrne, assistant professor in the faculty of business administration at Memorial, studies work-family dynamics.\nShe and two co-authors at Queen's University are proposing to study how COVID-19 is impacting couples who now have to work at home together, and examining whether there are certain triggers, such as breadwinning status, that make it more or less difficult for couples.\nAt Memorial University, women wear many shoes: campus enforcement and patrol officers and custodial workers; administrative staff, managers and directors; undergraduate and graduate students; professors and researchers.\nThey are all doing their own balancing act.\nAre they heroes? It's not for me to say. The nurse who hadn't touched her son in more than a month says no.\nBut we can thank her and all the other women who put their shoes on every morning and go to work on the many front lines of this pandemic.\nRead more from CBC Newfoundland and Labrador \n"}, {"author": null, "title": "Canada lost nearly 2 million jobs in April amid COVID-19 crisis: Statistics Canada", "description": "Statistics Canada says unemployment rate soared to 13% as full force of pandemic hit", "url": "http://www.cbc.ca/news/business/canada-jobs-april-1.5561001", "urlToImage": "https://i.cbc.ca/1.5513497.1585362799!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19-closure-sign.jpg", "publishedAt": ["May 08, 2020 8:41 AM ET", "2020-05-08T18:56:41.771Z"], "source": "CBC News", "content": "Canada lost almost two million jobs during the month of April, a record high, as the impact of COVID-19 on the economy made itself known.\nStatistics Canada's Labour Force Survey data released Friday brings the total number of jobs lost during the crisis to more than three million.\nThe closure of non-essential services to slow the spread of COVID-19 has devastated the economy and forced businesses to shutter temporarily.\nStatistics Canada says the unemployment rate soared to 13 per cent as the full force of the pandemic hit, compared with 7.8 per cent in March.\nEconomists on average had expected the loss of four million jobs and an unemployment rate of 18 per cent, according to financial markets data firm Refinitiv.\nDouglas Porter, chief economist with BMO Economics, said those high projections could be tied to reports that more than seven million Canadians had applied for the Canada Emergency Response Benefit (CERB).\n\"The 5.2 percentage point rise in the jobless rate was considerably less than expected, and massively smaller than the 10.3 percentage point spike in the U.S. jobless rate,\" he said in an emailed statement.\nSince comparable data became available in 1976, the April unemployment rate was second-highest only to December 1982, when it reached 13.1 per cent.\n\"By most accounts, unemployment soared to over 25 per cent during the worst of the Great Depression, as high as 30 per cent by some measures,\" said Porter.\nThe rapid decline in employment is unprecedented, Statistics Canada says. The decline since February (-15.7 per cent) outpaces previous financial crises, including the 1981-1982 recession, which resulted in a drop of -5.4 per cent over 17 months. \n\"Today's job numbers start to complete the picture of just how devastating the COVID-19 crisis has been to the Canadian labour market,\" said economist Brendon Bernard of job site Indeed Canada in an email.\n\"While April's decline was a bit more modest than expected, that 6.4 per cent of all Canadian adults could lose employment in a single month is staggering.\"\nJob losses are not the only way the COVID-19 crisis has impacted employment. In addition to those who are now out of work, the number of people who were employed but worked less than half their usual hours because of the pandemic increased by 2.5 million from February to April.\nThat means the cumulative effect of the economic shutdown — people both no longer employed or working far less — was a staggering 5.5 million as of the week of April 12.\nAll provinces have been hard hit by the crisis. Employment dropped in all provinces for the second month running, with losses of more than 10 per cent everywhere.\nQuebec had the worst losses in April at -18.7 per cent, or 821,000 jobs.  \nHere are the jobless rates last month by province (numbers from the previous month in brackets):\nAs for Canada's three territories, due to logistical challenges, Statistics Canada's Labour Force Survey methodology is somewhat different there than in the rest of Canada, said Bernard.\n\"Employment rates in the territories haven't been hit as hard as the rest of Canada. That said, Nunavut saw a noticeable drop in the share of the population with a job in April, a sign of how public health concerns and economic uncertainty have extended beyond just the pandemic's hot spots.\"   \nThere is evidence to suggest, however, that many pandemic-related job losses are temporary.\nIn the month of April, almost all of the newly unemployed — 97 per cent — were on temporary layoff, indicating they expect to return to their previous places of work as the shutdown is relaxed.\nAt the same time, workplace participation declined to 3.7 percentage points, bringing Canada's participation rate to 59.8 per cent, as more than 1 million dropped out of the labour force, said Porter.\nAmong those still employed, the Labour Force Survey found that an additional 3.3 million workers were working from home in April.\nLosses continued to be more rapid in jobs with less security and poorer pay.\nOver the two-month period since February, overall employment (not adjusted for seasonality) declined 17.8 per cent.\nBut it was above average among employees with temporary jobs (-30.2 per cent) and those who had been in their jobs one year or less (-29.5 per cent).\nDeclines were sharper for employees earning less than two-thirds of the median hourly wage of $25.04 (-38.1 per cent) and those paid by the hour (-25.1 per cent).\nStatistics Canada said this is consistent with job declines observed in accommodation and food services, and wholesale and retail trade, which tend to be more precarious and lower paying.\nThe number of people age 15 and older living households where no one is employed increased 23.5 per cent — or more than 1.6 million — in the two months between February and April.\nAmong couples, the number where neither partner is employed increased by 22.5 per cent, or 845,000, while single parents who are not employed increased by 53.9 per cent, or 126,000.\nSmaller companies — defined as those with fewer than 20 employees — have shed 30.8 per cent of their workers, medium-sized firms have let 25.1 per cent of workers go, and large companies have seen employment decline by 12.6 per cent.\nHard-hit sectors at the outset include retail, hotels, restaurants and bars, which continued to see losses in April. The losses in the service sector also continued in April, down 1.4 million, or 9.6 per cent, Statistics Canada says.\nProportionally, the losses were greater in goods-producing sectors like construction and manufacturing, which combined lost 621,000 jobs for a drop of 15.8 per cent after being virtually unchanged in March.\nThe federal government announced Friday it will extend its emergency wage-subsidy to the end of June. The program — which covers 75 per cent of employees' pay, up to $847, to help employers keep their workers on the payroll for the duration of the COVID-19 crisis — was previously set to end June 6.\nAverage wages in April were up 10.8 per cent compared with a year ago. Economists say the increase is because a disproportionate share of job losses in low-paying positions has allowed the average wage to rise.\n\"At the same time, relatively more people remained employed in industries where work can be done from home, such as public administration and professional, scientific and technical services, two of the highest-paying industries,\" the report says.\n"}, {"author": "Nick Boisvert", "title": "Ontario has now lost more than 1 million jobs during the COVID-19 pandemic", "description": "Unemployment rate climbs to 11.3%, with a warning that many workers have simply left the job market", "url": "http://www.cbc.ca/news/canada/toronto/ontario-covid19-april-jobs-1.5562034", "urlToImage": "https://i.cbc.ca/1.5562076.1588967088!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19-construction-workers.jpg", "publishedAt": ["May 08, 2020 4:20 PM ET", "2020-05-08T20:44:35.575Z"], "source": "CBC News", "content": "Approximately one out of every seven Ontarians who were working before the coronavirus pandemic hit the province have now lost their jobs, according to Statistics Canada's latest national labour survey.\nThe figures released on Friday show the province lost 689,200 jobs during the month of April.\nThat means Ontario has now shed 1,092,000 jobs since February, the last month before restrictive measures to slow the spread of the novel coronavirus battered Canada's economy.\nOntario's unemployment rate also climbed to 11.3 per cent compared to 5.5 per cent in February, though Statistics Canada warns the current unemployment rate understates the true scope of the crisis, since many people are no longer actively looking for work.\nStatistics Canada says the April report is the first of its monthly labour surveys to properly capture the shock caused by the virus.\nNationally, the economy lost nearly two million jobs last month for a total of more than three million since February. A further 2.5 million people are employed but working fewer than half their usual hours since February.\nCanada's national unemployment rate sits at 13 per cent.\n\"The magnitude of the decline in employment since February far exceeds declines observed in previous labour market downturns,\" said the agency in its report, pointing to the 1981-82 recession in which Canada lost 612,000 jobs over nearly a year and a half.\nOntario declared a state of emergency on March 17 and followed by ordering the closure of all non-essential businesses on March 23.\nThe chart below shows the sectors hardest-hit since the arrival of the novel coronavirus. It includes industries such as manufacturing that have been deemed essential by the provincial government.\nOntario's construction industry, which shed only 4,900 jobs in March, took a particularly heavy blow and lost 93,800 jobs in April.\nThe provincial manufacturing sector also shrank by 100,900 jobs after losing 31,600 in March.\n\"It's widespread to the whole economy now,\" said Jean-Paul Lam, an associate professor of economics at the University of Waterloo.\nLam said the scale and speed of the job losses is unmatched in Canadian history. He likened government interventions to combat the virus to putting the economy in a temporary induced coma, for which there is not yet a detailed recovery plan or schedule.\nRecovering from the shock, he added, will likely require the development of an effective vaccine against COVID-19.\n\"We're going to operate maybe at 70, 80 per cent economy for a while,\" Lam said.\n"}, {"author": "Robson Fletcher", "title": "Another quarter-million Albertans lost work in April as COVID-19 shutdown grips province", "description": "Employment rate for young women cut nearly in half as pandemic hits service sector especially hard", "url": "http://www.cbc.ca/news/canada/calgary/alberta-april-labour-force-survey-covid-19-economic-shutdown-1.5561446", "urlToImage": "https://i.cbc.ca/1.5504403.1588957683!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-cda-20200318.jpg", "publishedAt": ["May 08, 2020 11:14 AM MT", "2020-05-08T22:29:19.747Z"], "source": "CBC News", "content": "Nearly a quarter-million more Albertans lost work in April as the economic shutdown due to COVID-19 continued, with young workers — particularly young women — being disproportionately affected.\n\"That's, by far, the hardest hit group,\" said University of Calgary economist Trevor Tombe.\n\"If we look at the sectors that are affected by social distancing, it's the kind of sectors where there's usually close physical proximity — so retail, restaurants, accommodation. These are also sectors where there's a lot of employment of part-time workers, and young workers, in particular.\"\nThere were 1.969 million Albertans working in mid-April, according to new estimates released Friday from Statistics Canada. That's down 244,000 from mid-March, when social-distancing measures had only just begun.\nCombined with the roughly 117,000 people who lost work in March, the province has now seen a decline in employment equal to about 10 per cent of its total, working-age population — in the span of two months.\nThat's by far the largest and fastest decline the province has seen since Statistics Canada's modern employment records began in 1976.\nThe new numbers further reveal the extent of the economic shutdown across Canada, as well.\nNationally, there were nearly two million fewer Canadians working in April, compared with March. That's on top of the roughly one million people who lost work in March, compared to February.\nThe global pandemic has had a more pronounced effect on some types of employment, particularly service-industry workers, who tend to be younger.\nOver the past two months, the employment rate — that is, the percentage of people working — among Albertans under the age of 25 has fallen by nearly 20 percentage points.\nYoung women in the province saw their employment rate nearly cut in half, falling from 55.9 per cent in February to just 30.3 per cent in April.\nThis trend was evident in March, as many service-industry employers were among the first to shut down in the wake of COVID-19.\nHope Sheridan, 25, worked as a recruiter with GoodLife Fitness in Calgary until the gym closed down in mid-March and she was laid off on a temporary basis.\nShe said her employer hopes to reopen as soon as possible but it's still not clear exactly when they will be allowed to resume operations and, as a young mother, the uncertainty has been difficult.\n\"It's been extremely stressful,\" she said.\n\"There are no answers on whether we're coming back anytime soon.\"\nAnd while younger female workers were hit hard again in April, Tombe said the effects of the pandemic expanded to other, more male-dominated sectors, as well.\n\"What we saw in April is, as the economic contraction proceeded, losses in the construction sector and in manufacturing really closed that gender gap quite a bit,\" he said.\nThe overall unemployment rate in Alberta jumped 4.7 percentage points from March, rising to 13.4 per cent in April.\nBut Tombe says that figure masks the extent of the job losses, given how many people are not looking for work amid the deliberate shutdown of the economy, and are not included in that count.\nWhen looking at the total \"potential\" labour force, he said, 32 per cent of Albertans who could be working are not.\nAnother unusual aspect to this economic shutdown is the number of people who are still employed but working fewer hours.\n\"There are a large number of individuals who didn't actually lose their job but have basically lost all of their hours worked,\" Tombe said.\nAbout 330,000 people in Alberta recorded zero hours worked in April, he said.\nOverall, the number of hours worked in province was down 24.8 per cent compared with February.\nThe number of hours worked was down even more sharply in other provinces, particularly Quebec.\nTombe noted Alberta was already in an economic slump, even before the pandemic arrived.\n\"In Alberta's case, the downturn due to the virus is following many months of disappointing economic performance and, indeed, employment losses even prior to February,\" he said.\n\"We were potentially entering a second recession even before the virus hit in Alberta, so it's a particularly challenging time for this province.\"\nThe province's employment numbers were the subject of an exchange between Alberta NDP Leader Rachel Notley and Premier Jason Kenney in a rare Friday question period at the Alberta legislature.\nNotley called on Kenney to extend provincial measures like eviction protections and utility bill deferrals beyond the end of June.\nKenney said his government has already provided $15 billion in relief for Alberta workers and businesses, including emergency isolation payments and a break on WCB premiums. He didn't rule out the possibility of more provincial relief.\n\"We don't know exactly what the next months hold in store for us,\" Kenney said. \"We'll have to assess what more we do as events unfold.\"\nNotley accused Kenney of not doing enough to help unemployed Albertans who will be facing economic fallout from the pandemic for months.\nShe also questioned the accuracy of Kenney's claim the province has spent $15 billion on COVID-related relief programs.\n\"Always doing the bare minimum, putting working people last and waiting for Ottawa to step in,\" Notley told reporters afterwards.\n\"While other governments are offering real relief for people, Albertans are getting deferrals and more debt.\"\n"}, {"author": null, "title": "U.S. economy lost 20.5 million jobs in April", "description": "Unemployment rate surged to 14.7 per cent last month", "url": "http://www.cbc.ca/news/business/united-states-coronavirus-jobs-unemployment-april-1.5561026", "urlToImage": "https://i.cbc.ca/1.5561028.1588968602!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/economy-jobs-report.jpg", "publishedAt": ["May 08, 2020 9:25 AM ET", "2020-05-08T15:21:44.502Z"], "source": null, "content": "The U.S. economy lost a staggering 20.5 million jobs in April, the steepest plunge in payrolls since the Great Depression and the starkest sign yet of how the coronavirus pandemic is battering the world's biggest economy.\nThe Department of Labour's closely watched monthly employment report on Friday also showed the unemployment rate surging to 14.7 per cent last month, shattering the post-Second World War record of 10.8 per cent touched in November 1982.\nThe bleak numbers strengthen analysts' expectations of a slow recovery from the recession caused by the pandemic, adding to a pile of dismal data on consumer spending, business investment, trade, productivity and the housing market.\nThe report underscores the devastation unleashed by lockdowns imposed by states and local governments in mid-March to slow the spread of COVID-19, the respiratory illness caused by the virus.\nA White House official predicted Friday that the unemployment rate for May will be even worse. White House economic advisor Kevin Hassett told CNN he expected the jobless rate will move up to 20 per cent this month, adding the economy should transition to stronger footing in the summer.\n\"I think we're going to enter a transition period this summer before we have sort of another re-ignition of the economy.\"\nThe economic crisis spells trouble for President Donald Trump's bid for a second term in the White House in November's election. After the Trump administration was criticized for its initial reaction to the pandemic, Trump has been eager to reopen the economy, despite a continued rise in COVID-19 infections and dire projections of deaths.\n\"Those jobs will all be back, and they'll be back very soon,\" Trump said on Fox News following the release of the employment report.\n\"Our economy is on life support now,\" said Erica Groshen, a former commissioner of the Labour Department's Bureau of Labour Statistics.\n\"We will be testing the waters in the next few months to see if it can emerge safely from our policy-induced coma,\" said Groshen, who is now a senior extension faculty member at the Cornell University School of Industrial and Labor Relations.\nEconomists polled by Reuters had forecast non-farm payrolls diving by 22 million. Data for March was revised to show 870,000 jobs lost instead of 701,000 as previously reported. A record streak of job growth dating to October 2010 ended in March. Unemployment was forecast to rise to 16 per cent from 4.4 per cent in March.\nThough millions of Americans continue to file claims for unemployment benefits, April could mark the trough in job losses. More small businesses are accessing their portion of an almost $3-trillion US fiscal package, which made provisions for them to get loans that could be partially forgiven if they were used for employee salaries.\nThe Federal Reserve has also thrown businesses credit lifelines, and many states are also partially reopening.\nCompanies like Walmart and Amazon are hiring workers to meet huge demand in online shopping. Truck drivers are also in demand, while supermarkets, pharmacies and courier companies need workers. Still, economists do not expected a quick rebound in the labour market.\n\"Given the expected shift in consumer behaviour reflecting insecurities regarding health, wealth, income and employment, many of these firms will not reopen or, if they do reopen, [they will] hire fewer people,\" said Steve Blitz, chief economist at TS Lombard in New York. \"This is one reason why we see the underlying recession extending through the third quarter.\"\nEconomists say the U.S. economy entered recession in late March, when nearly the whole country went into COVID-19 lockdowns.\n"}, {"author": null, "title": "U.S. Federal Reserve leaves rates near zero as COVID-19 savages U.S. economy", "description": "Economists forecast sharpest downturn in U.S. history this quarter", "url": "http://www.cbc.ca/news/business/fed-renew-pledge-1.5548953", "urlToImage": "https://i.cbc.ca/1.5549076.1588173017!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/usa-economy.JPG", "publishedAt": ["Apr 29, 2020 12:00 PM ET", "2020-04-29T21:16:53.765Z"], "source": null, "content": "The U.S. Federal Reserve, which has pumped trillions in emergency funding into U.S. financial markets to stem the damage from the coronavirus pandemic, left interest rates near zero and repeated a vow to do what it takes to shore up the economy. \nThe central bank says the pandemic will \"weigh heavily\" on the near-term outlook and poses \"considerable risks\" for the medium term.\n\"The Federal Reserve is committed to using its full range of tools to support the U.S. economy in this challenging time, thereby promoting its maximum employment and price stability goals,\" the Fed said in a statement following a two-day policy meeting held via video conference.\nEarlier Wednesday, the Commerce Department reported the economy contracted in the first quarter at its sharpest pace since the Great Recession, ending the longest economic expansion in the nation's history.\nThat reflects a plunge in economic activity in the last two weeks of March, which saw millions of Americans seeking unemployment benefits.\nThe rapid decline in GDP has left economists bracing for a record slump in output in the second quarter.\n\"If the economy fell this hard in the first quarter, with less than a month of pandemic lockdown for most states, don't ask how far it will crater in the second quarter, because it is going to be a complete disaster,\" said Chris Rupkey, chief economist at Mitsubishi UFJ Financial Group in New York.\nPlunging consumer spending on the back of widespread stay-at-home orders to curb the spread of the virus helped drive a 4.8 per cent decline on an annualized basis in first-quarter gross domestic product. The economy, which grew at a 2.1 per cent rate in the fourth quarter, was in its 11th year of expansion, the longest on record.\nAn increasing number of U.S. states are reopening their economies or at least setting out plans for easing stay-at-home restrictions, leading to fears there could be a resurgence of infections over the coming months and a headache for the Fed as it seeks to estimate the swiftness of the economic recovery.\nWith so much uncertainty around the economic outlook, the Federal Reserve said it expects to maintain the target range for its benchmark overnight lending rate \"until it is confident that the economy has weathered recent events.\"\nThe statement reflects a sharp downgrade in the Fed's assessment of the job market, household spending, energy markets and the outlook for inflation since its last meeting in March, before most U.S. states had done much to curtail economic activity and put the brakes on the exploding outbreak.\nLast month, the Fed said only that it will keep rates near zero \"until it is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals.\"\nIt slashed rates to near-zero in March and rolled out a mix of new and refurbished crisis programs aimed at shoring up credit markets and backstopping companies and local governments reeling from forced shutdowns and sharp drops in revenue.\nFed Chair Jerome Powell held a news briefing following the meeting, and warned the economy will decline at an \"unprecedented rate\" in the current quarter.\nBut Powell also said the economy will pick up as lockdown restrictions are lifted and vowed the central bank would continue to support the recovery.\n\"[The Fed has] really put themselves in the forefront of trying to lead this recovery back,\" said Rick Meckler, partner at Cherry Lane Investments in New Vernon, N.J. \"They have been aggressive and probably are a big reason for some of the strength the market has shown even in light of some really negative economic news.\"\nThe market did rally on Wednesday. U.S. stocks surged following drugmaker Gilead Sciences' announcement that its drug remdesivir is showing promise as a potential COVID-19 treatment, giving a boost to the broader market and sending its shares up 5.7 per cent.\nThe Dow and S&P 500 are both within 20 per cent of their record levels, with the tech-heavy Nasdaq now within 10 per cent of its high.\nMeanwhile, the depth of the economic slowdown is starting to become clear, with more than 26 million people filing new claims for unemployment benefits since March 21. But the Fed and other analysts are still trying to get a handle on the likely shape of the recovery.\nMost U.S. states still have stay-at-home measures, though a handful are beginning to reopen even as cases of COVID-19, the respiratory illness that has killed more than 57,000 people in the United States, continue to grow.\nMany health experts have also begun to predict a seasonal resurgence of COVID-19 in the fall, whatever containment measures are put in place, raising the possibility that stay-at-home restrictions may need to be reintroduced, and with them, a new downturn in economic growth.\n"}, {"author": "Pete Evans", "title": "CMHC to take more mortgages off banks' books to free up cash for loans amid COVID-19 crisis", "description": "Government had similar program in place during 2009 financial crisis", "url": "http://www.cbc.ca/news/business/cmhc-mortgage-program-1.5510802", "urlToImage": "https://i.cbc.ca/1.3668539.1467903263!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/mortgage-rates-sign.jpg", "publishedAt": ["Mar 26, 2020 11:46 AM ET", "2020-03-26T16:31:10.768Z"], "source": "CBC News", "content": "The Canada Mortgage and Housing Corporation is expanding the number of insured mortgages it is willing to buy from banks to give the banks more freedom to lend out more money to consumers and businesses and keep the economy humming.\nThe taxpayer-funded agency, which backstops the vast majority of Canada's housing market by insuring the loans that finance them, announced earlier this month it was willing to take up to $50 billion worth of loans off of banks' books.\nOn Thursday, the CMHC announced it would expand that mortgage-buying program to $150 billion.\n\"This action will expand the stable funding available to banks and mortgage lenders in order to ensure continued lending to Canadian consumers and businesses,\" the agency said in a statement.\nMoving loans from banks to the CMHC helps the banks' books and allows them to free up cash that they can lend out to consumers and businesses while the COVID-19 pandemic is hitting them hard and threatening the overall economy.\nCanada's big banks have promised interest rate relief for up to six months to Canadian borrowers struggling to make their payments, but the CBC has reported that the fine print of those programs make it so that the deferred interest must be paid back at some point, which makes the loan longer and more expensive.\nCanada's big banks are being flooded by requests for payment relief by borrowers — to the tune of 213,000 requests so far, Bloomberg reported Thursday.\nThe head of the CMHC, Evan Siddall, is asking mortgage holders to not overload the system in order to make sure any relief goes to those who need it most.\nPlease leave rent/mortgage relief to those who need it most. Banks and mortgage lenders are struggling to keep up. And if you have a paycheque and can afford it, please pay your bills. This isn’t a amnesty/freebie for all. <a href=\"https://t.co/CHmYWxqAZL\">https://t.co/CHmYWxqAZL</a>\nIn terms of the agency's mortgage-buying program, CMHC says all of the pools of mortgages that would be transferred are already insured by the government anyway, so there's no additional risk to taxpayers from the transaction.\nOttawa implemented a similar program during the financial crisis. At that time, the CMHC ended up taking over about $69 billion worth of mortgages, about half the amount they were willing to take on.\n"}, {"author": "Philip Lee-Shanok", "title": "Condo vacancies rise, rents fall as pandemic crushes GTA's short-term rental market", "description": "A surge in listings, fewer renters means more competition for landlords", "url": "http://www.cbc.ca/news/canada/toronto/will-more-listings-fewer-renters-mean-drop-in-rent-for-condos-1.5551464", "urlToImage": "https://i.cbc.ca/1.5551494.1588283875!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-rent.jpg", "publishedAt": ["Apr 30, 2020 7:28 PM ET", "2020-05-01T02:16:09.631Z"], "source": "CBC News", "content": "The GTA's condo rental market has dramatically reversed directions in the course of a single month with a surge in listings since the pandemic hit, real estate watchers say.\nAnd they believe a big drop in Airbnb rentals may be playing a role in this trend.\n\"We're seeing renters pull out of the market,\" said John Pasalis, president of Realosophy Realty Inc. And he says while prospective renters are getting scarce, there has been a spike in the numbers of units for rent.\n\"Especially condominiums, which are high-priced rentals ... over $2,000 a month for a one bedroom,\" Pasalis told CBC Toronto.\n\"So those people are kind of pulling back given the economic uncertainty and the impact on their incomes. And on the flip side, we're seeing landlords — who need to pay the mortgages and property taxes — scramble to put their units on the market.\"\nPasalis says there's been a 25 per cent increase in listings and he thinks that former Airbnb hosts are scrambling to lease out their units. \nHe says investors who bought multiple units to list as short-term vacation rentals are now pivoting to leasing longer term after the Airbnb market collapsed due to the COVID-19 pandemic.\nAnd he says a surge in listings has pushed the condo rental inventory from one-and-a-half months of inventory (MOI) at the end of March to nearly 4 MOI at the end of April.\nAll that new competition for renters has meant a 3.5 per cent drop in average rents for the month of April. Pasalis says he doesn't expect things to return to normal quickly and that may mean a soft rental market for some time.\n\"If immigration starts to decline, which typically happens during a recession, this is also going to weigh on rental demand in the short term,\" he said.\n\"We might see some condo investors take their chips off the table and sell their units.\"\nJaco Joubert has studied the effects of Airbnb on condo rental vacancies. He photographed 15 downtown condo towers at night over the course of a year to monitor when the lights were on to determine whether or not they were occupied.\nAt that time, he calculated that 5.6 per cent were vacant. He thinks that may have more than doubled in some buildings to as high as 13 per cent.\nAnd he says he's noticed rents have declined by a few hundred dollars.\n\"There are some rentals that are listing for quite a bit lower than it would have maybe a year ago,\" said Joubert, adding that price expectations are likely moving lower.\nFor example, he says he found a studio condominium listed in the downtown area that probably would have gone for around $2,000. It's now listed as low as $1,850 a month.\nCouncillor calls on city to mull vacancy tax after man does own study of empty condos\n\"People are getting more desperate to get somebody[to rent their units]. There's quite a few listings in the city overall, and not a lot of people want to move right now.\"\nBut the Advocacy Centre for Tenants Ontario (ACTO) says it may be premature to say whether the rental market is expected to slow down in the post-COVID-19 period.\nAnd the Canada Mortgage and Housing Corporation, which calculates vacancy rates across the country, has not yet released a report.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1722983491858", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "David Cochrane", "title": "Deficit reduction will have to wait for the economic recovery, federal officials say", "description": "Federal aid programs could continue well into the recovery phase, says government official", "url": "http://www.cbc.ca/news/politics/covid-pandemic-coronavirus-deficit-debt-1.5561513", "urlToImage": "https://i.cbc.ca/1.5561869.1588962494!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-consumer-motivations-20200507.jpg", "publishedAt": ["May 09, 2020 4:00 AM ET", "2020-05-09T08:00:00.610Z"], "source": "CBC News", "content": "As the fallout from COVID-19 adds hundreds of billions of dollars to the national debt, senior federal officials say there will be no aggressive attempts at deficit reduction until Canada's economic recovery is well underway.\nInstead, the immediate aim will be to keep using the government's balance sheet to extend federal aid programs and eventually ramp up stimulus spending, instead of trying to quickly reduce the deficit.\n\"I think [deficit reduction] really can't happen until you know the full extent of the damage and until you get a measurement of what this did to us,\" said a senior federal official speaking on background.\n\"If you want to make this as painless as possible for people, you wouldn't rush it.\"\nThe federal deficit is ballooning due to the combination of multi-billion dollar aid programs and an economic slump that dwarfs any other recession in modern history.\nParliamentary Budget Officer [PBO] Yves Giroux forecast the deficit for this year will amount to at least $250 billion — essentially more than a decade of the Trudeau government's annual deficits in a single year.\nAs troubling as those numbers are, there are others that worry the government more.\nThe most recent data from Statistics Canada show that three million Canadians lost their jobs during the first stage of the pandemic. Millions more have lost most of their work hours. In total, 5.5 million people have either lost their jobs or have been working far less since the week of April 12.\n\"These numbers tell us what we already knew – that right now, Canadians are hurting because of this pandemic,\" Prime Minister Justin Trudeau said Friday. \nThe hurt likely goes even deeper than those numbers suggest.\nAlready, 7.7 million Canadians are getting cheques through the Canadian Emergency Response Benefit, while 1.7 million workers have qualified for the federal emergency wage subsidy.  More than 45 per cent of the labour force is now receiving some sort of federal government support.\nWatch: The pandemic and essential workers\nEven as some provinces inch toward reopening their economies, there are few signs of rapid economic improvement. The PBO's office projects the economy could shrink by as much as 30 per cent in the second quarter.\nIn a recent article for Policy Magazine, former parliamentary budget officer Kevin Page said the staggering economic data left the government with two clear choices: run up the debt to help households and businesses and increase the odds of recovery and longer-term growth — or offer less help, minimize debt growth and diminish the chances of recovery.\n\"All countries will wake up after the global pandemic with much higher debt levels. Canada is fortunate because we are starting at a much lower net debt-to-GDP level,\" Page wrote. \"If low interest rates are maintained, there is no good policy case for rushing to austerity — either spending cuts or tax increases. The economic recovery will likely be much too weak and fragile for austerity.\"\nFederal bureaucrats are in the middle of a review of pandemic-related aid programs, primarily to see if they need to be tweaked or extended. What could emerge from that process is what the senior official described as a \"glide-and-launch phase,\" where some direct aid programs slowly wind down while economic stimulus programs are launched.\nTrudeau revealed one of the first steps of that review on Friday when he announced that the wage subsidy program would continue beyond June to help kick-start the reopening of provincial economies and allow people to move from the CERB to paid work.\n\"We need an economy to come back to and direct support is a key part of that,\" said a finance official speaking on background. \"Everything is going to be largely dependent on where we are and what the needs are.\"\nBut even as the federal government prepares for the next phase of its pandemic response, it's still busy trying to deal with the first wave of challenges. The already-extended wage subsidy is still in the getting-money-out-the-door phase. There's also the unfulfilled promise of direct financial help for seniors to address. And hard-hit sectors such as airlines, energy and hospitality will need some kind of sector-specific bailouts.\n\"The big business bailout is the hardest one to do out of all of them,\" said the senior federal official. \"How do you bridge people to a better time and what do you get in return for that?\"\nPart of the government's concern here is the risk of being seen bailing out companies that use tax havens or engage in tax avoidance. There's a desire at the federal level to make sure that any bailout includes a degree of public oversight and can support the argument that it was done in the public's interest.\n\"We will, over the coming days, start looking at specific sectoral supports,\" Trudeau said Friday. \"But even then, our focus will be on the workers … and not on the corporate well-being of an industry or sector.\"\nAnd while airlines have been promised some sort of help, public transit companies are also knocking on Ottawa's door. The Trudeau government is a big booster of mass public transit and a big spender when it comes to capital investment to boost transit capacity.\nBut transit operations are largely a municipal responsibility. Ottawa is trying to find a way to help that sector without becoming a long-term player in transit policy.\nAs this crisis continues, jurisdictional lines are blurring. Many municipal and provincial governments were in precarious financial situations going into the pandemic and will be even more vulnerable as they emerge from it. The Bank of Canada already has launched a multi-billion dollar program to buy provincial government bonds because provinces like Newfoundland and Labrador have had trouble borrowing on the open market.\nAll of this will require Ottawa's attention when the dust settles — and billions of dollars more in federal spending may be required. Senior Liberals are already conceding they may need to go slower and be less aggressive on their campaign commitments, because the virus has presented them with an urgent new set of priorities.\n\"We are not yet talking about stimulus,\" Trudeau said. \"We are still very much in the support and emergency phase right now.\"\nBut the costs will keep growing. We still have no clear idea of how much this will cost the country. And the government's view is that it's still too early to talk about paying the bill.\n"}, {"author": "David Cochrane, Vassy Kapelos", "title": "Tiff Macklem to lead the Bank of Canada", "description": "Stephen Poloz’s term as governor ends in June", "url": "http://www.cbc.ca/news/politics/bank-of-canada-tiff-macklem-1.5551828", "urlToImage": "https://i.cbc.ca/1.5552086.1588341998!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/boc-governor-20200501.jpg", "publishedAt": ["May 01, 2020 12:09 AM ET", "2020-05-01T15:08:34.449Z"], "source": "CBC News", "content": "Finance Minister Bill Morneau has appointed Tiff Macklem, the former senior deputy governor of the Bank of Canada, to take over the top job at the central bank as it navigates the uncertainty of a pandemic-driven recession.\nMacklem is currently the dean of the Rotman School of Management in Toronto, but had spent decades with the Bank of Canada before starting that appointment. \nMacklem began his career at the bank in 1984. He was widely expected to win the contest for bank governor in 2013, but was beaten out by Stephen Poloz, who was then CEO of Export Development Canada.\nPoloz's term ends June 2. \nThe transition to new leadership comes as millions of Canadians have signed up for government aid and companies big and small are relying on federally backed wage subsidies to weather the COVID-19 pandemic.\nDuring Friday's announcement, Morneau said he's confident Macklem's expertise in financial markets will help the central bank navigate an economic crisis never before seen in Canada.\nBank of Canada holds rate steady at 0.25% and hints it has no plans to go any lower\nStephen Poloz to step down as Bank of Canada governor at end of term\n\"The bank has to be humble about what it doesn't know. There's a lot we don't know about this disease. There's a lot that medical experts don't know about this disease,\" Macklem said during his unveiling in Ottawa.\n\"But the Bank of Canada has tremendous analytic economic financial capacity to analyze what's going on in the economy, and the important role for the Bank of Canada is to provide Canadians with as much information as it can honestly provide as to what is happening and what the recovery could look like, recognizing that we're probably going to have to look at more than one scenario.\"\nIn the past months, Poloz and Morneau have appeared at several joint news conferences to show a co-ordinated approach on monetary and fiscal policy to deal with the economic fallout of the pandemic and global oil shocks.\nMorneau has announced more than $250 billion in direct financial aid, credit support and tax deferrals to help offset the impact of the COVID-19 pandemic.\nPoloz has cut interest rates to a record low of 0.25 per cent, committed the central bank to buying billions in government bonds each week until the economy is in recovery and taken steps to strengthen liquidity in the banking sector.\nThe person who replaces Poloz will be facing an economy that, according to the bank's own projections, could shrink by 30 per cent or more in the second quarter.\nThe next government will have practically no room to use interest rate cuts to help the economy. Poloz has already taken the unprecedented step — in Canada at least — of directly buying government bonds.\nThat limited flexibility is compounded by the rapid use of the federal government's fiscal firepower to put a financial floor under Canadian households and businesses.\nThe parliamentary budget officer said it's likely the federal deficit for the year will hit $252 billion as a result of the COVID-19 pandemic, and could go even higher if emergency measures remain in place longer than planned.\nIn selecting Macklem, the government passed over Poloz's top deputy, Carolyn Wilkins, the first woman to serve as the bank's senior deputy governor. She would have been the first woman to serve as governor.\nWilkins was viewed by many as the front-runner for the position and would have provided some continuity at the country's central bank as it navigates the uncertainty of a pandemic-driven recession.\nWATCH | Morneau announces Tiff Macklem as governor of the Bank of Canada:\n"}, {"author": null, "title": "Canada's big banks cut credit card interest rates to ease coronavirus impact", "description": "Big Six will temporarily reduce credit card interest rates amid COVID-19 pandemic", "url": "http://www.cbc.ca/news/big-six-banks-credit-card-interest-rates-relief-covid-19-1.5522343", "urlToImage": "https://i.cbc.ca/1.5253932.1570659856!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/transunion-debt-report-20190820.jpg", "publishedAt": ["Apr 04, 2020 6:55 PM ET", "2020-04-04T22:55:15.561Z"], "source": null, "content": "Canada's Big Six banks all said they will reduce interest rates on credit cards to provide relief to customers affected by COVID-19 pandemic.\nBank of Montreal said on Saturday it will temporarily reduce credit card interest rates to 10.99 per cent for personal and small business customers receiving payment deferrals due to the outbreak. Bank of Nova Scotia announced the same change on Friday.\nThey joined Toronto-Dominion Bank, Royal Bank of Canada, National Bank of Canada and Canadian Imperial Bank of Commerce, who announced similar measures.\nTD Bank said it will cut credit card interest rates by 50 per cent for customers experiencing hardship, and Royal Bank said it will reduce the charges by the same extent for clients receiving minimum payment deferrals.\nNational Bank will reduce annual interest rates to 10.9 per cent for clients receiving three-month payment deferrals, it said.\nCIBC too will lower interest rates to 10.99 per cent on personal credit cards for users who request to skip a payment, the lender said.\nMost of the banks' credit cards charge interest between 19.99 per cent and 20.99 per cent on purchases.\nWatch: How to handle cash during the pandemic\nLast week, Prime Minister Justin Trudeau said his government had urged banks to help alleviate the burden credit card interest rates place on Canadians. This week's moves are the latest in a raft of relief measures offered by the banks to customers affected by the pandemic.\nThe banks unveiled a mortgage-relief plan two weeks ago to allow homeowners to defer or skip mortgage payments for up to six months.\nNational Bank said on Friday it will refund additional interest accrued on the deferred mortgage payments. The lender will also waive fees for transfers and stop payments on checks and pre-authorized debts, and will not charge overdraft fees on checking and high-interest savings accounts, it said.\nBMO said about 70,000 clients have taken advantage of its relief measures, and TD said the same number had applied for and been approved for mortgage payment deferrals.\nSince the mortgage-relief plan was announced, the banks have received nearly half a million requests that have been completed or were being processed.\n"}, {"author": null, "title": "Canada's big banks cut credit card interest rates to ease coronavirus impact", "description": "Big Six will temporarily reduce credit card interest rates amid COVID-19 pandemic", "url": "http://www.cbc.ca/news/business/big-six-banks-credit-card-interest-rates-relief-covid-19-1.5522343", "urlToImage": "https://i.cbc.ca/1.5253932.1570659856!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/transunion-debt-report-20190820.jpg", "publishedAt": ["Apr 04, 2020 6:55 PM ET", "2020-04-04T22:55:15.561Z"], "source": null, "content": "Canada's Big Six banks all said they will reduce interest rates on credit cards to provide relief to customers affected by COVID-19 pandemic.\nBank of Montreal said on Saturday it will temporarily reduce credit card interest rates to 10.99 per cent for personal and small business customers receiving payment deferrals due to the outbreak. Bank of Nova Scotia announced the same change on Friday.\nThey joined Toronto-Dominion Bank, Royal Bank of Canada, National Bank of Canada and Canadian Imperial Bank of Commerce, who announced similar measures.\nTD Bank said it will cut credit card interest rates by 50 per cent for customers experiencing hardship, and Royal Bank said it will reduce the charges by the same extent for clients receiving minimum payment deferrals.\nNational Bank will reduce annual interest rates to 10.9 per cent for clients receiving three-month payment deferrals, it said.\nCIBC too will lower interest rates to 10.99 per cent on personal credit cards for users who request to skip a payment, the lender said.\nMost of the banks' credit cards charge interest between 19.99 per cent and 20.99 per cent on purchases.\nWatch: How to handle cash during the pandemic\nLast week, Prime Minister Justin Trudeau said his government had urged banks to help alleviate the burden credit card interest rates place on Canadians. This week's moves are the latest in a raft of relief measures offered by the banks to customers affected by the pandemic.\nThe banks unveiled a mortgage-relief plan two weeks ago to allow homeowners to defer or skip mortgage payments for up to six months.\nNational Bank said on Friday it will refund additional interest accrued on the deferred mortgage payments. The lender will also waive fees for transfers and stop payments on checks and pre-authorized debts, and will not charge overdraft fees on checking and high-interest savings accounts, it said.\nBMO said about 70,000 clients have taken advantage of its relief measures, and TD said the same number had applied for and been approved for mortgage payment deferrals.\nSince the mortgage-relief plan was announced, the banks have received nearly half a million requests that have been completed or were being processed.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/montreal/programs/daybreak/bank-of-canada-s-interest-rate-cut-1.5488331", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Why high interest rates were a problem for '80s renters, too", "description": "They didn't have mortgages, but their landlords did", "url": "http://www.cbc.ca/archives/why-high-interest-rates-were-a-problem-for-80s-renters-too-1.5501499", "urlToImage": null, "publishedAt": ["Apr 03, 2020 8:30 AM ET", "2020-04-03T12:30:00.428Z"], "source": "CBC Archives", "content": "It didn't matter if you owned a home or not -- high interest rates were a pain for everybody.\nForty years ago, The National was looking at why those higher interest rates were costing those who rented apartments more money.\n\"Like everything else, apartment rents keep going up and nowhere has that been more true than in Alberta,\" the CBC's Don Newman explained to viewers on April 3, 1980, back when he was reporting from the westernmost Prairie province.\n\"People moving from other parts of Canada to take advantage of the booming economy have kept the demand for apartments high -- and now spiralling mortgage interest rates are putting even more pressure on rents.\"\nSeveral factors were at play in Alberta at that time.\nOne was that an existing set of rent controls was coming to an end, which meant many tenants were scrambling for affordable digs.\n\"I think the times have gone by where you looked for something luxurious. It's just whatever you can afford,\" said Mary Harasim of Edmonton's Landlord and Tenant Advisory Board, whose name was misspelled on screen on The National.\n\"It's rather sad,\" she added.\nAnother co-existing factor was that the rising interest rates were becoming tough for homeowners, who were going to end up having to sell their homes and move to apartments themselves.\nNewman said \"real estate people\" believed interest rates were likely to rise further.\nWithin a few short years, the apartment market would completely change in Alberta, with renters having lots of choice after a punishing recession left many apartment units vacant in that province.\n"}, {"author": null, "title": "Quebec lost 264,000 jobs to COVID-19 crisis last month", "description": "Quebec's unemployment rate rose to 8.1 per cent last month", "url": "http://www.cbc.ca/news/canada/montreal/quebec-job-numbers-unemployment-covid-19-1.5527589", "urlToImage": "https://i.cbc.ca/1.5502523.1584613186!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/closed-sign-coronavirus-covid-19.jpg", "publishedAt": ["Apr 09, 2020 10:50 AM ET", "2020-04-09T21:35:14.957Z"], "source": "CBC News", "content": "Quebec lost an estimated 264,000 jobs last month, shooting the province's unemployment rate up above eight per cent, according to Statistics Canada.\nThe agency's monthly labour force report, released Thursday, said the closest comparison to the sudden decline in economic activity and employment caused by COVID-19 was the 1998 ice storm, which affected Quebec and Ontario.\nIn all last month, Canada lost more than one million jobs. Economists had been expecting the figure to come in at around 500,000 jobs lost, which already would have been the worst month for job losses on record.\n\"The increase in absences the week of March 15 to 21 was more than eight times greater than that observed in 1998,\" the report said.\nQuebec's unemployment rate rose 3.6 per cent to 8.1 per cent, the largest increase in the country, followed by British Columbia, where the rate increased 2.2 per cent to 7.2 per cent, and Ontario, where it went up by 2.1 per cent to 7.6 per cent. \nQuebec also had the sharpest decline in employment in education, with 73,000 jobs lost. In Ontario, 25,000 jobs were lost.\nOn March 12, Quebec banned large gatherings. The next day, the province declared a public health emergency and announced closed schools, universities and daycares would close.\nBy midnight March 24, all non-essential businesses in the province were closed.\nThe COVID-19 crisis has led to the most sudden and severe impact in the labour market of all Statistics Canada's records, which date back to 1976, said statistician Andrew Fields. \n\"Typically, when we look at recessions in the past, they occur over many months or years even,\" Fields said. \"The 2009 recession didn't just occur in one month. The unemployment rate picked up over the course of two years.\"\nThe accommodation and food services industry saw the largest declines overall, which Fields says is not surprising because \"those were the earliest businesses to close.\"\nDavid Lefebvre of Restaurants Canada, a national service industry association, agrees that it's not a surprise.\nAccording to the association, about 10 per cent of restaurants in Quebec are already saying they won't be able to get back on their feet after the COVID-19 crisis — and Lefebvre says more are expected to join them. \n\"We think lots of jobs will come back, but not every job will come back,\" Lefebvre said.\n\"To have jobs, you need strong businesses, and we want as many to be able to weather the storm and be able to relaunch the economy and of course the food service sector in due time.\"\nSebastien Viau of L'Alliance de l'industrie touristique du Québec, a Quebec tourism association, says the timing couldn't be worse for a crisis to hit.\n\"It's just before the summer season where all the festivals are happening,\" Viau said.\nHowever, he's hopeful the industry will be able to bounce back.\n\"Tourism has always been part of the economy bouncing back. It could drive the economy more regionally, more locally,\" Viau said.\nThe association is already planning a relaunching strategy for when measures ease up. \n"}, {"author": null, "title": "Changes to mortgage stress test rules good news for young home buyers, says P.E.I. broker", "description": "Broker says wiggle room will make a difference for people carrying extra debt", "url": "http://www.cbc.ca/news/canada/prince-edward-island/pei-mortgage-changes-trainor-1.5472793", "urlToImage": "https://i.cbc.ca/1.4868923.1539890950!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/housing-study-20180808.jpg", "publishedAt": ["Feb 23, 2020 10:41 AM AT", "2020-02-23T14:44:08.641Z"], "source": "CBC News", "content": "A P.E.I. mortgage broker says changes to Canada's stress test rules should open up the housing market to more young people. \nThe stress test was brought in two years ago to ensure potential home buyers would still be able to make their payments if their mortgage rate increased. \nTo qualify for a mortgage loan, buyers have to be able to afford payments at a rate two per cent higher than the Bank of Canada's average five-year-rate, which comes to about 5.19 per cent. \nBut starting April 6, lenders will instead use the average industry rate in that calculation.\nThat rate is currently more than a half a percentage point lower than the banks. So on a $200,000 mortgage, buyers would need to afford a payment of about $1,128 a month instead of $1,184.\nBroker Paul Trainor says that wiggle room will make a difference.  \n\"It will make it easier for people, especially younger people, to afford their first home,\" he said.\n\"Any person with a student loan debt, which seems to be the big problem with the stress test, they'll be the major beneficiaries because they've got that extra debt that, as we get older, we don't have the student loan debt. But that first-time home buyer has that. And when you make it harder, obviously they can't get into their first home.\"\nTrainor said under the arrangement, buyers will be able to qualify for more expensive homes as well. \nThe downside for buyers, he said, is that could cause home prices to increase. \"You're going to have more price increases because of that demand.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1707557955587", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1706560067565", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/ottawa/programs/allinaday/money-column-interest-rate-cut-1.5486004", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Pete Evans", "title": "Bank of Canada holds rate steady at 0.25% and hints it has no plans to go any lower", "description": "Bank expects economic activity to slow by as much as 30% from end of 2019", "url": "http://www.cbc.ca/news/business/bank-of-canada-rate-decision-1.5532829", "urlToImage": "https://i.cbc.ca/1.5521269.1585945243!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/health-coronavirus-canada-cenbank.jpg", "publishedAt": ["Apr 15, 2020 10:18 AM ET", "2020-04-15T17:31:02.906Z"], "source": "CBC News", "content": "After cutting it three times in barely a month, the Bank of Canada kept its benchmark interest rate steady at 0.25 per cent on Wednesday, despite an economic outlook that's looking more and more like one of the bleakest ones we've ever seen.\nThe central bank said in a release that it considers the current level of its rate to be its \"effective lower bound.\" That means the bank doesn't have any plans to cut the rate to zero or into negative territory, despite the uncertainty of the COVID-19 pandemic that has devastated Canada's economy.\nThe bank says it expects widespread lockdowns, layoffs and other drastic measures will have a dramatic impact on Canada's economy in the months ahead. The bank says it thinks economic activity in the period between April and June will be between 15 and 30 per cent lower than it was at the end of 2019.\n\"Despite a high level of uncertainty, these estimates suggest that the near-term downturn will be the sharpest on record,\" the bank said.\nWhile the bank is signalling it doesn't see a scenario where it would put its rate into negative territory, the bank says it is doing a lot of other things beyond interest-rate reductions to help support the economy.\nChief among them are various lending operations to financial institutions and asset purchases in core funding markets that the bank says have already amounted to $200 billion worth of support.\nThe bank expanded those measures on Wednesday by announcing it will soon start buying up even more bonds and other debts to help keep the economy running.\n\"The situation calls for special actions by the central bank,\" the bank said. \"To this end, the bank is furthering its efforts with several important steps.\"\nThe Bank of Canada announced last month that it would buy $5 billion worth of federal government debt every week in order to support the economy. On Wednesday, it said it would keep doing that but also buy up to $50 billion worth of provincial debt and up to $10 billion worth of corporate debt in order to ensure there is enough of what central bankers refer to as \"liquidity\"— a complicated term that boils down to the simple notion of making sure there is enough cash in the system to allow normal transactions to happen.\nBy buying up bonds from governments and companies and taking it off their books, the central bank is freeing up cash that those entities can then use to put to work in the real economy.\n\"This helps ensure that households and businesses continue to have access to the credit they need to bridge this difficult time, and that lower interest rates find their way to ultimate borrowers,\" the bank said.\nStrategist Andrew Kelvin with TD Bank thinks the move to extend liquidity help to provinces and corporations is a significant development.\n\"I don't think there was a problem in the provincial market or the corporate bond market, but the Bank of Canada just saw an opportunity to add more stimulus,\" he said. \"It's just another way of them injecting stimulus into the market.\"\nCentral banks cut their rates when they want to encourage borrowing to stimulate the economy. They raise them when they want to cool down inflation. The Bank of Canada's rate filters down into the economy by impacting rates on things like mortgages and savings accounts at banks. \nThe bank noting that its rate is as low as it can realistically go is a direct message to consumers, says James Laird, co-founder of Ratehub.ca and president of CanWise Financial mortgage brokerage.\n\"Consumers should not expect their rate to go any lower since the bank has reiterated that they are at their lower bound. The position of the bank is to leave the rate unchanged until the economic situation stabilizes.\"\nTD Bank economist Brian DePratto agrees that the bank is saying it can't plausibly cut its interest rate any more than it already has. But that doesn't mean it's going to sit on the sidelines doing nothing as the economy goes through the biggest downturn in decades.\n\"Further rate cuts may be off the table, but the bank clearly stands ready to scale up [bond] purchases as needed,\" he said.\nAlicia MacDonald with the Conference Board of Canada thought the bank's signaling that it would not put its rate down to negative territory was the right move to make. \"As interest rates approach zero, further rate cuts have a less stimulative impact...when weighing the small stimulative benefit against the feasible large cost to the financial sector, there is not a strong case for further cuts to the overnight rate at this point,\" she said.\n"}]