[{"author": null, "title": "Scientists spot biggest supernova ever detected", "description": "SN2016aps exploded after the merger of two giant stars about 4.6 billion light years from Earth", "url": "http://www.cbc.ca/news/technology/biggest-supernova-1.5532702", "urlToImage": "https://i.cbc.ca/1.5532706.1586954449!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/space-exploration-supernova.JPG", "publishedAt": ["Apr 15, 2020 7:37 AM ET", "2020-04-16T02:39:37.178Z"], "source": null, "content": "Scientists have observed the biggest supernova — stellar explosion — ever detected, the violent death of a huge star up to 100 times more massive than our sun in a faraway galaxy.\nThe supernova, releasing twice as much energy as any other stellar explosion observed to date, occurred about 4.6 billion light years from Earth in a relatively small galaxy, scientists said. A light year is the distance light travels in a year — 9.5 trillion kilometres.\nIt might represent, they said, a type of supernova that until now has only been theorized.\nAstrophysicist Matt Nicholl of the University of Birmingham in England said two very massive stars — each about 50 times the sun's mass — may have merged to make one extremely massive star roughly 1,000 years before the explosion. They had been part of what is called a binary system with two stars gravitationally bound to each other.\nThe merged star exploded in a supernova, formally named SN2016aps, inside a very dense and hydrogen-rich envelope.\n\"We found that the supernova was able to become so bright because of a powerful collision between the debris ejected by the explosion and a shell of gas shaken off by the star a few years earlier,\" said Nicholl, lead author of the study published this week in the journal Nature Astronomy.\nStars die in various different ways depending on their size and other properties. When a massive star — more than eight times the mass of our sun — uses up its fuel, it cools off and its core collapses, triggering shock waves that cause its outer layer to explode so violently that it can outshine entire galaxies.\nThe researchers, who observed the explosion for two years until it diminished to one per cent of its maximum brightness, said it may have been an example of an extremely rare \"pulsational pair-instability\" supernova.\n\"Pulsational pair-instability is when very massive stars undergo pulsations, which eject material away from the star,\" said study co-author Peter Blanchard, a postdoctoral fellow in astrophysics at Northwestern University in Illinois.\n\"This discovery shows that there are many exciting and new phenomena left to be uncovered in the universe.\"\nVery massive stars like this one were probably more common early in the universe's history, according to Nicholl.\n\"The nature of those first stars is one of the big questions in astronomy,\" he said. \"In astronomy, seeing things further away means looking back further and further in time. So we might actually be able to see the very first stars if they explode in a similar manner to this one. Now we know what to look for.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1726127171570", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "The 'super' in this supernova means the biggest and brightest one we've ever seen", "description": "Scientists observed SN2016aps in a galaxy 4.6 billion light-years from Earth", "url": "http://www.cbc.ca/radio/quirks/apr-18-age-sex-and-covid-19-vulnerability-learning-from-pterosaur-flight-and-more-1.5534498/the-super-in-this-supernova-means-the-biggest-and-brightest-one-we-ve-ever-seen-1.5534500", "urlToImage": "https://i.cbc.ca/1.5536606.1587154318!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/artist-s-impression-of-a-supernova.jpg", "publishedAt": ["Apr 17, 2020 5:12 PM ET", "2020-04-17T21:12:54.292Z"], "source": "CBC Radio", "content": "A very rare supernova at least twice as bright and energetic as any other seen before has been identified in a galaxy 4.6 billion light-years from Earth.\nOver a period of two years, Peter Blanchard, a postdoctoral researcher at Northwestern University's Center For Interdisciplinary Exploration and Research in Astrophysics (CIERA), and an international group of colleagues, were able to observe what became extremely rare supernova.  It turned out to be the first observation of a type whose existence had only been theorized. \nIt is an example of an extremely rare \"pulsational pair-instability\" supernova, according to the team's study published in Nature Astronomy. This means that the stellar explosion, or supernova, was amplified as it merged with a shell of hydrogen gas that surrounded the star.\nThis gas had been \"burped\" away from the massive star prior to the explosion, said Blanchard.\nThe explosion caught up with that layer of gas which made the resulting supernova both more energetic and brighter than any other seen before, according to Blanchard.\nThis supernova is also the result of the explosion of a much bigger star than any previously observed. Blanchard and his colleagues calculated the star's size to be between 50 to 100 solar masses. Typically supernovae are between eight and 15 solar masses. \nThe astronomers are not quite sure what became of the core of this star after it exploded. The outcome depends on how much material remained at the core of the star after the explosion.  Below a critical mass, it would have collapsed into a neutron star, but if a little more material remained there might have been enough mass to form a new black hole.\n"}, {"author": "Nicole Mortillaro", "title": "Hopes for supernova are dimming as Betelgeuse brightens", "description": "Star had dimmed to unprecedented levels, fascinating astronomers", "url": "http://www.cbc.ca/news/technology/betelgeuse-brightening-1.5476647", "urlToImage": "https://i.cbc.ca/1.5464555.1581719071!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/betelgeuse-december-2019.jpg", "publishedAt": ["Feb 27, 2020 4:00 AM ET", "2020-02-27T09:00:00.247Z"], "source": "CBC News", "content": "It appears that the hopes of people who wanted a nearby star to explode have been dashed. \nAfter weeks of unprecedented dimming, Betelgeuse — a star in the constellation Orion — is beginning to brighten again.\nBoth professional and amateur astronomers had been keeping a close eye on the unusual dimming of the red supergiant star, as its brightness decreased to the lowest in recorded observational history. Some had hoped that its fading was indicative of an impending explosion, a supernova.\nAm I the only one who is moderately disappointed that Betelgeuse isn't going supernova this year (or this millennium)?<a href=\"https://t.co/RFpNlUSbaz\">https://t.co/RFpNlUSbaz</a> <a href=\"https://t.co/cwnRGV8JRj\">pic.twitter.com/cwnRGV8JRj</a>\nBut the fact that Betelgeuse is brightening is exactly what professional astronomers were expecting.\nBetelgeuse is a fascinating star to astronomers. The red supergiant is 14,000 times more luminous than our sun and roughly 1,400 times larger. It is surrounded by dust and gas that, if it were at the centre of our solar system, it would stretch all the way to Neptune.\nIt is also a semi-regular variable, meaning that its brightness waxes and wanes in cycles. \nWhen red supergiants die, they do so in a spectacular fashion, exploding as a supernova. And while Betelgeuse is at the end of its lifespan, astronomers believe that it still has roughly 100,000 years or more to go. But because these types of stars aren't completely understood, they can't be certain.\nAnd that's where the hope lay with Betelgeuse's dimming.\nBut astronomers had hypothesized that two of its three cycles — one that is roughly 430 years, one that is roughly six years and one that is roughly between 100 to 180 days — had converged, leading to its extreme dimming. And they believed that somewhere at the end of February, it would begin to recover.\nSo Betelgeuse's brightening is right on schedule, which supports their hypothesis. However, they're still waiting for more data.\n\"At this point we're still very cautious about screaming, 'Oh, we were right! We know what's happening!'\" said Stella Kafka, chief executive officer of the American Association of Variable Star Observers, an organization that monitors variable stars. \"But the data shows us Betelgeuse's brightness is increasing.\"\nContinuing our <a href=\"https://twitter.com/hashtag/Betelgeuse?src=hash&amp;ref_src=twsrc%5Etfw\">#Betelgeuse</a> saga: 5-day means from the <a href=\"https://twitter.com/AAVSO?ref_src=twsrc%5Etfw\">@AAVSO</a> database. Are we recovering? <a href=\"https://t.co/1vm3OKBWJa\">pic.twitter.com/1vm3OKBWJa</a>\nThough it appears that Betelgeuse won't go supernova, it's provided a wealth of information on a class of stars that aren't well understood. And that, in and of itself, is exciting, Kafka said. \nAs well, the strangeness of Betelgeuse has been widely reported, and it's resulted in non-astronomers looking at the night sky, something that Kafka thinks is remarkable.\n\"It's really exciting that we're all in this together. It's one of those things that the whole community, the whole world is looking at Betelgeuse trying to figure out what's going on,\" she said. \"We're learning from it.\"\nAnother important takeaway from the recent activity on Betelgeuse is that it serves as a reminder that the sky isn't as static as we may think; that it can change even in our lifetimes, Kafka said. And studying something relatively nearby that is evolving sheds some light on how our solar system and life on our planet may have begun.\n\"That's why astronomy is so interesting to everybody. It satisfies this fundamental question … where do we belong?\"\n \n \n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1530534979761", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/the-benefits-of-video-games-composting-corpses-brewing-ancient-beer-right-whales-in-the-wrong-place-and-supernovas-and-bipedalism-1.5157911", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/kidsnews/post/hubble-space-telescope-celebrity-birthdays-Drake-Lizzo-Mendes-Eilish/", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1726118979946", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1699819075873", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Astronomers find closest black hole to Earth", "description": "Massive object is part of a triple system just 1,000 light-years away", "url": "http://www.cbc.ca/news/technology/closest-black-hole-1.5560156", "urlToImage": "https://i.cbc.ca/1.5560213.1588893327!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/hr-6819-black-hole.jpg", "publishedAt": ["May 08, 2020 4:00 AM ET", "2020-05-08T14:11:11.145Z"], "source": "CBC News", "content": "There's a black hole lurking nearby, apparently, but you can breathe easy: It's not a threat to Earth. \nAstronomers believe they have found the closest black hole to our solar system, just 1,000 light years away, which in astronomical terms is right in our neighbourhood.\nThe black hole — which is roughly four times the mass of our sun — is joined by two stars, making it a triple system, called HR 6819. The stars are visible with the naked eye in the southern hemisphere, in the constellation Telescopium.\nAstronomers at the European Southern Observatory (ESO) in La Silla, Chile, found that one star orbited an unseen object every 40 days. The second, which lies farthest from the invisible object, hasn't been observed moving at all (it's likely on a slower orbit).\nBoth stars appeared to wobble, indicating that there was something nearby. But whatever it was, it couldn't be seen with the observatory's MPG/ESO 2.2-metre telescope.\nThe observations were made with a spectrograph, where light is broken down into its individual colours. This allows astronomers to measure their motion, and in this case, the stars appeared to wobble, indicating that there was something nearby. But whatever it was, it couldn't be seen.\nThough it's estimated our galaxy could contain hundreds of millions of black holes, only a couple dozen have been found, and that's why this potential discovery is so important.\n\"Black holes aren't rare; they're just very hard to find,\" said Thomas Rivinius, an astronomer at the ESO and a corresponding author of the study, published Wednesday in the journal Astronomy and Astrophysics on the discovery.\nMost black holes, those considered \"active,\" have been detected by their interaction with matter, such as stars that wander too close. Just before the stellar matter falls into the black hole, never to escape, it releases powerful X-rays, allowing astronomers to \"see\" them. \nBut \"inactive\" black holes are invisible. However, if there is a star close — but not too close — astronomers can detect it by the wobble of the star.\nAstronomers are hoping to find others in this manner.\n\"The fact that it's so close by, means that there must be more of these out there, way more, because if there's only one in the Milky Way, it would be a little bit too convenient if it's right next door to us,\" said Marianne Heida, an astronomer with ESO in Garching bei München, Germany, also a corresponding author of the study.\nBlack holes form when a massive star dies and collapses into itself, which first causes a supernova, a spectacular stellar explosion. It's believed that these types of explosions seeded the universe with most of the elements we know. So they're an important piece of the puzzle when it comes to understanding how most matter — including ourselves — have come to be.\n\"Black holes are cool,\" Heida said. \"And these massive stars are the stars that produced basically all the elements that we are made of.\"\nPriya Natarajan, an astronomer and professor at Yale University who was not involved in the study, said the findings are extremely helpful in better understanding how astronomers might be able to find these invisible galactic phenomena.\n\"It makes a huge difference for our understanding of what matters, like what the constituents of our galaxy are,\" she said. \nThe black hole was discovered by accident.\nIn 2004, astronomers were looking for a particular type of binary star system. HR 6819 was a candidate — except there was something a little off about it. It seemed there was a third, unseen, object. \nAfter the leader of this investigation, Stan Stefl, died in a car accident in 2014, the work fell by the wayside.\nHowever, last November, a separate study suggested the existence of an unusually massive black hole, roughly 70 times the mass of our sun. The finding was controversial, as astronomers believe the upper limit for a stellar-mass black hole (as opposed to supermassive black holes which lie at the centre of most galaxies) should max out somewhere around 30 times the mass of the sun.\nThat study took Rivinius back to HR 6819. He thought that perhaps it, too, was home to a stellar-mass black hole.\nFollow-up observations suggested that was likely the case. \n\"The cool thing about this system is that it's so close by, that we can hopefully do what's called optical interferometry, so then you get like really, really, really, really, high resolution images, basically,\" Heida said. \"If we get those observations, then we will be able to prove that there is a black hole in there.\"\nOptical interferometry involves telescopes that are widely separated, even around the globe, are combined to make precise observations. It is a method similar to that which was used to take the first photograph of a black hole, found at the centre of the galaxy Messier 87.\nThe findings aren't a slam dunk: Heida said that some have suggested there could still be something else not seen in the spectrum, but that could be observed visually. That's why they are anxiously awaiting visual observations. \nCould there be even closer black holes?\n\"It's fairly likely that there are black holes even closer, but if they're lonely without a companion we will never find them,\" Rivinius said.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/british-columbia/programs/theearlyedition/there-is-a-fluctuating-light-in-the-southwest-skies-1.5468348", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "August 17, 2019 — The benefits of video games, composting corpses, brewing ancient beer and more", "description": "Right whales in the wrong place and supernovas and bipedalism", "url": "http://www.cbc.ca/radio/quirks/august-17-2019-the-benefits-of-video-games-composting-corpses-brewing-ancient-beer-and-more-1.5155492", "urlToImage": "https://i.cbc.ca/1.5157928.1559327461!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mindlight.jpg", "publishedAt": ["May 31, 2019 4:28 PM ET", "2019-08-16T17:29:58.662Z"], "source": "CBC Radio", "content": "Originally aired on June 1, 2019.\n"}, {"author": "Nicole Mortillaro", "title": "Astronomers are wondering whether Orion's shoulder will soon explode", "description": "When Betelgeuse does eventually go supernova, the brightness will rival a full moon", "url": "http://www.cbc.ca/news/technology/betelgeuse-dimming-1.5407038", "urlToImage": "https://i.cbc.ca/1.5407121.1577129514!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/digitized-sky-survey-image-of-betelgeuse.jpg", "publishedAt": ["Dec 24, 2019 4:00 AM ET", "2019-12-24T11:37:03.163Z"], "source": "CBC News", "content": "The dramatic dimming of a giant star has astronomers wondering whether it's getting ready to explode. \nBetelgeuse — the red shoulder on the left side in the constellation Orion — has dimmed by a factor of about two since October, a change that has never been documented before.\n\"We know that it's the dimmest it's been observed ever, based on the data we have,\" said Stella Kafka, chief executive officer of the American Association of Variable Star Observers. \nWhat makes this development particularly intriguing to astronomers is that the star is slated to explode in spectacular fashion: a supernova. Astronomers estimate this will happen relatively soon — in astronomical terms anyway. It could be today, tomorrow or 100,000 years from now.\nAnd when Betelgeuse goes supernova, astronomers estimate it will be as bright as the full moon and visible even during the day.\nOrion rising on Dec 21 with apparently a dimmer <a href=\"https://twitter.com/hashtag/Betelgeuse?src=hash&amp;ref_src=twsrc%5Etfw\">#Betelgeuse</a> at top centre as the red supergiant undergoes one of its fading episodes. <a href=\"https://twitter.com/universetoday?ref_src=twsrc%5Etfw\">@universetoday</a> <a href=\"https://twitter.com/skyatnightmag?ref_src=twsrc%5Etfw\">@skyatnightmag</a> <a href=\"https://twitter.com/SkyNewsMagazine?ref_src=twsrc%5Etfw\">@SkyNewsMagazine</a> <a href=\"https://twitter.com/SkyandTelescope?ref_src=twsrc%5Etfw\">@SkyandTelescope</a> <a href=\"https://twitter.com/AstronomyMag?ref_src=twsrc%5Etfw\">@AstronomyMag</a> <a href=\"https://twitter.com/SPACEdotcom?ref_src=twsrc%5Etfw\">@SPACEdotcom</a> <a href=\"https://t.co/UO8YzvB45d\">pic.twitter.com/UO8YzvB45d</a>\nThe tricky thing is that, because Betelgeuse is a red supergiant cloaked in a cloud of dust and gas, it's difficult to accurately describe it.\nIt's believed to be anywhere between 425 to 650 light years away, with a mass roughly 10 times that of the sun. It is also huge — likely 1,400 times larger than the sun. If it sat where the sun does, it would swallow all the inner planets, including Earth, Mars and even Jupiter. It's also about 14,000 times more luminous than our comparatively small star.\nBut Betelgeuse is also a variable star, meaning its brightness rises and falls periodically. But we've never seen it like this.\n\"Maybe 300 years ago, Betelgeuse was dimmer than what we're observing now, but we don't have data,\" Kafka said. \nSo, does this dimming portend a potentially historic and magnificent explosion?\nMaybe. Maybe not.\nIt's not quite clear why exactly Betelgeuse dims periodically, but one of the possibilities is that, like the sun, it has cooler and hotter parts. If one of those cooler parts swung into our line of sight, that could make it seem like the star had dimmed.\nIn 2018, Betelgeuse had a couple of dips in its brightness, Kafka said. What we're seeing now could be that same spot, or possibly another.\nPlus, dimming isn't necessarily indicative of an impending explosion.\nThere's no telling what will happen next.\n\"I don't even know if that's the dimmest it's going to get. This is an event that has been evolving,\" Kafka said. \"We're still in the middle of it. Well, we're still actually at the beginning of it. These kinds of massive stars move slowly. They take their sweet time.\"\nAstronomers spot supernovas somewhat regularly, though in other galaxies.\nThe last one in our galaxy that may have been observed from Earth was Cassiopeia A in 1680. \nAstronomers estimate that supernovas occur in galaxies like ours once every 100 years or so, though that doesn't mean we will witness them all; they could be on the other side of the galaxy, for example, or hidden from view.\nA perfect example is a study published in 2008 that detected the remnant of a supernova in the Milky Way that was traced back roughly 140 years. It wasn't visible to the naked eye, as it lay close to the centre of the galaxy and was obscured by dust and gas.\nSo we may be due for one soon.\nKafka said there's no need to panic: even if Betelgeuse were to explode, it wouldn't obliterate life on Earth or turn us into mutants, though we would notice the blow of radiation it would deliver.\n\"What I will tell you is that it will be super interesting,\" Kafka said.\n\"It will be an excellent opportunity to study a supernova in the making.\"\nThe star could explode in two ways, she said. Either in two beams from its poles, or with a spherical, symmetrical explosion in all directions. If we were in the way of the beam-type explosion — which we're not — or if Betelgeuse was a lot closer, we'd be in trouble.\nBut for now, you can carry on enjoying the holidays, if that's what you were planning.\n\"We're not going to die,\" Kafka said. \"But if you're looking for an excuse to eat more this Christmas, go for it.\"\n"}, {"author": null, "title": "Iconic images from Hubble Space Telescope", "description": "Stellar images from NASA mission that is transforming the way we see our universe", "url": "http://www.cbc.ca/news/technology/iconic-images-hubble-space-telescope-1.5543686", "urlToImage": null, "publishedAt": ["Apr 25, 2020 4:00 AM ET", "2020-04-25T08:00:00.353Z"], "source": "CBC", "content": "Launched on April 24, 1990, the Hubble Space Telescope remains a major symbol for NASA more than 30 years later. Here's a look at some stellar images from the Hubble.\nAfter the Hubble's 30 years in space, this image remains one of its most iconic. The Pillars of Creation depicts a jet-like feature that astronomers say has grown by about 96.5 billion kilometres, based on comparisons of pictures taken between 1995 and 2014. \n(Hubble Heritage Team/NASA/ESA/Reuters)\nMarking the telescope's three decades in space, NASA unveiled a new image taken by Hubble's Wide Field Camera 3. It shows how young, energetic, massive stars illuminate and sculpt their birthplace with powerful winds and searing ultraviolet radiation. The image, nicknamed the Cosmic Reef because it resembles an undersea world, shows a giant red nebula and a smaller blue one that create a huge star-forming region. \n(Space Telescope Science Institute/NASA/ESA)\nIn this 2012 image of hundreds of galaxies, the Hubble provides a display of a phenomenon known as gravitational lensing.\nThe telescope captured a region six billion light-years away containing the galaxy cluster Abell 370, one of the first galaxy clusters in which astronomers observed gravitational lensing, the warping of space-time by the cluster's gravitational field that distorts the light from galaxies far behind it.\nArcs and streaks in the picture are the stretched images of background galaxies.\n(Hubble, HST Frontier F/NASA/ESA)\nThis 2015 photo features a stellar nursery of about 3,000 stars called Westerlund 2, located about 20,000 light-years from the planet Earth in the constellation Carina.\n(NASA/Reuters)\nIn 2006, this Hubble-captured image of the merging Antennae galaxies offered one of the first high-resolution glimpses of the birth of billions of stars. The brightest and most dense areas of the image show super star clusters representing some of the newest material in space.\n (Hubble/B. Whitmore Space Telescope Science Institute/ESA/Reuters \nImages of Eta Carinae, a dying star in our Milky Way galaxy, led scientists to conclude in a 2007 article in the journal Nature that a similarly sized star went supernova some 78 million light-years from Earth and wiped out a star 100 times the size of our sun.\n(NASA/Reuters) \nU Camelopardalis, or U Cam for short, is a star nearing the end of its life located in the Giraffe constellation near the celestial North Pole. As it begins to run low on fuel, instability within the star's core creates coughs of helium gas every few thousand years. This image was captured by Hubble in 2012.\n(Hubble/NASA and H. Olofsson/ESA/Reuters)\nJupiter, the largest planet in the solar system, is best known for its colourful storms, the most famous being the Great Red Spot. Using the ultraviolet capabilities of Hubble, astronomers have focused on another feature of the planet: auroras — stunning light shows in a planet's atmosphere — on the poles of the largest planet in the solar system.\n(ESA/NASA)\nThis NASA illustration from 2013 shows a closeup of cosmic clouds and stellar winds in the Orion Nebula.\n(Hubble Heritage Team/NASA/ESA/Reuters)\nFrom ground-based telescopes, this cosmic object — the glowing remains of a dying, sun-like star — resembles the head and thorax of an ant.\nThis image, released in 2003, shows the so-called ant nebula, otherwise known as Menzel 3, and reveals a pair of fiery lobes protruding from the dying star.\n(NASA/Reuters)\n"}, {"author": "Nicole Mortillaro", "title": "Astronomers capture rare cosmic collision that's a chance to 'understand the chemistry of the universe'", "description": "But astronomers almost missed collision that occurred 2.6 billion light-years away", "url": "http://www.cbc.ca/news/technology/kilonova-neutron-stars-1.5266535", "urlToImage": "https://i.cbc.ca/1.5266542.1567202183!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/kilonova.jpg", "publishedAt": ["Sep 01, 2019 4:00 AM ET", "2019-09-01T08:00:00.201Z"], "source": "CBC News", "content": "It's a cosmic collision that has astronomers rethinking one of the universe's most colossal events: the collision of massive stars.\nIn a new paper published in the journal Monthly Notices of the Royal Astronomical Society, astronomers reveal the finding of a kilonova produced by the collision of two massive stellar objects called neutron stars. The collision is roughly 1,000 times brighter than the death of a massive star called a supernova. And they say it produced several hundred planets' worth of gold and platinum.\nBut astronomers almost missed it. \nIn 2016, telescopes detected an extremely energetic but brief flash called a gamma-ray burst. Astronomers were quick to determine the source, which they concluded was the collision of two extremely dense stars called neutron stars.\nBut what they expected to see from a kilonova — an increased brightening in the infrared spectrum over several days — failed to materialize. Disappointed, they moved on.\nFast forward to 2017, when the Laser Interferometer Gravitational-wave Observatory (LIGO) detected a gravitational wave, a ripple through space-time, followed by optical observations of a pair of neutron stars colliding.\nThat gave astronomer Eleonora Troja pause. \n\"It was like, wait a minute. Maybe we were wrong. Maybe what we thought a kilonova looked like is not what a kilonova looked like,\" said Troja, lead author of the study and an astronomer at both the University of Maryland and NASA's Goddard Space Flight Centre. \"Or maybe there were different types of kilonovae.\" \nShe decided to go back to the 2016 data. And what she found thrilled her.\n\"I went back and collected all the data that we had on the event of 2016,\" Troja said. \"I simply took what the LIGO event looked like in the infrared, I matched the two data, and it was like, 'Oh yeah, it fits. That's it.'\"\nWhat they discovered is a collision that took place 2.6 billion light-years away that produced several hundred Earth masses of platinum and gold. Astrophysicists believe that these cosmic collisions are responsible for the platinum and gold that is found on Earth.\nTroja said that she's encouraged by the finding, as now it makes two kilonova events.\nWhen neutron stars collide, just like a supernova, something else is created. With a supernova, sometimes a black hole is the result. But with neutron stars, it's not exactly clear.\n\"The remnant could be a highly magnetized, hypermassive neutron star known as a magnetar, which survived the collision and then collapsed into a black hole,\" said Geoffrey Ryan, a Joint Space-Science Institute prize postdoctoral fellow in the University of Maryland's Department of Astronomy and a co-author of the research paper. \nIf it is, this presents another puzzle since the theory is that a magnetar should slow down or even stop producing heavy metals. But, based on the brightening astronomers witnessed, it suggests that somehow whatever was formed is still able to produce them.\nTroja said that she's anxious to discover more of these short-lived events astronomers refer to as \"transients.\" \n\"We've been studying supernovas for 50 years or more, and we're still learning. We've been studying kilonova for two years,\" said Troja. \"I'd say this field of study is in its infancy. And I think it will develop and become more complex with more observations.\n\"It gives us the opportunity to understand the chemistry of the universe,\" Troja said.\n"}, {"author": "CBC Books", "title": "Misconduct of the Heart", "description": "Cordelia Strube", "url": "http://www.cbc.ca/books/misconduct-of-the-heart-1.5419670", "urlToImage": null, "publishedAt": ["Feb 05, 2020 9:57 AM ET", "2020-02-06T18:21:30.827Z"], "source": null, "content": "Stevie, a recovering alcoholic and kitchen manager of Chappy's, a small chain restaurant, is frantically trying to prevent the people around her from going supernova: her PTSD-suffering veteran son, her uproariously demented parents, the polyglot eccentrics who work in her kitchen, the blind geriatric dog she inherits, and a damaged five-year-old who landed on her doorstep and might just be her granddaughter.\nIn the tight grip of new corporate owners, Stevie battles corporate's \"restructuring\" to save her kitchen, while trying to learn to forgive herself and maybe allow some love back into her life. Stevie's biting, hilarious take on her own and others' foibles will make you cheer and will have you loving Misconduct of the Heart (in the immortal words of Stevie's best line cook) \"like never tomorrow.\" (From ECW Press)\nMisconduct of the Heart is available in April 2020.\nCordelia Strube is a Toronto-based writer. She has been nominated for the Governor General's Literary Award, the Trillium Book Award and longlisted for the Scotiabank Giller Prize. She has written numerous books, including On the Shores of Darkness, There Is Light. \n"}, {"author": null, "title": "Entrepreneurs, PhD student, dentist honoured with 2020 Northwestern Ontario Visionary Awards", "description": "NOVAs recognize leadership, professional achievement, volunteer work and civic pride", "url": "http://www.cbc.ca/news/canada/thunder-bay/thunder-bay-nova-winners-1.5433154", "urlToImage": "https://i.cbc.ca/1.4253580.1503087427!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/al-bourbouhakis.JPG", "publishedAt": ["Jan 20, 2020 11:31 AM ET", "2020-01-20T16:31:40.055Z"], "source": "CBC News", "content": "The founders of Heartbeat Hot Sauce, the president of the Lakehead University Student Union (LUSU), and the founder of Stand Up for Clean Up are among the 20 people honoured at the 2020 Northern Ontario Visionary Awards (NOVAs), which recognize outstanding leadership, professional achievement, volunteerism and civic pride in individuals under 40.\nAl Bourbouhakis and Nancy Shaw, who founded the hot sauce company in 2015 after making hot sauce at home as a hobby, received this year's SuperNOVA award, honouring those whose work has been recognized internationally. \nLUSU president Masoud Manzouri received the People's Choice NOVA, the winner of which is decided by the public through online voting.\nStand Up for Clean Up founder Joshua Donaled Hewitt received the Civic Pride NOVA, which recognizes efforts in community improvement and instilling civic pride in others.\nNOVA recipients in the business and professional category included dentist Derval Clarke, who has travelled to his home country of Jamaica and to northern First Nations to offer free dental services to those in need.\nDo or Diabetes founder Hafsa Siddiqui was a recipient of the Community Champion NOVA for her work offering wellness workshops, physical health programs and support groups to people with diabetes. \nAs well, the physician recruitment specialist at the Thunder Bay Regional Health Sciences Centre, Jamie Sitar, received one of the NOVAs for leadership.\nThe awards were handed out at a ceremony Saturday night at the Valhalla Inn, which was hosted by SHIFT, Thunder Bay's young professionals network.  \nBusiness and Professional Achievement Category\nCommunity Champion Category\nLeadership Category\nRising Star NOVA\nCivic Pride NOVA\nSHIFT Disturber NOVA\nPeople's Choice NOVA\nSuperNOVA\n"}, {"author": null, "title": "Did our ancestors evolve to walk upright because of exploding stars?", "description": "Cosmic rays from supernovae might have destroyed forests and forced us up onto 2 legs", "url": "http://www.cbc.ca/radio/quirks/august-17-2019-the-benefits-of-video-games-composting-corpses-brewing-ancient-beer-and-more-1.5155492/did-our-ancestors-evolve-to-walk-upright-because-of-exploding-stars-1.5155499", "urlToImage": "https://i.cbc.ca/1.5158180.1559332796!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/485613586.jpg", "publishedAt": ["May 31, 2019 4:29 PM ET", "2019-08-16T17:29:32.463Z"], "source": "CBC Radio", "content": "Originally published on June 1, 2019.\nHumans might be able to thank exploding stars in our cosmic neighborhood for triggering our evolution from knuckle-walking apes into fully bipedal creatures.\nA team of American astronomers is suggesting that between about eight and 2.5 million years ago, nearby supernovae bathed our planet in cosmic rays. This, they think, led to a chain of events that drove a shift from forested to grassland landscapes. These new grasslands favoured the evolution of upright walking in our ancestors.\nWhat the astronomers are proposing is a trigger for an evolutionary transition that anthropologists have long recognized in our history. Our last common ancestor with chimpanzees was probably more like a knuckle-walking chimp than an erect modern human.\n\"There was an evolutionary push … to go from climbing around in trees to walking through the grasslands,\" Brian Thomas, an astronomer at Washburn University in Kansas, told Quirks & Quarks host Bob McDonald.\nStarting about six million years ago, the fossil record starts to show the evolution of apes that are more and more adapted to bipedal walking. This includes a range of changes to the pelvis, hip and foot structure, and eventually led to taller, fully upright creatures. These modified apes would be better able to walk long distances and stand tall to see both prey and predators on the new plains of Africa.\nAn upright posture would also have freed their hands to be able to hold, carry and use tools, indirectly paving the way for more complex behaviours and the evolution of larger brains.\nIt was the shift in landscape from forest to grassland that led to this adaptation that Thomas thinks he and his team can now explain as the the result of supernova explosions in our cosmic neighborhood.\nTheir argument is that over hundreds of thousands to millions of years, one or more supernovae triggered an increase in the rate of wildfires that wiped out forests and replaced them with grasslands.\nThe chain of events goes something like this: exploding stars would have produced vast quantities of cosmic rays which rained down on the Earth's atmosphere after crossing the vast gulf of space. The evidence to support this part of the story lies in other particles produced from the supernova explosions.\n\"When you have a supernova explosion, it produces a lot of stuff and one of the things it makes is an isotope of iron called iron 60,\" said Thomas.\nTraces of this distinct form of radioactive iron have been found in marine sediments at higher levels starting about seven million years ago and peaking at about 2.5 million years ago.  \nThis, the team says, is evidence of at least one and probably several supernovae at distances of 150 to 300 light years, which would have sent showers of particles into space, some of which would have struck our planet. \nThese cosmic rays could have facilitated an increase in lightning strikes that would have started fires.\nAs Thomas explains, lightning occurs when an electrical charge difference between clouds and the ground causes current to flow as a massive spark through the atmosphere.\n\"Something has to get that going,\" he said. \"There has to be some kind of cascade that causes the charge to flow to cause this current. And one explanation for what gets it going is cosmic rays.\"\nCosmic rays are mostly protons — hydrogen atoms whose electron has been ripped free by the force of the supernova explosion. These particles enter our atmosphere at tremendous speed and hit gas molecules in the atmosphere, freeing their electrons.\nThese free electrons increase the electrical conductivity of the atmosphere, acting a little like electrical wires to bridge the gap between cloud and ground, and increasing the chance of a lightning strike.\n\"We increase our cosmic ray background by about 50 times in the lower atmosphere, and so we would expect pretty simplistically maybe a 50 times increase in lightning,\" said Thomas.\n\"More lightning produces more wildfires and more wildfires is going to cause this kind of transition from more tree cover to more grasslands.\"\nThe geological record provides some evidence for this part of the story as well, Thomas explained. \"We do see that there was an increase in lightning — or increase in fire rates, rather — around eight million years ago and that continues up through past even two and a half million years ago.\"\nEvidence for these fires can be seen in sediments around the world as layers of soot and charcoal.\nThomas says there's not much chance of history repeating itself with nearby supernovas creating conditions for global wildfires in the future. There simply aren't any stars near enough in our stellar neighbourhood that will be exploding any time soon.\n\"The closest one is a star called Betelgeuse, I believe in the constellation Orion, and it's several hundred parsecs away,\" Thomas said. \"So it's too far to be really much of a threat.\" \n"}, {"author": "Nicole Mortillaro", "title": "New photo of a star that people hope will explode shows it fading and changing shape", "description": "Betelgeuse appears 'hidden behind ... a sort of curtain,' says astronomer", "url": "http://www.cbc.ca/news/technology/betelgeuse-betelgeuse-betelgeuse-1.5464353", "urlToImage": "https://i.cbc.ca/1.5464555.1581719071!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/betelgeuse-december-2019.jpg", "publishedAt": ["Feb 15, 2020 4:00 AM ET", "2020-02-15T21:19:43.614Z"], "source": "CBC News", "content": "Betelgeuse just keeps getting weirder and weirder.\nThe massive star has been the subject of much discussion over the past few months after it began to dim in December. The fading hasn't stopped, and the star that usually lies in the top 10 brightest has fallen to 24th. \nThen, last month, a gravitational wave was detected from the region. These ripples of space-time can occur by massive objects merging, like two black holes or two neutron stars.\nNow, astronomers using the European Southern Observatory's Very Large Telescope have photographed the massive star and revealed that it appears to have changed shape.\nThe team has been observing Betelgeuse for some time and, in fact, had taken an image in January 2019 using the Spectro-Polarimetric High-contrast Exoplanet REsearch instrument on the telescope (SPHERE). \nBut their followup photograph in December — released today — showed something entirely different.\n\"We imaged [Betelgeuse] last year … and at that time it wasn't dimming,\" said Emily Cannon, an astronomer at the Institute of Astronomy, KU Leuven in Belgium. \"After we got that [new] image we realized that there's actually quite a large difference between the two of them. So now it's, 'What is causing that?'\"\nSwipe to compare 2019 images from January and December:\nFor one, the star has changed shape. Also in the image is a bright spot near the top left, and of course, the dimming seen at the lower part of the star.\n\"It looks like half of the star is hidden behind, in a sense, a sort of curtain,\" said Pierre Kervella, an astronomer with LESIA at the Observatoire de Paris — PSL, who was also involved in acquiring the photograph.\nThough Kervella said they're still collecting observations, he said that one hypothesis is that the star has ejected material that has condensed into molecules and dust grains which resemble a \"cloud of smoke.\"\nSeeing as Betelgeuse is 14,000 times more luminous than our sun (it's also massive: roughly 1,400 times larger than our sun), it would take an immense amount of material for this to occur. But Kervella said that's another thing they're trying to determine.\nThe bright spot, astronomers believe, is caused by convective cells. These are regions where hotter material is rising to the star's surface while cooler material goes down. Our sun has millions of these cells, whereas it's believed that a red supergiant like Betelgeuse likely just has five or 10.\nCannon notes that red supergiants don't actually appear round, as big bubbles of gas can be bubbling out in various directions, so that could account for the star's strange appearance.\nRed supergiants are some of the most massive and brightest stars, but they don't live that long. In human terms, Betelgeuse is a geriatric at 10 million years old, because red supergiants go through their fuel so quickly. It is nearing the end of its life. By contrast, our smaller sun is roughly 4.5 billion years old, but, as a yellow dwarf, is considered just middle-aged.\nRed supergiant stars like Betelgeuse die in a spectacular fashion: after exhausting all their hydrogen and helium they collapse onto themselves, and finally explode in a supernova, one of the most cataclysmic events in the universe. And Betelgeuse is near the end of its life. \nBetelgeuse is a semi-regular variable star, meaning that it dims periodically, with multiple periods. It has cycles of roughly 430 days, but also 100 to 180 days as well as one of about six years.\nBut now Betelgeuse is at 36 per cent its normal brightness. And some people think all this activity — the deep minimum, the potential gravitational wave and now its seemingly misshapen appearance — might mean it's going to go boom.\nDue to its proximity, if it did go supernova, astronomers believe it would be as bright as the full moon and visible during the day.\n\"This is something everyone would like to see,\" said Kervella. \"If it would explode, it would be a marvellous show.\"\nHowever, he added, \"I'd say it's quite unlikely in terms of pure statistics that we'll see it in our lifetime.\" \nThough Cannon said she doesn't believe what they've observed means that Betelgeuse is necessarily ready to pop now, she added that our knowledge on red supergiants is somewhat limited.\n\"Never say never, because we don't really know that much about what's going on with red supergiants,\" she said. \"It's impossible to rule out anything, really.\"\n"}, {"author": "Nicole Mortillaro", "title": "Is a gravitational wave detection near Betelgeuse a sign the star is ready to explode?", "description": "At the end of its life, the enigmatic star will shine like a beacon in the sky", "url": "http://www.cbc.ca/news/technology/betelgeuse-gravitational-wave-1.5433653", "urlToImage": "https://i.cbc.ca/1.2178554.1579568637!/httpImage/image.jpg_gen/derivatives/16x9_780/betelgeuse-cp-w7097650.jpg", "publishedAt": ["Jan 21, 2020 4:00 AM ET", "2020-01-21T18:02:43.518Z"], "source": "CBC News", "content": "First it was the strange dimming of Betelgeuse. Now it's a gravitational wave that once again has astronomers scratching their heads over this enigmatic star found in the constellation Orion.\nBetelgeuse has been grabbing a few headlines lately, as the normally bright star dimmed to its lowest point ever recorded — and astronomers don't exactly know why.\nNow the U.S.-based Laser Interferometer Gravitational-Wave Observatory (LIGO) has detected a gravitational wave coming from that direction, adding another intriguing detail to what's happening.\nThe first gravitational wave ever recorded — a powerful ripple through space-time caused by cataclysmic events, like two merging black holes — was detected in September 2015.\nSince then, many more have been found, including one resulting from the merger of two black holes, as well as one from a binary neutron star merger. (A potential black hole-neutron star detection is still waiting to be confirmed.)\nBut seeing as Betelgeuse is still there, a source for the newly detected gravitational wave is unknown.\nNormally, Betelgeuse is a bright red star found in the left \"shoulder\" of Orion.\nIt's classified as a semi-regular variable star, meaning that it dims periodically, but not on a regular basis. (It has two periods when it dims: roughly once every 430 days and once every six years.)\nDuring each cycle, dark spots appear on the surface of Betelgeuse, similar to the sunspots sometimes seen on the sun, but far, far larger. \nThe type of dimming seen on Betelgeuse now, however, is unprecedented. \nBetelgeuse is believed to be roughly 425 to 650 light years away and is huge: likely about 1,400 times larger than our sun and about 14,000 times as luminous. As a result, the star is likely at the end of its life cycle and ready to die.\nAnd it will do so in a spectacular fashion relatively soon: As an explosion known as a supernova.\nAll of that means this latest activity has some people wondering if — and possibly hoping — that will happen in the coming days. \nDear Betelgeuse... <a href=\"https://t.co/1gO2RDpTNI\">pic.twitter.com/1gO2RDpTNI</a>\nIt's important to note that when it comes to astronomical terms, \"relatively soon\" can mean sometime within a few hundred thousand years. And when that happens, Betelgeuse will be as bright as the full moon and visible during the day.\nThis is what the star Betelgeuse exploding would look like from Earth.<br><br>Credit: NHK/Cosmic Front <a href=\"https://t.co/PHJha8NJld\">pic.twitter.com/PHJha8NJld</a>\nSo does this new gravitational wave mean the star is ready to go \"Boom!\" at any moment? Probably not.\nFor one, the wave detection is coming from the direction of Betelgeuse — but not necessarily from Betelgeuse itself, said Salvo Vitale, a physics professor at MIT who works with LIGO.\nAs well, just before a supernova, neutrinos are released from a star. That hasn't happened yet. Added to that, he said, is the fact that Betelgeuse is still shining in the night sky, albeit considerably dimmer than normal.\n\"So putting all those things together, speaking, of course, only on behalf of myself, I would not think that the gravitational-wave candidate … is in any way related to Betelgeuse,\" said Vitale.\nThere's also the chance that what was detected isn't even a gravitational wave at all. The detection doesn't have the characteristics of any known mergers, so it's a mystery as to what caused the detection. (Sometimes a wave results from noise coming from Earth itself, though this isn't believed to be the case in this instance).\nA false alarm for something like this would only occur once in 25 years.\nWhile that may seem like pretty good odds that it's not a false alarm, Vitale notes that other sources of gravitational waves — such as a neutron star-black hole merger — have false alarms more in the range of one in 1,000 years or one in a million years.\n\"One in 25 years is good, but it is not exceptional,\" said Vitale. \"There is always, in our business, … this saying that when you are [looking at] odds, a good kind of threshold is: Would you bet your coffee on this? Would you bet your car? Or would you bet your house?\n\"I am, I think, around maybe between coffee and a meal.\" \nIn the meantime, Vitale said, followup observations are continuing.\nOne of the theories for the deep dimming of Betelgeuse is that its two cycles — the 430-day and the six-year ones — have occurred at the same time, causing the deep darkening we're currently observing. \nThe question is: How much more could the star dim?\n\"We're talking about uncharted territory here. We have no idea,\" said Stella Kafka, CEO of the American Association of Variable Star Observers (AAVSO). \"It's one of those things that is happening for the first time in its recorded history.\"\nIt will take a few years to determine whether the dimming is indeed part of a merging of cycles, Kafka said. \nShe said she is also excited that, for the first time, it's not the large telescopes and astronomical organizations that are doing the observing: Anyone can see Betelgeuse for themselves, even in light-polluted skies.\nIn fact, because the star is typically so bright, observations with smaller telescopes are needed, as well as naked-eye observations — something the AAVSO is calling on amateur astronomers to do more of.\nAnd it's the twin mysteries — the deep dimming and the strange gravitational wave — that makes Betelgeuse so interesting, she said.\n\"The public is very intrigued and very interested in a star that we take for granted,\" Kafka said. \"How many stars do 'interesting' things?\n\"This is new science in the making,\" she added. \"It's actually part of our everyday experience, and we don't get to do that very often.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/2684791458", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1530548803822", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "Brittany Toole", "title": "Chefs and food writers share the best cooking advice they got from their moms", "description": "“My mom taught me that cooking for others was really rarely about the food itself.”  ", "url": "http://www.cbc.ca/life/food/chefs-and-food-writers-share-the-best-cooking-advice-they-got-from-their-moms-1.5557762", "urlToImage": "https://i.cbc.ca/1.5558472.1588798746!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/883140318.jpg", "publishedAt": ["May 06, 2020 4:58 PM ET", "2020-05-06T20:58:46.978Z"], "source": "CBC Life", "content": "While the internet is full of recipe inspiration and answers to our culinary questions, I recently realized just how often I turn to my mom for cooking advice. I continue to fall back on the simple principles she imparted upon me growing up, and I know that I'm not alone in that. Ahead of Mother's Day, we reached out to some of the other people we look to for help — chefs and food writers — to ask what important lessons their moms or mother-figures taught them about cooking. Below, they share some of their best advice.\nAmy Rosen, author of Kosher Style and owner of Rosen's Cinnamon Buns: \n\"I'd say the best thing my mom taught me in the kitchen is that it's fun to just get in there and play around. There were no real rules in the kitchen when I was growing up, except for cleaning up after yourself, so my brothers and I enjoyed learning how to cook and experimenting from a young age. It wasn't about following a recipe or a technique, but more about an attitude. The kitchen isn't a scary place, it's a happy place where you can be creative and whip up food for your family and friends to enjoy, sometimes successfully and sometimes not as successfully. The important part is to try.\"\nJoshna Maharaj, chef, activist, and author of Take Back the Tray: Revolutionizing Food in Hospitals, Schools, and Other Institutions:\n\"I think that the most valuable lesson my mother taught me about cooking is about abundance and generosity. I am lucky to come from a home where food was a big deal, and where we always had other people around the table. My mother always made sure there was lots of food because 'you never know who is going to show up at the door'. This generosity has stuck with me, both in the volume of food I make, and my love of feeding people.\"\nMarcella DiLonardo, recipe developer, author of Bake The Seasons & creator of the blog Hey Modest Marce:\n\"Growing up in an Italian household means you are in the kitchen before you can walk, but you also aren't allowed to touch the stove before age 30. But watching my mom cook taught me how to make the perfect pasta sauce without copying her recipe (because that's a secret that no Italian woman shares). The amazing thing about growing up with an Italian mom is that you get to be creative in the kitchen. I learned the basics needed for a sauce and the techniques behind getting the consistency just right.\" \nShane Chartrand, culinary ambassador for River Cree Resort:\n\"The one thing that my mom taught me is the importance of comfort food; I understand the laissez-faire way of talking about [comfort food] because anyone can make it, when you think about it. But, 20 years of cooking and here I am doing comfort Indigenous cooking... because when I was a kid, my mom made delicious food. It could be as simple as meatloaf, a goulash… she used to make really good borscht — that's the kind of comfort that I enjoyed that my mom really taught me. My mom never taught me how to cook, she just cooked because we had a big family; I watched her cook and it was an inspiration to me, and made me who I am today.\" \nLisa Dawn Bolton, author of On Boards:\n\"My mom taught me that cooking for others was really rarely about the food itself. Her whole approach to cooking was centred around who was coming to her table, and how could she give them a beautiful experience. She taught me to put my guests first, to think about their favourite foods; dishes that would be personal. Her conscientiousness and consideration of others, through how she cooks for them, was definitely an inspiration and influence in how I cook, and why I chose to write a cookbook about gathering people together around food. My mom taught me that cooking for others was about them leaving your home with memories of love and laughter first, and the food second. (But never without leftovers in hand!) It helped me never be afraid to cook or try new things in the kitchen because as long as I was cooking with someone else in mind, from a place of generosity and giving, it was guaranteed to be a success.\"\nWallace Wong, chef and founder of culinary consulting and catering brand Six Pack Chef:\nThe best thing my mom, my aunt and grandma taught me about cooking is that the most important thing is realizing you are cooking for someone and that it was a way to show them you care about them — it was a way to show you loved them. I use this philosophy in my cooking because every time I cook and serve a dish, I think of what they taught me and ask myself 'am I showing this person how much I care and love them?' I also use it as a reference for whenever someone I cook for gives me great compliments or are really enjoying the dish, that means they feel the love and are reciprocating it back. \nSigne Langford, chef and author of Happy Hens & Fresh Eggs: Keeping Chickens in the Kitchen Garden with 100 Recipes:\n\"Truth be told, Mother wasn't much of a cook day to day. When company came, she had her specialities — baba au rhum, paella, chiffon cake, her wonderful shortbread at Christmas — but the rest of the time, everything was under-seasoned and overcooked. I grew up in the 1960s and '70s, when casserole was queen and everything came out of a can, but, when Father's garden started to provide, her cooking was transformed. Then, it was all about simplicity and letting the ingredient shine: juicy, sweet strawberries, crunchy wax beans, cool cucumbers. Perfectly fresh ingredients don't need much meddling; some heat, maybe. Salt? Sure. Butter? Almost always! I absorbed this kitchen gospel and cook by it still. And don't worry Mother, I'm over it now. A childhood of canned spaghetti can be washed away with a single thought of your warm stewed rhubarb and strawberries spilled over vanilla ice cream.\"\nMary Berg, host of Mary's Kitchen Crush and author of Kitchen Party: Effortless Recipes for Every Occasion:\n\"I've made no secret of my mom's aversion to the kitchen but I think the best lesson she's taught me is that cooking and food are first and foremost about sharing. Whether purposefully or not, she has always shown me that there is always enough to go around when a family friend stops by on a whim around dinnertime, or when a neighbour might need a little extra care. In our house, food itself is the best way to share and convey love. Even though cooking might not be her favourite thing in the world, I think this 'whatever I have in the fridge is yours' mentality to sharing food is one of the most amazing lessons I've learned in the kitchen, and in my mind, it makes everything taste about a hundred times better.\"\nJulie Miguel, founder of the blog Daily Tiramisu and recipe developer: \n\"I lost my mother when I was 15 years old. I learned how to cook by watching her day-in and day-out. I sat on the kitchen counter and was her sous chef. During her last few weeks of life, she knew she couldn't cook for us anymore so she gave me detailed instructions for her chicken stock recipe. I wrote them down in her hospital room. She had all the ingredients portioned in the freezer (chicken legs along with tomato and mirepoix ingredients from our garden). I followed her instructions and made the stock; I was surprised at how tasty it was! This simple stock recipe sparked my passion for cooking and gave me the base and knowledge for future recipes. I'm so grateful she taught me this recipe before it was too late because to this day we have been unable to locate her recipe book.\"  \nShahir Massoud, chef and author of the upcoming cookbook \"Eat Habibi, Eat!\":\n\"This one is a bit tricky, because my mom isn't the greatest cook (haha)... however she recently taught me something interesting while I was writing recipes for my cookbook. I was tinkering with ways to transform a classic and traditional Egyptian breakfast called ful medamas (basically fava beans cooked then smashed with olive oil, lemon juice, herbs etc... served with eggs and bread). I was getting way too out there: trying different beans, methods, techniques and so on. When my Mom found out, she emphatically said NO! There are certain dishes you don't want to modernize, experiment with, or change. The very essence of what makes some dishes so enjoyable is how consistent and comforting they have been over the years, and I guess I needed her to remind me of that.\" \nJoy McCarthy, holistic nutritionist and author of The Joyous Cookbook:\n\"My mom taught me one of the most important aspects of eating that I value greatly to this day: the importance of togetherness. She was never preachy about it but she made sure we shared at least one meal together a day as a family. Usually that was dinner from Monday to Friday, and every Sunday night we'd have both my grandmothers over for a special family dinner. Togetherness is so important for our well-being; I can't wait to do that again with my parents when social distancing comes to an end!\"\nMatt Basile, chef and owner of Fidel Gastro's catering:\n\"My mother used to be a great cook, until recently when she became more into is it gluten-free than does it taste good. She never was fancy with food but always had great flavours and quality. [She] was always about the products themselves — specifically produce, meat and fish. She would always tell me to never ever ignore how quality impacts taste.\" \nJennifer Crawford, reigning MasterChef Canada, writer and host of My Queer Kitchen:\n\"'You have to smell this,' my Aunt Bernie would exclaim, shoving that season's fresh dill fronds in my face. This was the accidental best lesson in cooking. She did this every year, with every bit as much enthusiasm as the year before. Lush pleasure and joy from the farmers market to the table, Bernie felt and vocalized it all. If appreciation was a shining light, having Bernie cook for you was like staring straight into a supernova. She passed away a year ago this Mother's Day, so she's been on my mind plenty. In our last conversation, I tearfully told her I admired how much she unabashedly adored and enjoyed food. 'Others may have prepared it better,' her eyes sparkled and she reached for my arm, 'but no one loved it more than me.' And as usual when it came to food, I believe she was right.\nShayma Owaise Saadat, food writer, professor and entrepreneur:\n\"'Don't fret — make do with what you have — and make it your own.' Whether it was that frozen Ellio's nine-slice pizza, or a can of chickpeas in the pantry, my Ami always knew how to transform something seemingly mundane into a nourishing and special treat. Those are the skills I hold dear to me in my life today. When my father was away on work-related trips, sometimes we'd have [that] frozen pizza. But before sliding it into the oven, Ami would add spoonfuls of keema on top — a Pakistani-style ground beef dish, fragrant with ginger, garlic and browned onions. My favourite part was letting the keema crisp up under the broiler before biting into a slice. There were also times when we would come home late at night, after a long trip, and Ami would open a tin of canned chickpeas and stewed tomatoes, making chanay for dinner, finished off with matchstick slices of ginger. We ate it with pita bread she always kept in the freezer. There is always beauty in simplicity.\"\nInterviews have been condensed and edited for space and clarity.\n"}, {"author": "CBC Books", "title": "Trick Mirror", "description": "Jia Tolentino", "url": "http://www.cbc.ca/books/trick-mirror-1.5252550", "urlToImage": null, "publishedAt": ["Aug 19, 2019 5:28 PM ET", "2019-12-18T16:04:16.328Z"], "source": null, "content": "Jia Tolentino is a peerless voice of her generation, tackling the conflicts, contradictions and sea changes that define us and our time. Now, in this dazzling collection of nine entirely original essays, written with a rare combination of give and sharpness, wit and fearlessness, she delves into the forces that warp our vision, demonstrating an unparalleled stylistic potency and critical dexterity.\nTrick Mirror is an enlightening, unforgettable trip through the river of self-delusion that surges just beneath the surface of our lives. This is a book about the incentives that shape us, and about how hard it is to see ourselves clearly through a culture that revolves around the self. In each essay, Tolentino writes about a cultural prism: the rise of the nightmare social internet; the advent of scamming as the definitive millennial ethos; the literary heroine's journey from brave to blank to bitter; the punitive dream of optimization, which insists that everything, including our bodies, should become more efficient and beautiful until we die. Gleaming with Tolentino's sense of humour and capacity to elucidate the impossibly complex in an instant, and marked by her desire to treat the reader with profound honesty, Trick Mirror is an instant classic of the worst decade yet. (From Random House)\nI wrote this book between the spring of 2017 and the fall of 2018 — a period during which American identity, culture, technology, politics, and discourse seemed to coalesce into an unbearable supernova of perpetually escalating conflict, a stretch of time when daily experience seemed both like a stopped elevator and an endless state-fair ride, when many of us regularly found ourselves thinking that everything had gotten as bad as we could possibly imagine, after which, of course, things always got worse.\nThroughout this period, I found that I could hardly trust anything that I was thinking. A doubt that always hovers in the back of my mind intensified: that whatever conclusions I might reach about myself, my life, and my environment are just as likely to be diametrically wrong as they are to be right. This suspicion is hard for me to articulate closely, in part because I usually extinguish it by writing. When I feel confused about something, I write about it until I turn into the person who shows up on paper: a person who is plausibly trustworthy, intuitive, and clear.\nFrom Trick Mirror by Jia Tolentino ©2019. Published by Random House.\n  \n \n"}, {"author": null, "title": "Get informed on the top stories of the day in one quick scan", "description": null, "url": "http://www.cbc.ca/news/morning-brief-december-24-2019-1.5406545", "urlToImage": "https://i.cbc.ca/1.5405272.1576878445!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_780/revenge-porn-sext.jpeg", "publishedAt": ["Dec 24, 2019 7:28 AM ET", "2019-12-24T12:33:23.493Z"], "source": "CBC News", "content": "Good morning! This is our daily news roundup with everything you need to know in one concise read. Sign up here to get this delivered to your inbox every morning.\nIt's called revenge porn, and police forces in Canada are on track to handle more than 5,000 cases involving the non-consensual distribution of intimate images. Experts say young people are sharing pictures illegally in response to peer pressure.\nOttawa criminalized the unauthorized distribution of nude pics and videos in December 2014, in the wake of the high-profile deaths of Rehtaeh Parsons and Amanda Todd. Both took their own lives after being subjected to cyberbullying and harassment. In the case of Rehtaeh, it involved an explicit photo of an alleged gang rape. Read more here about the rise of revenge porn cases.\nCannabis edibles could put party hosts at risk\nLegal experts are warning homeowners serving cannabis edibles at parties that they could face liability issues if they're not careful. Read more here about the potential legal issues around cannabis edibles.\nCanadian restaurants facing shortage of workers\nRestaurants in Canada are facing a critical shortage of workers that's impeding new business and limiting capacity during the holiday season, a critical time of year for profitability, industry experts say. Read more about the challenges the restaurant sector is facing to find new hires.\nPrince Philip leaves hospital\nQueen Elizabeth's husband, 98-year-old Prince Philip, left a London hospital today and was expected to join the Royal Family for Christmas celebrations at the Sandringham estate in eastern England. Read more about Philip's release from hospital here.\nDumping CEO was necessary for Boeing, analysts say\nAnalysts say the ouster of Boeing's CEO Dennis Muilenburg yesterday was just one of the steps the beleaguered American manufacturer had to take as it continues to deal with the fallout of the 737 Max aircraft crisis. Read more about here what analysts think the aircraft maker need to do.\nDimmed star may soon be headed for explosion\nThe dramatic dimming of a giant star, named Betelgeuse, has astronomers wondering whether it's getting ready to go supernova. Read more about the dimming of the star here.\nNow for some good news to start your Tuesday: The bells of Our Lady of the Holy Rosary Cathedral in Vancouver will ring tonight to mark Christmas Eve, thanks to a dedicated group of people who practice the art of change ringing. The tightly controlled sequential ringing of tuned bells dates back to 17th century England, where there are still thousands of churches with change-ringing bells. Here in Canada, there are seven, including three in B.C. Several times a week, the small but devoted group of bell ringers at Holy Rosary gather in the church's ringing chamber to practise. They will also be ringing the bells on New Year's Eve. Read more about the church's bell ringers here.\n(Submitted by Steve Wilson)\nA Canada jay, grey jay, or whiskey jack: whatever you call it, it's sturdy, and it just loves northern Canada. Steve Wilson took this photo in Golden Horn, Yukon. See more winter photos in this gallery from our colleagues at CBC North. \n1781: Canada's first Christmas tree is erected in Sorel, Que., north of Montreal, by Baron Friedrich von Riedesel and Baroness Friederike Charlotte Riedesel.  1814: The War of 1812 officially ends as the United States and Britain sign the Treaty of Ghent in Belgium. Because of a military stalemate, it was agreed to restore prewar boundaries. However, because of the slowness of communications at that time, both countries fought the Battle of New Orleans the following month.  1948: Canada officially recognizes the state of Israel.  1988: Following a bitter two-week debate, the House of Commons approves the Canada-U.S. free trade deal. The vote on final reading —- at 1:48 a.m. Eastern time — is 141-to-111.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1573082517", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1573082517", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "CBC Books", "title": "Read an excerpt from RBC Taylor Prize finalist The Reality Bubble by Ziya Tong", "description": null, "url": "http://www.cbc.ca/books/read-an-excerpt-from-rbc-taylor-prize-finalist-the-reality-bubble-by-ziya-tong-1.5475628", "urlToImage": "https://i.cbc.ca/1.5143290.1558450775!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/the-reality-bubble-by-ziya-tong.jpg", "publishedAt": ["Feb 26, 2020 10:04 AM ET", "2020-02-26T15:04:59.641Z"], "source": null, "content": "The Reality Bubble by science journalist Ziya Tong is a finalist for the 2020 RBC Taylor Prize.\nThe $30,000 prize recognizes the best in Canadian literary nonfiction.\nIn The Reality Bubble, Tong reminds readers that the human eye pales in comparison to what animals with infrared, ultraviolet and 360-degree vision can see. She looks into 10 of humanity's biggest blind spots, including where our food and energy comes from and where our waste goes. \nTong is the vice chair of WWF Canada and is best known as the longtime co-host of the Discovery Channel's Daily Planet, which she anchored for a decade from 2008-2018. The Reality Bubble is her first book.\nThe other finalists are:\nThe winner will be revealed on March 2, 2020. \nIt was announced in November that 2020 will be the last year for the prize, which has been given out since 2000.\nTong was on CBC Radio's Here & Now to discuss The Reality Bubble and the blind spots we have as a modern society. \nYou can read an excerpt from The Reality Bubble below.\nIn life, we all have a moment when we wake up to a bigger picture. For Ann Hodges, that moment arrived on November 30, 1954, at precisely 1:46 p.m., while she was lying on the couch. It wasn't so much an epiphany as a painful reality that struck her that day, when a lime-green \"cosmic missile\" streaked across the clear afternoon sky, crashed through her roof, bounced off a console radio, and flew smack into the side of her body. \nAs the only known person to be hit by a meteorite, Ann became an instant sensation. By nightfall, hundreds of people, including the national news media, descended upon her backyard, snapping photos of the extraterrestrial object, checking out the damage to her house, and looking in awe and horror at the jet-black, football-sized bruise the impact left on her hip. \nBecause she was napping, Ann had slept through the fireball's spectacular descent. Witnesses saw it blaze across three states; TVs began scrambling from the alien interference; and the sonic boom jolted a boy right off his bike more than one hundred kilometres away, in Montgomery, Alabama. As for the locals, when the shooting star finally hit ground zero in the town of Sylacauga, most of them thought they'd heard a plane crash or an exploding bomb. \nAfter a few weeks, though, as with all freak accidents, the buzz died down. The reporters packed up and went home and the neighbours returned to their daily lives. And while the meteorite certainly made an impression on everyone that day, only one person's cosmic perspective was forever changed. For Ann Hodges, the universe, with its meteors and comet showers and supernovas, was no longer a separate place somewhere \"out there.\" Oh, no. The cosmos could come right into your house, if it wanted to, and slap you wide awake.\nFar from being idyllic and tranquil, the heavens are hell. You've got your raging flames, your choking plumes of poisonous gas; darkness, chaos, and violent destruction are pretty much everywhere. In fact, if you look up into the sky tonight in the direction of Sagittarius, just above the archer's arrow, there's a supermassive black hole in our galaxy that is, at this very moment, obliterating everything within its horizon.\nThat's the universe we live in. But it's not the way it feels. That you and I are relatively calm right now, that we aren't in a raw panic at the total and utter mayhem that dangles right above our heads, is because we live in a bubble, a physical one called the atmosphere. From space, this dome is clearly visible. It's a thin, bluish-white film that acts like a planetary force field: it blocks out lethal radiation, maintains temperatures within a tiny range (compared to the extremes of space), and incinerates most of the meteors that would otherwise pulverize the surface of Earth. \nAs human beings, we all live inside another kind of bubble as well: a psychological one that shapes our ideas about the everyday world. This is our \"reality bubble.\" Just as rocks hurtling at supersonic speed find it hard to penetrate Earth's atmosphere, unwelcome facts and unfamiliar ideas almost never make it through the membrane of the reality bubble. It shields us from thinking about forces \"out there\" that are seemingly beyond our control and lets us get on with the business of our lives. \nBut problems arise with inflated certainty, and we see it over and over again. Whether it's real estate bubbles, or stock market bubbles, or political bubbles, being in a bubble means, by definition, that we've got a warped perception of reality. And in the end, all bubbles share the same fate: inevitably, they burst.\nSo we might do well to remember that even our most stable conceptions of the world can be overturned. For over two centuries, the universe was understood to be governed by Newtonian physics, and then Einstein came along. But it doesn't always take a genius to expand our view of the world. Sometimes it just happens. For Ann Hodges, it happened when a meteorite torpedoed through her ceiling one afternoon. And for you, it may just be the book that you're about to read right now. \nExcerpted from The Reality Bubble by Ziya Tong. Copyright © 2019 by Ziya Tong. Published by Allen Lane an imprint of Penguin Canada, a division of Penguin Random House Canada Limited. Reproduced by arrangement with the Publisher. All rights reserved.\n"}, {"author": "Sarah Rieger", "title": "Science, heavy metal and — of course — God: How this church plans to change worship in Calgary", "description": "'There aren't any churches there that are going to be like the kind of church we're planning'", "url": "http://www.cbc.ca/news/canada/calgary/john-van-sloten-calgary-pastor-1.5440829", "urlToImage": "https://i.cbc.ca/1.5440833.1579998971!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/john-van-sloten.jpg", "publishedAt": ["Feb 01, 2020 6:00 AM MT", "2020-02-01T22:12:26.635Z"], "source": "CBC News", "content": "Pastor John van Sloten was called a heretic once, in seminary.\nHis sermons cover topics ranging from the X-Files to CERN's Large Hadron Collider.\nAnd a group of 25 Calgary congregrants, most over age 70, have brought him on to create a new church.\n\"There aren't any churches there that are going to be like the kind of church we're planning,\" van Sloten says.\n\"Feb. 2, at 9:30 a.m., I'll be pacing the sidewalk in front of the church going please, will somebody come.\"\nThat's the date of his first sermon at what is tentatively being called Marda Loop Church, at 1638 30th Avenue in southwest Calgary. It's part of the Reformed Church in America, a mainline Protestant denomination.\nThe topic of that first sermon will be on the parable of the sower, from Matthew 13:3-23, and van Sloten has already emailed a soil scientist at Guelph University to better understand soil fertility. Upcoming topics include supernovas, emergency room physicians and the art of Vincent van Gogh.\nInterviewing a scientist is not exactly how most pastors usually prepare for Sunday morning.\nSome of van Sloten's sermons are available on his website. In one recording, he speaks as a double helix DNA structure is projected on the screen. \nWatch John van Sloten's sermon on DNA below, or click here:\n\"Today the DNA in each of your estimated 37.2 trillion cells will undergo up to one million repairs.\n\"Right now the DNA in your body is being repaired at a rate of 425 trillion repairs per second.\"\nHe pauses, and you can hear a slight smile when his voice resumes.\n\"This second. This. Second.\n\"Can you feel the power in all of that? The sheer scope of God's amazing, restoring grace?\" he asks.\nFor that sermon, van Sloten said he spoke to Dustin Pearson, a University of Calgary researcher who studies DNA repair after radiation and uses CRISPR genome editing to alter human cells.\nFifty-five per cent of Canadians identify as Christian, according to a 2018 survey from Pew Research, and a rising number identify with other faiths or religiously unaffiliated. \nRoughly two-thirds said religion has a less important role in the country than it did 20 years ago, and in 2013, when Pew last asked, one-in-five said they attend some form of weekly religious services while a third said they never pray.\nMembers of the Reformed Church in America have declined from around 217,000 in 2015 to 196,000 in 2019, according to the church's website.\nvan Sloten hopes his unconventional sermons will draw in a new audience — but said that's not the primary motivation for doing what he does.\n\"I really do believe theologically that God has something to do with everything that happens in people's lives in all of those spheres,\" he said.\n\"I think it stands out as a unique way of engaging people's faith in a more holistic, all of life, kind of way.\"\nThis isn't the first time van Sloten has started a new church in the city. He's also written books on how God can speak through heavy metal, R-rated movies or the way we work.\nHis methods aren't popular with everyone.\n\"With science, you get some pushback from more fundamentalist Christians who believe in a young earth … the science gets me in trouble when you start to talk about evolution,\" he said. When he talked about Metallica he said he got some unpleasant phone calls.\n\"But to be honest I don't care about pissing off fundamentalist Christians. I care a lot about people who are good people who are out there looking for something more,\" he said. \n\"In the 20 years that I've been diving into it it's connected with a lot of people who aren't interested in church. So I'm going to trust that that can happen again.\"\nvan Sloten has also brought in Michelle Gritter, a trained family therapist, who will cover 13 Sundays out of the year and preach about psychology to give him time to work on his writing.\n\"People are going, 'Oh, this will be great for our community, just to get healthy and get to know each other,'\" he said. \"I kind of joked with her — people might want to come to you [for counselling] after the service.\"\nWord of mouth is key to church-building — people are pretty leery of receiving mailers, or having someone knock on their door to spread the good word, van Sloten said.\nSo instead, he's aiming for a holistic approach — sermons that connect with what's already going on in people's lives. \nBut will people come? Well, van Sloten has faith. \n"}, {"author": "Bob McDonald", "title": "One big eye on the sky closes, but bigger one is on the way", "description": "The Spitzer Space Telescope brought us new images of the cool universe", "url": "http://www.cbc.ca/radio/quirks/one-big-eye-on-the-sky-closes-but-bigger-one-is-on-the-way-1.5447813", "urlToImage": "https://i.cbc.ca/1.5447850.1580498352!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/perseus-molecular-cloud.jpg", "publishedAt": ["Jan 31, 2020 2:32 PM ET", "2020-01-31T21:46:17.498Z"], "source": "CBC Radio", "content": "After more than a decade and a half of scanning the skies, the Spitzer Space Telescope has been shut down for good. On January 30 the telescope was put in safe mode and ceased operation. Meanwhile, a much larger successor is being readied for launch.\nThe Spitzer Space Telescope is not as famous as its cousin Hubble, but it discovered aspects of the universe invisible to other telescopes because its instruments were tuned to infrared light. Many telescopes, including Hubble, see primarily in visible light, which is one reason Hubble pictures are so popular with the public. They show astronomical objects as they might appear to us (if our eyes were huge, super-sensitive and in orbit.)  \nSpitzer saw the universe through infrared light, basically seeing heat (you may have seen infrared pictures of people where their faces glow brightly while hair and clothing are much darker). To do this, its instruments were super-cooled; it was placed in an orbit that kept it far away from the glow of Earth; and it had a shield that protected it from the heat of the sun. \nAll this gave it the ability to see objects in the universe essentially by temperature instead of visible light, which reveals objects that are relatively cool and thus dark in visible light. This included the dust clouds that drift between the stars, and disks around stars that give birth to new planets. It was also able to see deeper into dust clouds that normally block the view of other telescopes.\nThe Spitzer telescope was named after astronomer Lyman Spitzer Jr., who was first to suggest placing telescopes in space to get a clearer view of the universe high above the Earth's shimmering atmosphere. It was one of four great space-based observatories that included Hubble, the Chandra X-Ray Observatory, and the Compton Gamma Ray Observatory. Each telescope gave us a different view of the universe, which when combined, filled out details that are far beyond what the eye can see. \nOnly Chandra and Hubble are still operating.\nLaunched in 2003, the Spitzer mission was designed to run for two-and-a-half years. But like many spacecraft, it lasted far beyond its base mission. Its cryogenic coolant ran out in 2009, then it began it's \"warm\" phase, where scientists found that the telescope was still very good at studying planets going around other stars. \nOne of its targets was the Trappist 1 system, with seven Earth-sized planets, three of them in the habitable zone where liquid water could exist on their surfaces.  \nDuring its extended life of more than a decade, Spitzer was even able to study the atmospheres of exoplanets, basically giving us weather reports on alien worlds. \nNow that Spitzer has been shut down, its successor, the James Webb Space Telescope is being prepared for launch. This project includes participation from the U.S., Europe and Canada. It involves a 6.5-metre mirror that is so big it had to be built in segments that fold up to fit into the nose-cone of a launch vehicle.\nWebb will also see infrared but with a sensitivity that will enable it to peer further into the depths of the universe and further back in time toward the Big Bang than ever before.\nUnfortunately, a recent report from the U.S. Government Accountability Department found that the the long-delayed and seriously over-budget Webb may be delayed once again, possibly missing its planned March 2021 launch date. Since development of the telescope began in 1996, the launch date has been pushed back several times and the budget has doubled to $9.7 billion. But whenever Webb does get off the ground and becomes operational, we will have the biggest, most powerful eye on the sky ever launched into space.\nEvery new type of telescope adds to our ever-expanding knowledge of this incredibly complex universe we live in.\nGalileo was the first to point an instrument at the sky, and saw mountains on the moon, other moons orbiting Jupiter, and the sky went from being the domain of mythological creatures into the home of real worlds. As instruments grew larger, astronomers such as Edwin Hubble refined our cosmic address, showing that we live in just one of billions of galaxies spread across an ever-expanding universe. Radio astronomy revealed some of the most violent events, such as supernova and spinning neutron stars. Other instruments have seen the remnants of the big bang itself.\nWho knows what we will see next?\n"}, {"author": "Sarah Rieger", "title": "Science, heavy metal and — of course — God: How this church plans to change worship in Calgary", "description": "'There aren't any churches there that are going to be like the kind of church we're planning'", "url": "http://www.cbc.ca/news/canada/calgary/john-van-sloten-calgary-pastor-1.5440829", "urlToImage": "https://i.cbc.ca/1.5440833.1579998971!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/john-van-sloten.jpg", "publishedAt": ["Feb 01, 2020 6:00 AM MT", "2020-02-01T22:12:26.635Z"], "source": "CBC News", "content": "Pastor John van Sloten was called a heretic once, in seminary.\nHis sermons cover topics ranging from the X-Files to CERN's Large Hadron Collider.\nAnd a group of 25 Calgary congregrants, most over age 70, have brought him on to create a new church.\n\"There aren't any churches there that are going to be like the kind of church we're planning,\" van Sloten says.\n\"Feb. 2, at 9:30 a.m., I'll be pacing the sidewalk in front of the church going please, will somebody come.\"\nThat's the date of his first sermon at what is tentatively being called Marda Loop Church, at 1638 30th Avenue in southwest Calgary. It's part of the Reformed Church in America, a mainline Protestant denomination.\nThe topic of that first sermon will be on the parable of the sower, from Matthew 13:3-23, and van Sloten has already emailed a soil scientist at Guelph University to better understand soil fertility. Upcoming topics include supernovas, emergency room physicians and the art of Vincent van Gogh.\nInterviewing a scientist is not exactly how most pastors usually prepare for Sunday morning.\nSome of van Sloten's sermons are available on his website. In one recording, he speaks as a double helix DNA structure is projected on the screen. \nWatch John van Sloten's sermon on DNA below, or click here:\n\"Today the DNA in each of your estimated 37.2 trillion cells will undergo up to one million repairs.\n\"Right now the DNA in your body is being repaired at a rate of 425 trillion repairs per second.\"\nHe pauses, and you can hear a slight smile when his voice resumes.\n\"This second. This. Second.\n\"Can you feel the power in all of that? The sheer scope of God's amazing, restoring grace?\" he asks.\nFor that sermon, van Sloten said he spoke to Dustin Pearson, a University of Calgary researcher who studies DNA repair after radiation and uses CRISPR genome editing to alter human cells.\nFifty-five per cent of Canadians identify as Christian, according to a 2018 survey from Pew Research, and a rising number identify with other faiths or religiously unaffiliated. \nRoughly two-thirds said religion has a less important role in the country than it did 20 years ago, and in 2013, when Pew last asked, one-in-five said they attend some form of weekly religious services while a third said they never pray.\nMembers of the Reformed Church in America have declined from around 217,000 in 2015 to 196,000 in 2019, according to the church's website.\nvan Sloten hopes his unconventional sermons will draw in a new audience — but said that's not the primary motivation for doing what he does.\n\"I really do believe theologically that God has something to do with everything that happens in people's lives in all of those spheres,\" he said.\n\"I think it stands out as a unique way of engaging people's faith in a more holistic, all of life, kind of way.\"\nThis isn't the first time van Sloten has started a new church in the city. He's also written books on how God can speak through heavy metal, R-rated movies or the way we work.\nHis methods aren't popular with everyone.\n\"With science, you get some pushback from more fundamentalist Christians who believe in a young earth … the science gets me in trouble when you start to talk about evolution,\" he said. When he talked about Metallica he said he got some unpleasant phone calls.\n\"But to be honest I don't care about pissing off fundamentalist Christians. I care a lot about people who are good people who are out there looking for something more,\" he said. \n\"In the 20 years that I've been diving into it it's connected with a lot of people who aren't interested in church. So I'm going to trust that that can happen again.\"\nvan Sloten has also brought in Michelle Gritter, a trained family therapist, who will cover 13 Sundays out of the year and preach about psychology to give him time to work on his writing.\n\"People are going, 'Oh, this will be great for our community, just to get healthy and get to know each other,'\" he said. \"I kind of joked with her — people might want to come to you [for counselling] after the service.\"\nWord of mouth is key to church-building — people are pretty leery of receiving mailers, or having someone knock on their door to spread the good word, van Sloten said.\nSo instead, he's aiming for a holistic approach — sermons that connect with what's already going on in people's lives. \nBut will people come? Well, van Sloten has faith. \n"}, {"author": "Bob McDonald", "title": "One big eye on the sky closes, but bigger one is on the way", "description": "The Spitzer Space Telescope brought us new images of the cool universe", "url": "http://www.cbc.ca/radio/quirks/one-big-eye-on-the-sky-closes-but-bigger-one-is-on-the-way-1.5447813", "urlToImage": "https://i.cbc.ca/1.5447850.1580498352!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/perseus-molecular-cloud.jpg", "publishedAt": ["Jan 31, 2020 2:32 PM ET", "2020-01-31T21:46:17.498Z"], "source": "CBC Radio", "content": "After more than a decade and a half of scanning the skies, the Spitzer Space Telescope has been shut down for good. On January 30 the telescope was put in safe mode and ceased operation. Meanwhile, a much larger successor is being readied for launch.\nThe Spitzer Space Telescope is not as famous as its cousin Hubble, but it discovered aspects of the universe invisible to other telescopes because its instruments were tuned to infrared light. Many telescopes, including Hubble, see primarily in visible light, which is one reason Hubble pictures are so popular with the public. They show astronomical objects as they might appear to us (if our eyes were huge, super-sensitive and in orbit.)  \nSpitzer saw the universe through infrared light, basically seeing heat (you may have seen infrared pictures of people where their faces glow brightly while hair and clothing are much darker). To do this, its instruments were super-cooled; it was placed in an orbit that kept it far away from the glow of Earth; and it had a shield that protected it from the heat of the sun. \nAll this gave it the ability to see objects in the universe essentially by temperature instead of visible light, which reveals objects that are relatively cool and thus dark in visible light. This included the dust clouds that drift between the stars, and disks around stars that give birth to new planets. It was also able to see deeper into dust clouds that normally block the view of other telescopes.\nThe Spitzer telescope was named after astronomer Lyman Spitzer Jr., who was first to suggest placing telescopes in space to get a clearer view of the universe high above the Earth's shimmering atmosphere. It was one of four great space-based observatories that included Hubble, the Chandra X-Ray Observatory, and the Compton Gamma Ray Observatory. Each telescope gave us a different view of the universe, which when combined, filled out details that are far beyond what the eye can see. \nOnly Chandra and Hubble are still operating.\nLaunched in 2003, the Spitzer mission was designed to run for two-and-a-half years. But like many spacecraft, it lasted far beyond its base mission. Its cryogenic coolant ran out in 2009, then it began it's \"warm\" phase, where scientists found that the telescope was still very good at studying planets going around other stars. \nOne of its targets was the Trappist 1 system, with seven Earth-sized planets, three of them in the habitable zone where liquid water could exist on their surfaces.  \nDuring its extended life of more than a decade, Spitzer was even able to study the atmospheres of exoplanets, basically giving us weather reports on alien worlds. \nNow that Spitzer has been shut down, its successor, the James Webb Space Telescope is being prepared for launch. This project includes participation from the U.S., Europe and Canada. It involves a 6.5-metre mirror that is so big it had to be built in segments that fold up to fit into the nose-cone of a launch vehicle.\nWebb will also see infrared but with a sensitivity that will enable it to peer further into the depths of the universe and further back in time toward the Big Bang than ever before.\nUnfortunately, a recent report from the U.S. Government Accountability Department found that the the long-delayed and seriously over-budget Webb may be delayed once again, possibly missing its planned March 2021 launch date. Since development of the telescope began in 1996, the launch date has been pushed back several times and the budget has doubled to $9.7 billion. But whenever Webb does get off the ground and becomes operational, we will have the biggest, most powerful eye on the sky ever launched into space.\nEvery new type of telescope adds to our ever-expanding knowledge of this incredibly complex universe we live in.\nGalileo was the first to point an instrument at the sky, and saw mountains on the moon, other moons orbiting Jupiter, and the sky went from being the domain of mythological creatures into the home of real worlds. As instruments grew larger, astronomers such as Edwin Hubble refined our cosmic address, showing that we live in just one of billions of galaxies spread across an ever-expanding universe. Radio astronomy revealed some of the most violent events, such as supernova and spinning neutron stars. Other instruments have seen the remnants of the big bang itself.\nWho knows what we will see next?\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1534133827654", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1534129731988", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1534132803506", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Get informed on the top stories of the day in one quick scan", "description": null, "url": "http://www.cbc.ca/news/morning-brief-february-27-2020-1.5477764", "urlToImage": null, "publishedAt": ["Feb 27, 2020 7:00 AM ET", "2020-02-27T12:02:15.017Z"], "source": "CBC News", "content": "Good morning! This is our daily news roundup with everything you need to know in one concise read. Sign up here to get this delivered to your inbox every morning.\nTravellers have lodged more than 3,000 complaints in just an eight-week period with the Canadian Transportation Agency, questioning why airlines denied them compensation for delayed flights. By way of comparison, the CTA received 7,650 complaints on all topics in the entirety of its most recent fiscal year.  Ottawa introduced new regulations on Dec.15 that mandate airlines must pay up to $1,000 in compensation for flight delays and cancellations that were within the airline's control and not safety-related. However, the new rules have led to confusion and frustration for many passengers who say the airlines aren't providing valid reasons when rejecting claims.  \"Clearly passengers are upset,\" said Michael Kerr, who believes Air Canada unfairly denied him compensation. The Toronto man filed a complaint with the CTA after the airline rejected his compensation claim following an eight-hour delay on a Halifax-to-Toronto flight on Feb. 2.   Kerr's complaint is one of 570 selected by the CTA for an inquiry; 378 of the complaints involve Air Canada, which is the country's largest airline, and the rest are scattered among Sunwing, WestJet, Air Transat, Swoop and United Airlines.   The CTA said it doesn't have the resources to investigate all of the complaints as part of the inquiry, and that the remainder will be dealt with at a later date. The agency didn't offer a timeline for the remaining complaints, but said the inquiry's findings may help in resolving them. Read more here about the compensation complaints.\nThe worst-hit areas of Asia continue to struggle with the new coronavirus, with hundreds more cases reported today in South Korea and China as worries about infection and containment spread across the globe. Australian PM Scott Morrison said his country, which has 23 cases of the virus, was operating on the basis of a pandemic and hospitals were under orders to secure enough medical supplies and personal protective equipment, and ensure adequate staff are on hand. Read more here for the latest developments in the coronavirus outbreak.\nA proposed meeting involving the Wet'suwet'en hereditary chiefs, the federal government and the British Columbia government is set to take place today in Smithers, B.C. The chiefs' opposition to a pipeline through their traditional territory in northwest B.C. has sparked protests and rail blockades across the country.  A spokesperson for the hereditary chiefs said title and land rights of the Wet'suwet'en will be discussed at the meeting. Read here for more details.  The first deadline for entry into the Conservative leadership race passes today. Prospective candidates have to get their name in — along with the signatures of 1,000 party members and $25,000 — by 5 p.m. ET. Thus far, five people are in the race: Peter MacKay; Erin O'Toole; Leslyn Lewis; Marilyn Gladu; and Derek Sloan. As Éric Grenier writes, this list of eligible candidates is likely to grow  as others have said they plan to run. However, the contestants still have more hurdles to clear. To get their names on the ballot, the candidates must obtain the signatures of 3,000 members and submit $300,000 to the party — making this the most expensive political leadership contest in Canadian history. Read more about the leadership race here.  The Democratic race to pick a presidential nominee will hit overdrive next week with 14 states voting on what's known as Super Tuesday. CBC correspondent Alexander Panetta asked four Democratic Party insiders who have all served as ambassadors to Canada — Barack Obama's envoys, David Jacobson and Bruce Heyman, and Bill Clinton's appointees, James Blanchard and Gordon Giffin —  to share who they are picking and what their choice could mean for this country. Read more on the former ambassadors' preferred candidates here.  It appears that the hopes of astronomers who wanted a nearby star to explode have been dashed. After weeks of unprecedented dimming, Betelgeuse — a star in the constellation Orion — is beginning to brighten again. Professional and amateur astronomers had been keeping a close eye on the unusual dimming of the red supergiant star, as its brightness decreased to the lowest in recorded observational history. Some had hoped that its fading was indicative of an impending explosion, a supernova. Read more about what's happening with Betelgeuse.  Now for some good news to start your Thursday: A Canadian hockey legend will be part of a historic NHL broadcast next month. Jennifer Botterill, who won four Olympic medals with the women's national hockey team, will be part of the first all-female broadcasting crew when the Chicago Blackhawks play the St. Louis Blues on March 8, which is International Women's Day. \"I think all of us want to set an example. Not all females have to get into broadcasting in sports, but it's nice that's it's now becoming a choice,\" Botterill told CBC in a recent interview. She hopes the program, which will air on NBC, will help make all-female broadcasts a normal thing in the future. Read more about the pioneering broadcast here.\nThis week, a report revealed that the late disability advocate Jean Vanier had sexually abused at least six women. Less than a year ago, longtime Globe and Mail reporter Ian Brown wrote in Vanier's obituary how the beloved Canadian founder of L'Arche, an international network of communities for people with intellectual disabilities, would be remembered as a radical philosopher of disability. Today on Front Burner, Brown explains how the disturbing revelations have sent shock waves through the disability and Catholic communities and beyond.\n1917: Women in Ontario win the right to vote in provincial elections.   1977: Keith Richards of The Rolling Stones is arrested at the Harbour Castle Hotel in Toronto on heroin possession charges. He was eventually found guilty. In lieu of a jail sentence for Richards, the band played two benefit concerts for the Canadian National Institute for the Blind at the civic auditorium in Oshawa, Ont., in April 1979.  1997: An Ontario court grants Eaton's bankruptcy protection from its creditors. When restructuring failed, the 127-year-old department store chain was declared insolvent and liquidated in August 1999. Seven stores were bought by Sears Canada and re-opened under the Eaton's name in November 2000. They were later closed.  1998: Alan Eagleson becomes the first person expelled from the Order of Canada. The former head of the NHL players' union had pleaded guilty to fraud the previous month and was fined and sentenced to prison.  2010: Canada's men's curling team — skip Kevin Martin, third John Morris, second Marc Kennedy and lead Ben Hebert — capped an unbeaten performance at the Vancouver Olympics with a 6-3 win over Norway in the gold medal game; veteran Canadian snowboarder Jasey-Jay Anderson won gold in the parallel giant slalom.\n"}, {"author": "Nicole Mortillaro", "title": "Canadian astronomers find 8 more mysterious repeating fast radio bursts from space", "description": "Findings are important step in better understanding what's creating these powerful signals, where they're from", "url": "http://www.cbc.ca/news/technology/repeating-fast-radio-bursts-in-space-1.5249959", "urlToImage": "https://i.cbc.ca/1.5249960.1579277124!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_780/chime-telescope.jpeg", "publishedAt": ["Aug 17, 2019 4:00 AM ET", "2019-08-19T13:40:39.722Z"], "source": "CBC News", "content": "They're called fast radio bursts, or FRBs, and these odd, fleeting signals from space are shrouded in mystery. But thanks to Canada's largest radio telescope, astrophysicists are discovering more of them in their search to learn what makes these objects tick.\nThe first FRB was discovered in 2007 by an astrophysicist and his student while going through 2001 data collected from the Parkes Observatory in New South Wales, Australia. Since then, dozens more have been detected. As to what is causing these signals, scientists have yet to learn.\nBut these brief signals that are crossing the universe — and last only a millisecond or so — had another surprise: some of them repeated. \nThe first of these repeaters was discovered by McGill PhD student Paul Scholz in 2015. A second one was discovered last January. And the list is getting longer.\nIn a new study, submitted to the Astrophysical Journal Letters and pre-printed on arXiv.org, a group of Canadian scientists reveal that the Canadian Hydrogen Intensity Mapping Experiment (CHIME) telescope detected eight more repeating FRBs.\nThe findings are an important step in better understanding what is creating these powerful signals and where exactly they're coming from.\n\"The first biggest conclusion [from the paper] is that this is not an anomalous phenomenon. This is for real,\" said Victoria Kaspi, an astrophysicist at McGill University and the Canadian Institute for Advanced Research (CIFAR). \"It just takes time and patience to find them. And two, it offers the opportunity to localize them, and that's huge in the FRB field.\"\nThe CHIME instrument cannot be both sensitive and precise in its detections, which means it cannot localize the signal. Instead, its job is to find as many as it can. Determining their exact location is up to other telescopes.\nWATCH: CHIME telescope put into operation\n\"Discovering eight sources like this is so important because it says we have a lot more repeating FRBs and can figure out the environments and the galaxies these FRBs are located in if we follow them up with other telescopes,\" said Pragya Chawla, co-author of the paper and a PhD student at the McGill Space Institute.\nOf the 10 repeating FRBs, only two have been traced back to their point of origin: one is in a dwarf galaxy and the other, in a spiral galaxy. \nFRBs are a hot topic in the astronomical world, mostly because they're a fairly new discovery and the mechanism responsible isn't understood.\n\"We think we understand what's in the cosmos,\" Kaspi said. \"But fast radio bursts were a total surprise. Nobody expected them. Nobody predicted them. Really, it was technological advancements that allowed us to see this. And I think it's really interesting that we're still learning very basic things about what's going on in the universe.\"\nBecause they release such intense energy, some theories suggest that the source is a neutron star, a small dense star left over after a supernova. Another theory suggests it could be a magnetar, a star similar to a neutron star, but with an extremely powerful magnetic field.\nWhile the known FRBs — both the repeaters and apparent non-repeaters — are believed to originate in other galaxies, one of the newly detected ones seems to be closer than the others, perhaps even within our own galaxy. However, Chawla said that if it were to be found within our galaxy that \"it would be very surprising.\n\"Because we know a lot of neutron stars within our own galaxy that emit such pulses, but none of them have been seen to be found that far at the edge of our galaxy.\"\nCHIME has been quite successful in its search for these puzzling objects, but the even better news is that the telescope isn't running on full power: there's still the need to better calibrate it. Once that's done, it's expected that even more FRBs will be detected on a daily basis. And that means more data to provide other astrophysicists with the tools of unravelling their mystery.\n\"I think the upcoming year will be a really good one for FRBs,\" Kaspi said. \"Are we going to know the answer in a year's time? I don't know. I don't know. Maybe. But I think we will have made significant progress in a year.\"\n"}, {"author": "Jen O’Brien", "title": "March 2020 will be a sky-watcher's delight: An astronomer on where to catch the celestial events in Canada", "description": "Stargazers, you may want to head to these spots for March break!", "url": "http://www.cbc.ca/life/travel/march-2020-will-be-a-sky-watcher-s-delight-an-astronomer-on-where-to-catch-the-celestial-events-in-canada-1.5483573", "urlToImage": "https://i.cbc.ca/1.5483602.1583249901!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/stargazing-march-2020.jpg", "publishedAt": ["Mar 03, 2020 10:52 AM ET", "2020-03-03T15:52:28.279Z"], "source": "CBC Life", "content": "The popularity of astrotourism has skyrocketed in recent years, and Canada is a particularly great place from which to gaze toward the cosmos. \nOur country is home to the world's largest dark-sky preserve, Wood Buffalo National Park — a stretch of land larger than some countries, running from northern Alberta into the Northwest Territories. Large swaths of Canada also sit beneath the northern auroral oval, a halo of light circling the geomagnetic North Pole (yes, there is more than one North Pole), where the Northern Lights are most visible.\n\"We're pretty lucky in that most Canadians can get out of the big city into a very dark area pretty easily, so we're in a really good area for naked-eye stargazing,\" says astronomer Michael Reid, an associate professor in the University of Toronto's department of astronomy and astrophysics. \"We also have a hugely active amateur astronomy community relative to a lot of places in the world. The Royal Astronomical Society of Canada operates chapters all over the country. That means there's a lot of programming available for people who are interested in having someone guide them in how to view the sky.\"\nMarch 2020 will be an especially exciting month for stargazers, he says, with elusive planets shifting into view and aurora borealis activity potentially ramping up around the vernal equinox. \nWhile celestial observation may traditionally be associated with the summer months, Reid explains that cooler temperatures can actually make for improved viewing conditions. \"You can have this cold, dry air that just sits there, and so it gives you very clear skies,\" he says. \"You get these really crisp, clear nights that allow you to see everything.\" \nThe following heavenly March events, recommended by Reid, are worth bundling up for. Here are the best places to view them, plus places to stay if you'd like to plan a well-rounded stargazing vacation. \nThe Northern Lights – throughout March\n\"Canada is well known for being a great place to see the Northern Lights,\" says Reid. \"The idea is that particles from the sun flow toward the Earth, and they get trapped in the Earth's magnetic field, funnelled toward the poles and smash into atmosphere and light it up.\" He explains that the odds of seeing Northern Lights are higher around the vernal or spring equinox, which will fall on March 19 or 20 for countries in the northern hemisphere, when aurora activity ramps up as the magnetic fields of the sun and Earth align.\nFor a great view head to: Northern British Columbia. The Northern Lights are such a big deal in this part of the world that there's an entire festival dedicated to celebrating them, which runs from March 12 to 21 in the community of Fort Nelson. Muncho Lake Provincial Park, situated at the northern tip of the Rocky Mountains, is a particularly special place to enjoy the aurora borealis. Just off the Alaska Highway, the secluded shores of this park's namesake lake beautifully showcase the Northern Lights dancing between limestone peaks.\nSet your stargazing alarm for: The three hours before and after midnight. Reid recommends monitoring spaceweather.com, which offers live aurora updates. \nSettle in at: Northern Rockies Lodge. This lovely family-owned property on the edge of Muncho Lake is the perfect place for an adventurous stargazing retreat. Enjoy some serious comfort food at the on-site restaurant, pop into the property's wood-fired sauna, then take an invigorating snow bath to prime yourself for a night of aurora-spotting. \nThe evolution of Betelgeuse – throughout March\n\"There's this kind of neat thing going on with the star Betelgeuse,\" says Reid. \"Orion is a constellation a lot of people know; it's got this famous belt, and I think it's probably the one most people know after the Big Dipper. [Orion has] got this great, big, bright red star in it that has been bright red for as long as anyone can remember, but not anymore.\" Reid explains that what was once one of the brightest stars in the sky rapidly started dimming in December 2019. This occurrence had many astronomers speculating that it might be on the verge of going supernova. However, instead of blowing up, Betelgeuse strangely started perking up at the end of February. \nFor a great view head to: Central Ontario. While Betelgeuse is visible from nearly everywhere on Earth, Torrance Barrens Dark-Sky Preserve — made up of around 1,900 light pollution–free hectares of Crown land — is a particularly great place to study this fascinating star's transformation. Its Gravenhurst location also makes it easily accessible for Toronto-area sky-watchers.\nSet your stargazing alarm for: Anytime after sundown.\nSettle in at: JW Marriott The Rosseau Muskoka Resort & Spa. This cottage-country resort, located roughly 40 kilometres from Torrance Barrens, offers luxurious accommodations and stargazing excursions with local naturalist Robin Tapley. Tapley runs tours from the resort to both the dark-sky preserve and the Echo Valley Observatory in nearby Huntsville.\nSaturn, Mars, Jupiter and the moon together – March 18\n\"Around March 18, roughly, the moon will be crescent, and Saturn, Jupiter and Mars will all be smack-dab together in the sky in the southeast … when there are three of them together in the sky [they're] much more obvious. They're bright — much brighter than most stars — and they're … a little bit more colourful,\" says Reid. \"Mars is noticeably red, and Saturn and Jupiter are kind of more white-ish but sufficiently bright that you definitely notice that they are brighter than everything else around them.\" \nFor a great view head to: Southern Quebec. \"Mont-Mégantic National Park in Quebec [contains] probably the nation's best public-outreach telescope facility,\" says Reid. \"It's [in] a beautiful location and it's got a ton of programming.\" The Mont-Mégantic International Dark Sky Reserve is the first international dark-sky reserve to be certified by the International Dark-Sky Association and has been called one of the best places on Earth to observe the night sky. \nSet your stargazing alarm for: Just before dawn (roughly 6 a.m.).\nSettle in at: Auberge et Chalets sur le Lac. Located between 40 and 50 kilometres from Mont-Mégantic National Park, depending on which route you take, this charming lakeside property offers an Earth to the Stars package that includes a one-night stay and a ticket for an evening experience at the park's popular ASTROLab. \nMercury's greatest elongation – March 24\n\"[It's] greatest elongation is when the angle between the planet and the sun is biggest,\" Reid explains. \"It's usually quite difficult to see Mercury because it's so close to the sun … But if it's at its farthest extent away from the sun, then just after the sun dips below the horizon, Mercury will still be up and you can spot it before it also goes below the horizon, or the reverse in the morning — it will come up a little before the sun comes up.\"\nFor a great view head to: Coastal Nova Scotia. Reid recommends facing the sunrise and picking a spot with an unobstructed view. \"Nice clear views to the east make it easier to see,\" he says.\nSet your stargazing alarm for: Just before sunrise.\nSettle in at: White Point Beach Resort. With beachfront cottages looking straight out into the Atlantic, you'll be hard-pressed to find a better vantage point for viewing the sky at sunrise. In addition to offering seaside bonfires and winter surf lessons, this year-round resort also has March Break programming, which includes an outdoor journey to explore the night skies hosted by a member of the Royal Astronomical Society of Canada.\nVenus's greatest elongation – March 24\nCompared to Mercury, Reid says Venus is quite easy to spot. \"It's the sort of thing that makes people phone in UFO sightings a lot because it's so crazy bright. If you've never paid attention to it, you look at it and think, 'What on earth is that?' So it's completely unmistakable.\"\nFor a great view head to: Western Alberta. Venus will appear on the western horizon, and Jasper National Park's Dark-Sky Preserve — the second-largest dark-sky preserve in the world, measuring more than 11,000 square kilometres — is perfectly situated for observation of the shimmering refracted light of Earth's beautiful sister planet. \nSet your stargazing alarm for: Sunset.\nSettle in at: Fairmont Jasper Park Lodge. With an on-site planetarium, dark sky–friendly lighting and regular astronomical programming, this luxury mountain resort is among Canada's premier stargazing destinations. Resort guests and planetarium visitors will have access to guided virtual tours of the galaxy by an astronomy expert.\n\"If you go to these parks, you'll get spectacular sights,\" says Reid. \"One thing that's essentially impossible to see in the city is our galaxy. Most people have never seen the Milky Way, and it's glorious and wonderful. It's a huge band of light across the sky.\"\nBut Reid is quick to point out that all of the sights above, minus the Northern Lights, can be seen from just about anywhere in the country — if your view is unobstructed, you're in a sufficiently dark location and your timing is right — so staycation-ing stargazers need not be discouraged. For optimum viewing, he recommends packing binoculars on your trek, putting smartphones away, and giving your eyes at least 10 minutes to adjust to the darkness.\nJen O'Brien is an award-winning editor and freelance writer based in Toronto. Follow her @thejenobrien\n"}, {"author": "Jen O’Brien", "title": "March 2020 will be a sky-watcher's delight: An astronomer on where to catch the celestial events in Canada", "description": "Stargazers, you may want to head to these spots for March break!", "url": "http://www.cbc.ca/life/march-2020-will-be-a-sky-watcher-s-delight-an-astronomer-on-where-to-catch-the-celestial-events-in-canada-1.5483573", "urlToImage": "https://i.cbc.ca/1.5483602.1583249901!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/stargazing-march-2020.jpg", "publishedAt": ["Mar 03, 2020 10:52 AM ET", "2020-03-03T15:52:28.279Z"], "source": "CBC Life", "content": "The popularity of astrotourism has skyrocketed in recent years, and Canada is a particularly great place from which to gaze toward the cosmos. \nOur country is home to the world's largest dark-sky preserve, Wood Buffalo National Park — a stretch of land larger than some countries, running from northern Alberta into the Northwest Territories. Large swaths of Canada also sit beneath the northern auroral oval, a halo of light circling the geomagnetic North Pole (yes, there is more than one North Pole), where the Northern Lights are most visible.\n\"We're pretty lucky in that most Canadians can get out of the big city into a very dark area pretty easily, so we're in a really good area for naked-eye stargazing,\" says astronomer Michael Reid, an associate professor in the University of Toronto's department of astronomy and astrophysics. \"We also have a hugely active amateur astronomy community relative to a lot of places in the world. The Royal Astronomical Society of Canada operates chapters all over the country. That means there's a lot of programming available for people who are interested in having someone guide them in how to view the sky.\"\nMarch 2020 will be an especially exciting month for stargazers, he says, with elusive planets shifting into view and aurora borealis activity potentially ramping up around the vernal equinox. \nWhile celestial observation may traditionally be associated with the summer months, Reid explains that cooler temperatures can actually make for improved viewing conditions. \"You can have this cold, dry air that just sits there, and so it gives you very clear skies,\" he says. \"You get these really crisp, clear nights that allow you to see everything.\" \nThe following heavenly March events, recommended by Reid, are worth bundling up for. Here are the best places to view them, plus places to stay if you'd like to plan a well-rounded stargazing vacation. \nThe Northern Lights – throughout March\n\"Canada is well known for being a great place to see the Northern Lights,\" says Reid. \"The idea is that particles from the sun flow toward the Earth, and they get trapped in the Earth's magnetic field, funnelled toward the poles and smash into atmosphere and light it up.\" He explains that the odds of seeing Northern Lights are higher around the vernal or spring equinox, which will fall on March 19 or 20 for countries in the northern hemisphere, when aurora activity ramps up as the magnetic fields of the sun and Earth align.\nFor a great view head to: Northern British Columbia. The Northern Lights are such a big deal in this part of the world that there's an entire festival dedicated to celebrating them, which runs from March 12 to 21 in the community of Fort Nelson. Muncho Lake Provincial Park, situated at the northern tip of the Rocky Mountains, is a particularly special place to enjoy the aurora borealis. Just off the Alaska Highway, the secluded shores of this park's namesake lake beautifully showcase the Northern Lights dancing between limestone peaks.\nSet your stargazing alarm for: The three hours before and after midnight. Reid recommends monitoring spaceweather.com, which offers live aurora updates. \nSettle in at: Northern Rockies Lodge. This lovely family-owned property on the edge of Muncho Lake is the perfect place for an adventurous stargazing retreat. Enjoy some serious comfort food at the on-site restaurant, pop into the property's wood-fired sauna, then take an invigorating snow bath to prime yourself for a night of aurora-spotting. \nThe evolution of Betelgeuse – throughout March\n\"There's this kind of neat thing going on with the star Betelgeuse,\" says Reid. \"Orion is a constellation a lot of people know; it's got this famous belt, and I think it's probably the one most people know after the Big Dipper. [Orion has] got this great, big, bright red star in it that has been bright red for as long as anyone can remember, but not anymore.\" Reid explains that what was once one of the brightest stars in the sky rapidly started dimming in December 2019. This occurrence had many astronomers speculating that it might be on the verge of going supernova. However, instead of blowing up, Betelgeuse strangely started perking up at the end of February. \nFor a great view head to: Central Ontario. While Betelgeuse is visible from nearly everywhere on Earth, Torrance Barrens Dark-Sky Preserve — made up of around 1,900 light pollution–free hectares of Crown land — is a particularly great place to study this fascinating star's transformation. Its Gravenhurst location also makes it easily accessible for Toronto-area sky-watchers.\nSet your stargazing alarm for: Anytime after sundown.\nSettle in at: JW Marriott The Rosseau Muskoka Resort & Spa. This cottage-country resort, located roughly 40 kilometres from Torrance Barrens, offers luxurious accommodations and stargazing excursions with local naturalist Robin Tapley. Tapley runs tours from the resort to both the dark-sky preserve and the Echo Valley Observatory in nearby Huntsville.\nSaturn, Mars, Jupiter and the moon together – March 18\n\"Around March 18, roughly, the moon will be crescent, and Saturn, Jupiter and Mars will all be smack-dab together in the sky in the southeast … when there are three of them together in the sky [they're] much more obvious. They're bright — much brighter than most stars — and they're … a little bit more colourful,\" says Reid. \"Mars is noticeably red, and Saturn and Jupiter are kind of more white-ish but sufficiently bright that you definitely notice that they are brighter than everything else around them.\" \nFor a great view head to: Southern Quebec. \"Mont-Mégantic National Park in Quebec [contains] probably the nation's best public-outreach telescope facility,\" says Reid. \"It's [in] a beautiful location and it's got a ton of programming.\" The Mont-Mégantic International Dark Sky Reserve is the first international dark-sky reserve to be certified by the International Dark-Sky Association and has been called one of the best places on Earth to observe the night sky. \nSet your stargazing alarm for: Just before dawn (roughly 6 a.m.).\nSettle in at: Auberge et Chalets sur le Lac. Located between 40 and 50 kilometres from Mont-Mégantic National Park, depending on which route you take, this charming lakeside property offers an Earth to the Stars package that includes a one-night stay and a ticket for an evening experience at the park's popular ASTROLab. \nMercury's greatest elongation – March 24\n\"[It's] greatest elongation is when the angle between the planet and the sun is biggest,\" Reid explains. \"It's usually quite difficult to see Mercury because it's so close to the sun … But if it's at its farthest extent away from the sun, then just after the sun dips below the horizon, Mercury will still be up and you can spot it before it also goes below the horizon, or the reverse in the morning — it will come up a little before the sun comes up.\"\nFor a great view head to: Coastal Nova Scotia. Reid recommends facing the sunrise and picking a spot with an unobstructed view. \"Nice clear views to the east make it easier to see,\" he says.\nSet your stargazing alarm for: Just before sunrise.\nSettle in at: White Point Beach Resort. With beachfront cottages looking straight out into the Atlantic, you'll be hard-pressed to find a better vantage point for viewing the sky at sunrise. In addition to offering seaside bonfires and winter surf lessons, this year-round resort also has March Break programming, which includes an outdoor journey to explore the night skies hosted by a member of the Royal Astronomical Society of Canada.\nVenus's greatest elongation – March 24\nCompared to Mercury, Reid says Venus is quite easy to spot. \"It's the sort of thing that makes people phone in UFO sightings a lot because it's so crazy bright. If you've never paid attention to it, you look at it and think, 'What on earth is that?' So it's completely unmistakable.\"\nFor a great view head to: Western Alberta. Venus will appear on the western horizon, and Jasper National Park's Dark-Sky Preserve — the second-largest dark-sky preserve in the world, measuring more than 11,000 square kilometres — is perfectly situated for observation of the shimmering refracted light of Earth's beautiful sister planet. \nSet your stargazing alarm for: Sunset.\nSettle in at: Fairmont Jasper Park Lodge. With an on-site planetarium, dark sky–friendly lighting and regular astronomical programming, this luxury mountain resort is among Canada's premier stargazing destinations. Resort guests and planetarium visitors will have access to guided virtual tours of the galaxy by an astronomy expert.\n\"If you go to these parks, you'll get spectacular sights,\" says Reid. \"One thing that's essentially impossible to see in the city is our galaxy. Most people have never seen the Milky Way, and it's glorious and wonderful. It's a huge band of light across the sky.\"\nBut Reid is quick to point out that all of the sights above, minus the Northern Lights, can be seen from just about anywhere in the country — if your view is unobstructed, you're in a sufficiently dark location and your timing is right — so staycation-ing stargazers need not be discouraged. For optimum viewing, he recommends packing binoculars on your trek, putting smartphones away, and giving your eyes at least 10 minutes to adjust to the darkness.\nJen O'Brien is an award-winning editor and freelance writer based in Toronto. Follow her @thejenobrien\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/artsprojects/the2010s_dev2/10-of-the-decades-most-influential-movies-that-happened-to-shoot-in-canada", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/artsprojects/the2010s/10-of-the-decades-most-influential-movies-that-happened-to-shoot-in-canada", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/artsprojects/the2010s_dev/10-of-the-decades-most-influential-movies-that-happened-to-shoot-in-canada", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Michael de Adder opens up about being dumped by N.B. newspapers after viral Trump cartoon", "description": "The Canadian cartoonist says he's long been told Trump is a 'taboo' subject for the Irving-owned chain", "url": "http://www.cbc.ca/radio/asithappens/as-it-happens-monday-edition-1.5196196/michael-de-adder-opens-up-about-being-dumped-by-n-b-newspapers-after-viral-trump-cartoon-1.5196199", "urlToImage": "https://i.cbc.ca/1.5023108.1550425922!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/michael-de-adder.JPG", "publishedAt": ["Jul 01, 2019 3:37 PM ET", "2019-07-03T21:12:56.645Z"], "source": "CBC Radio", "content": "Update: After this story was published, the cartoonist set to replace Michael de Adder in Brunswick News papers, announced he will no longer work with the news agency. He confirmed to CBC News that he was offered the job weeks before de Adder published his Trump cartoon. \nRead Story Transcript\nCanadian editorial cartoonist Michael de Adder says he'll have a lot more editorial freedom now that he's no longer writing for a group of Irving-owned New Brunswick newspapers.\nDe Adder's freelance contract with Brunswick News Inc. (BNI) was terminated days after he shared a viral cartoon depicting U.S. President Donald Trump playing golf next to the face-down bodies of two Salvarodian migrants.\nThe cartoon was based on the devastating photo by Julia Le Duc of Oscar Alberto Martínez Ramírez and his young daughter, Valeria, who drowned in the Rio Grande while trying to cross into Brownsville, Texas.\nBNI says cutting ties with de Adder had nothing to do with the Trump cartoon. The news organization is owned by the province's Irving family, which owns a myriad of companies with ties to U.S. trade, including Irving Oil and Irving Shipbuilding.\nDe Adder says he finds it hard to believe it's just a coincidence he was fired so soon after publishing what he says is the most successful cartoon of his career. \nHere is part of his conversation with As It Happens guest host Susan Bonner.\nThe company that owns these newspapers, Brunswick News, says that ending your contract has nothing to do with that cartoon of Donald Trump. Do you buy that?\nIn the 17 years I was with the company, there wasn't a single [scheduled day] that one of my cartoons wasn't in a paper in New Brunswick. \nIt was difficult to work for. There were taboo subjects that you couldn't touch. And oftentimes you wouldn't find out what those taboo subjects were until after you drew them at least twice. You got the idea after you were axed on the same subject twice.\nWhen you say \"axed,\" you mean that you submit a cartoon and it's rejected?\nYeah, it's rejected.\nIn one year, I decided I'd count how many times I was axed, just to entertain myself, and I was axed 54 times in one year. And for each one of those cartoons that I was axed, I replaced it. So, I mean, I always did my job and I did it well.\nOne of the biggest bones of contention — the only subject, actually, that I know was taboo and I was told — was Donald Trump.\nYou issued [this Trump cartoon] on social media.\nI knew that it was going to be another viral cartoon, but I didn't expect it to go as viral as it did. And it sort of went supernova.\nFor the next 24 hours, I thought, \"Wow, this is crazy. I'm having the day that cartoonists dream of.\"  And Friday, you know, just 24 hours after it appeared, I got a call from the guy [at BNI] that I deal with every day, who I had a good relationship with, and he told me I was fired.\nI asked why, and he didn't give me a reason.\nI said, \"Is it costs?\"\nAnd he goes, \"No.\"\nAnd I said, \"Is it gross incompetence?\" \nAnd he goes, \"No.\" \nAnd I go, \"Is it in my online presence?\" — which I was really suspecting, because I was in the middle of one of the best two days of my career.\nHe said, \"No.\"\nBut in the past 2 weeks I drew 3 Trump cartoons. 2 went viral and the third went supernova and a day later I was let go. And not only let go, the cartoons they already had in the can were not used. Overnight it was like I never worked for the paper. Make your own conclusions.\n \nWhen you say your online presence, do you mean that specific cartoon?\nMy online, anti-Trump presence, to put it as simply as I possibly can.\nIt seemed like the most logical thing, considering what was going on.\nI stand by the fact that I've spent a career not biting the hand that feeds me or the hand that fed me. And I don't know, now I'm in a battle I didn't want or didn't expect.\nThe company issued a statement. ...  It says, \"This is a false narrative which has emerged carelessly and recklessly on social media. In fact, BNI was not even offered this cartoon.\"\nWell, that's true. I didn't want to poke the bear and offer Donald Trump cartoons, especially that one.\nI'm always a little bit hesitant to post, you know, the harder-hitting Trump cartoons for fear that one of my papers might not like it.\nPlease see the attached statement issued today by Brunswick News Inc. regarding incorrect information on social media about BNI's freelance contract with cartoonist Michael de Adder. <a href=\"https://t.co/173SSPMJYs\">pic.twitter.com/173SSPMJYs</a>\nWhat was it about the Trump cartoons that you think the paper didn't like? \nThe company I worked for, you know, has a vested interest in this. I don't know. You know, I'm about to go into speculation and the truth is I really don't know.\nBut I do know that the clearest and biggest contention I've had with the paper — because the rest of all the hot-button topics were never discussed with me — was Donald Trump. That was the one clear thing I was always told. There are issues with drawing the president.\nYou tweeted, \"I wanted to do my job as an editorial cartoonist and they wanted me to do their job.\" What does that mean?\nThe truth of the matter is maybe I didn't [always] play ball with the first cartoon, but I filled it with another one that certainly played ball. So I did my job.\nBut I also tried to do my job as an editorial cartoonist. I really feel like I bridged that gap for 17 years. \nSeventeen years, I never had a cartoon space not filled. I had hundreds of cartoons axed, but I never had a cartoon space not filled.\nBNI goes on to say that the organization wanted to bring back another cartoonist, \"reader favourite Greg Perry.\" What do you make of that?\nWe cartoonists are sort of a brotherhood. I'm not going to attack another cartoonist. I will question \"reader favourite.\" I mean, it should say \"Irving favourite.\" The reader favourite, they fired.\nWhat do you think the Irvings expected from you?\nThey expected me to toe [the] company line. \nAnd what is the company line?\nThe company line is the bottom line. That's it. \nShould somebody that cares about the bottom line own a newspaper? Should someone that basically owns most of New Brunswick own a newspaper? Should a company that at least a quarter of the stories pertain to them be in control of the print source that supplies New Brunswick with the news?\nDonald Trump and me being fired is not the issue here. The issue is media control and media manipulation.\nI'll move on. I'll get another job. I'm not angry with the Irvings. I'm a frog trying to cross that water with a scorpion on their back — and I knew that 17 years ago, and I know it now.\nI'm not bitter about it. You know, the frog is not bitter. You know, the scorpion says, \"It's in my nature to do that.\" And I knew that.\nYou've got a lot of family and friends [in New Brunswick] and they won't see your cartoons anymore in their daily newspapers. \nMy mother has dementia and she doesn't really remember her sons sometimes or gets them mixed up.\nBut for whatever reason, dementia patients get something in their head and they remember this one thing. And she remembers that her son draws cartoons. And part of her routine is to go down and read the paper every day and, you know, see my cartoon.\nAnd that's the hardest part. She won't have that. I'm kind of hoping that the people around her will tell her the Greg Perry cartoon is actually mine.\nDo you have any regrets, Michael, about that cartoon?\nWell, no. That's my only regret — friends and family not seeing the cartoon and my mother.\nOther than that, my cartoons will be better. I feel like I just took the yoke off, you know. I don't have to stop and I don't have to worry about drawing not just one cartoon, but sometimes two cartoons a day,  just for them.\nIf it wasn't for the stress of having to do all this media, I mean, I'd be probably be wishing this had happened before.\nWritten by Sheena Goodyear with files from CBC News. Produced by Kate Swoger. Q&A has been edited for length and clarity.\n"}]