[{"source": "Bloomberg", "author": null, "title": "'Interest rates are going to stay very benign': McCreath", "description": "The Federal Reserve released Wednesday morning that they will not introduce negative interest rates. Andrew McCreath joins BNN Bloomberg to weigh in on this news saying that he is \"strongly against\" negative interest rates and thinks the rates won't change drastically from this point onward. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_5_13_e6860f79-baa8-41c5-a0b4-43c8431f2322_jpg_980x551.jpg", "PublishedAt": "2020-05-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "Fed's Powell expected to discuss negative interest rates", "description": "Federal Reserve Chair Jerome Powell is expected to address the potential for negative interest rates when he delivers remarks Wednesday morning. Bloomberg News' Senior Economist Yelena Shulyateva has more.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_5_13_78f15419-8ee1-499f-9e48-2182702e8ae9_jpg_980x551.jpg", "PublishedAt": "2020-05-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "Janus' Maroutsos Says ECB Can 'Talk a Good Game,' Can't Match the Fed", "description": "May.01 -- Nick Maroutsos, Janus Henderson co-head of global bonds, says the Federal Reserve is responding to the economic fallout from the coronavirus pandemic better than the European Central Bank. He speaks with Bloomberg's Scarlet Fu and Romaine Bostick on \"Bloomberg Markets: The Close.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_5_1_374f6132-24f8-4ef2-985b-95569e48eed2_jpg_640x359.jpg", "PublishedAt": "2020-05-01", "content": null}, {"source": "Bloomberg", "author": null, "title": "ECB Announces New Pandemic Refinancing for Banks", "description": "Apr.30 -- The European Central Bank intensified its response to the coronavirus crisis, cheapening the cost of its emergency lending program for banks and unveiling a further facility to inject liquidity in the economy. Bloomberg's Mike McKee reports on \"Bloomberg Daybreak: Americas.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_30_ae12bfe7-19bf-4fc4-beff-09072b2737c0_jpg_640x359.jpg", "PublishedAt": "2020-04-30", "content": null}, {"source": "Bloomberg", "author": null, "title": "Fed holds key rate, warns of severe virus impact", "description": "Bob Iaccino, chief market strategist at Path Trading Partners discusses the latest move by the U.S. Federal Reserve with BNN Bloomberg. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_29_983d6f18-3ee1-41fe-8feb-ea6fff4a9fe8_png_755x414.jpg", "PublishedAt": "2020-04-29", "content": null}, {"source": "Bloomberg", "author": null, "title": "What to Expect From the Fed and ECB This Week", "description": "Apr.27 -- Michael Kushma, Morgan Stanley Investment Management global fixed-income chief investment officer, and Bloomberg's Mike McKee preview this week's policy decisions by the Federal Reserve and European Central Bank. They speak with Bloomberg's Alix Steel on \"Bloomberg Daybreak: Americas.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_27_e9798010-fd82-4c1f-b97c-1c217392436b_jpg_640x359.jpg", "PublishedAt": "2020-04-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Greater monetary intervention now could put a floor in: Economist", "description": "David Doyle, economist and market strategist at Macquarie Group discusses the latest open-market interventions by the Bank of Canada, including the planned provincial and corporate bond purchases, as well as the efficacy of monetary policy tools it has available. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_16_8eca1895-417a-4c60-a210-34a36b22cbe0_jpg_980x551.jpg", "PublishedAt": "2020-04-15", "content": null}, {"source": "Bloomberg", "author": null, "title": "BoC bond buying is a clever move: CIBC chief economist  ", "description": "The Bank of Canada is pulling out some new weapons worth 10’s of billions of dollars in the fight to help support an economy that’s being battered in the fallout from COVID-19. The bank is buying provincial and corporate bonds in a move that Avery Shenfeld, chief economist at CIBC Capital Markets describes as \"clever\".  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_15_842b8502-2bb2-480b-97f4-24baf5aa2a74_jpg_980x551.jpg", "PublishedAt": "2020-04-15", "content": null}, {"source": "Bloomberg", "author": null, "title": "Don't expect a Bank of Canada rate cut tomorrow: BMO Capital Markets  ", "description": "Benjamin Reitzes, Canadian rates and macro strategist at BMO Capital Markets explains why he's not anticipating another rate cut at the Bank of Canada tomorrow, and what we can expect to hear concerning economic growth projections. He says  the bank might just choose to publish annual figures in an effort to not sound too downbeat. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_14_a7ca7a88-63cb-4122-9054-8a6a35a9c72e_jpg_980x551.jpg", "PublishedAt": "2020-04-14", "content": null}, {"source": "Bloomberg", "author": null, "title": "The Long-Term Impact of Coronavirus on the Global Economy", "description": "Apr.02 -- Oscar Jorda, senior policy advisor at San Francisco Federal Reserve, discusses how the Covid-19 pandemic could impact the global economy in the long term. He speaks on “Bloomberg Daybreak: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_2_0012d713-99b4-420e-bbc6-3d5092004670_jpg_640x360.jpg", "PublishedAt": "2020-04-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Risk of negative interest rates low: Scotiabank", "description": "Scotiabank VP and head of capital markets Derek Holt says the Bank of Canada sets an exceptionally high bar for needing a negative interest rate policy and added that the current financial measures will lead to the least painful exit to the crisis.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_27_6b083d56-adb0-47dd-b587-e4459037d2a8_PNG_1010x535.jpg", "PublishedAt": "2020-03-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Another emergency rate cut at the Bank of Canada  ", "description": "The Bank of Canada has announced another emergency rate cut, along with quantitative easing which includes the buying of bonds and commercial paper. Frances Donald, chief economist at Manulife Investment Management, says the real aim of the action is to not try to prevent a recession, but rather ensure Canada's financial markets can function properly. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_27_d6832da2-3011-4061-a282-9c5927d91329_jpg_980x551.jpg", "PublishedAt": "2020-03-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Canada's big banks 'doing great work' amid COVID-19 pandemic: Poloz ", "description": "Bank of Canada Governor Stephen Poloz said Canada's big lenders are doing \"great work\" keeping the credit channels open in wake of the COVID-19 crisis. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_27_0edc9fde-62d1-4944-944f-b6479f8bb40c_png_755x420.jpg", "PublishedAt": "2020-03-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Bank of Canada cuts key rate to 0.25% as virus fallout deepens ", "description": "The Bank of Canada cuts its benchmark interest rate by 50 basis points to 0.25 per cent in an unscheduled decision Friday. The central bank said the move comes as the COVID-19 outbreak is having \"serious consequences\" for the Canadian economy, and signals that the bank is doing all it can to support Canadians. BNN Bloomberg's Jon Erlichman and Paul Bagnell discuss.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_27_41cc27e1-b92a-499c-9fa3-50f711bbe83b_jpg_980x551.jpg", "PublishedAt": "2020-03-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "China’s Loan Prime Rates Unexpectedly Unchanged in March", "description": "Mar.19 -- Michelle Lam, Greater China economist at Societe Generale, discusses China’s loan prime rate and what it means for the economy. She speaks on “Bloomberg Markets.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_19_479ff455-19a0-462a-b7ea-787a1dee2f88_jpg_640x359.jpg", "PublishedAt": "2020-03-19", "content": null}, {"source": "Bloomberg", "author": null, "title": "RBA to Take Extraordinary Measures", "description": "Mar.18 -- The Reserve Bank of Australia will hold an emergency meeting this afternoon with an emergency rate cut and unconventional measures set to be deployed. Bloomberg’s Paul Allen reports on “Bloomberg Daybreak: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_18_25386512-8bc4-4a21-9572-52eaab2f5e58_jpg_640x359.jpg", "PublishedAt": "2020-03-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "ECB Mulls Revisiting its QE Limits", "description": "Mar.18 -- ECB policy makers are saying they will consider revising quantitative easing limits and are looking at a 750 billion-euro Pandemic Emergency Purchase Program. Bloomberg’s Rosalind Mathieson reports on “Bloomberg Daybreak: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_18_d0f8b522-8e2d-43f2-81d4-f7358a714561_jpg_640x359.jpg", "PublishedAt": "2020-03-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "Philippine Central Bank Inclined to Cut by 50 BPS: Governor", "description": "Mar.16 -- Bangko Sentral ng Pilipinas Governor Benjamin Diokno discusses how the central bank and the government are trying to protect the Philippine economy amid the coronavirus outbreak. Diokno said Monday the bank will consider cutting its key interest rate by as much as a half-percentage point at its regularly scheduled meeting this Thursday. He speaks on \"Bloomberg Markets: Asia.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_17_e868ad57-2013-4dd5-af3c-d5e70ea8e9ae_jpg_640x359.jpg", "PublishedAt": "2020-03-16", "content": null}, {"source": "Bloomberg", "author": null, "title": "Low interest rates making simple investing difficult: Veritas CEO", "description": "Anthony Scilipoti, president and CEO at Veritas Investment Research discusses how investors should approach the markets with volatility caused by the coronavirus pandemic and now interest rates approaching zero.\n ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_16_a0d7bd00-8bc5-4825-a34a-30d3ca41fef9_png_740x415.jpg", "PublishedAt": "2020-03-16", "content": null}, {"source": "Bloomberg", "author": null, "title": "Virus Causing 'Severe' Situation in Norway, Norges Bank Governor Says", "description": "Mar.13 -- Norges Bank Governor Oystein Olsen discusses the impact of the coronavirus outbreak on Norway's economy with Bloomberg's Alix Steel and Bloomberg Opinion's Brooke Sutherland on \"Bloomberg Daybreak: Americas.\" Sutherland's opinions are her own.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_13_b5f0e64f-bf59-4f5c-8e7c-3929a5c8df5b_jpg_640x359.jpg", "PublishedAt": "2020-03-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "COVID-19 to create 'a big hole' in the economy: Former BoC Governor  ", "description": "BNN Bloomberg speaks to former Bank of Canada Governor David Dodge, who served during the SARS epidemic, on his economic outlook for the country amid the outbreak. Dodge notes he expects more rate cuts from the BoC and likely sees the virus weighing on the economy until the end of the year. \n ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_13_5f9f4d0d-f476-42ae-be4a-4ac2ae366b17_png_758x416.jpg", "PublishedAt": "2020-03-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "Lagarde Hails ECB's `Surgical' Support for Economy Amid Virus", "description": "Mar.12 -- European Central Bank President Christine Lagarde says the ECB has the \"most efficient, best targeted and most focused set of tools to address the kind of risks that we are facing under the current circumstances.\" Lagarde made the comments in response to questions by Bloomberg's Piotr Skolimowski during the ECB's monetary policy press conference in Frankfurt. Earlier on Thursday, policy makers unveiled a calibrated package of measures aimed at “surgically” supporting key parts of the euro-area economy hurt by the coronavirus outbreak.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_12_9d60d7be-bbe7-454d-a9cf-eede0950e0bd_jpg_640x359.jpg", "PublishedAt": "2020-03-12", "content": null}, {"source": "Bloomberg", "author": null, "title": "Lagarde Calls for Coordinated Fiscal Response Amid `Major Shock' of Virus", "description": "Mar.12 -- European Central Bank President Christine Lagarde says an \"ambitious and coordinated fiscal policy response is required to support businesses and workers at risk\" as the deadly coronavirus continues to spread throughout Europe. Lagarde made the comments during the opening statement of the ECB's monetary policy press conference in Frankfurt.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_12_5d54c984-6834-4ae0-9545-a85e689a7018_jpg_640x359.jpg", "PublishedAt": "2020-03-12", "content": null}, {"source": "Bloomberg", "author": null, "title": "El-Erian Calls ECB Stimulus Package 'Encouraging'", "description": "Mar.12 -- Mohamed El-Erian, chief economic adviser at Allianz and a Bloomberg Opinion columnist, reacts to the European Central Bank's decision to leave interest rates unchanged while boosting quantitative easing and liquidity tools. He speaks with Bloomberg’s Jonathan Ferro on \"Bloomberg The Open.\" His opinions are his own.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_12_880f3c18-e5a5-4449-95ce-4989d1893c5c_jpg_640x359.jpg", "PublishedAt": "2020-03-12", "content": null}, {"source": "Bloomberg", "author": null, "title": "Cutting Rates Isn’t Going to Ease Public Fear: AllianceBernstein’s Zeng", "description": "Mar.11 -- Jenny Zeng, co-head of APAC fixed income at AllianceBernstein, discusses the spread of coronavirus and what governments are doing to help stop the virus. She speaks on “Bloomberg Daybreak: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_11_ca608ee1-a947-441b-92fc-7446924e2ae0_jpg_640x359.jpg", "PublishedAt": "2020-03-11", "content": null}, {"source": "Bloomberg", "author": null, "title": "BOE Cuts Rates 50 Basis Points to 0.25%", "description": "Mar.11 -- The Bank of England cut its bank rates by 50 basis points in a surprise move. Bloomberg MLIV’s Mark Cudmore discusses the move on “Bloomberg Markets: European Open.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_11_a9f9deee-3868-4304-8290-b081f71f7113_jpg_640x359.jpg", "PublishedAt": "2020-03-11", "content": null}, {"source": "Bloomberg", "author": null, "title": "Expecting more rate cuts at the Bank of Canada ", "description": "Philip Petursson, chief investment strategist at Manulife Investment Management, says the big plunge in oil raises the chances of a recession in Canada.  He expects the Bank of Canada to cut rates again by at least 50-basis points next month. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_10_0b69bb16-022d-4374-80c7-e546480ebf46_jpg_980x551.jpg", "PublishedAt": "2020-03-10", "content": null}, {"source": "Bloomberg", "author": null, "title": "Jobs growth data ahead of the virus scare", "description": "Brian DePratto, senior economist at TD Bank Group, digs into the latest Canadian jobs report and explains why there's no celebrating over the stronger-than-anticipated jobs growth.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_6_50d03a58-57ec-45cc-9c09-93f5306ec019_jpg_1280x720.jpg", "PublishedAt": "2020-03-06", "content": null}, {"source": "Bloomberg", "author": null, "title": "U.S. Rates Are Going to Go Aggressively Lower: Rabobank’s Foley", "description": "Mar.06 -- Jane Foley, head of FX strategy at Rabobank, discusses the Fed’s surprise interest rate cut and if they will cut further. She speaks on “Bloomberg Daybreak: Europe.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_6_ff8e9859-c370-433f-ade0-12b611aeb5d2_jpg_640x359.jpg", "PublishedAt": "2020-03-06", "content": null}, {"source": "Bloomberg", "author": null, "title": "Canada's banks cut prime rates", "description": "Each of Canada's big five banks have cut their prime lending rates by 50-basis-points, mirroring the cut made by the Bank of Canada. The reduced prime rates will translate into lower variable-mortgage rates and may add fuel to the fire of Canada's hot housing market. Bloomberg News' Doug Alexander reports. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_5_646a8012-98b0-40da-b499-eb6af0f2ae3e_jpg_980x551.jpg", "PublishedAt": "2020-03-05", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market selling resumes as virus spreads ", "description": "The volatile ride in equity markets continues with stocks trading sharply lower in the U.K. and Europe as the coronavirus continues to spread. Marc Ostwald, strategist and chief economist at ADM Investor Services International Limited, offers perspective on the big u-turn from yesterday, and whether central bank rate cuts will have much impact. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_5_9435d0cd-c107-4d35-87e2-7e01c1257827_png_754x419.jpg", "PublishedAt": "2020-03-05", "content": null}, {"source": "Bloomberg", "author": null, "title": "Big banks slash prime lending rate in wake of Poloz's cut ", "description": "Karl Berger, senior wealth consultant and director at Cidel Asset Management, discusses the move by the big banks to cut their prime lending rates after the Bank of Canada lowered its benchmark rate Wednesday.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_5_0cef1f67-284c-4179-a69b-f09d85f57e1f_png_755x412.jpg", "PublishedAt": "2020-03-05", "content": null}, {"source": "Bloomberg", "author": null, "title": "'We are living through history': Manulife's Donald on Bank of Canada rate cut", "description": "Manulife Investment Management chief economist Frances Donald says the Bank of Canada's Wednesday decision to cut its benchmark rate 50 basis points, a day after an emergency cut by the Federal Reserve, sets a precedent for how central banks react during crises.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_4_7947e1b9-7347-4fb0-b9da-c83e06eadc38_png_763x426.jpg", "PublishedAt": "2020-03-04", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stocks bounce after Fed surprise", "description": "U.S. markets are overdue for a rebound in the wake of the U.S. Federal Reserve’s emergency cut to its benchmark interest rate, according to Bloomberg News’ Kriti Gupta.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_4_7098faa2-a41d-436a-b131-874a576eca6b_jpg_620x349.jpg", "PublishedAt": "2020-03-04", "content": null}, {"source": "Bloomberg", "author": null, "title": "Don't expect the ECB to follow the Fed: Economist", "description": "Kallum Pickering, senior economist at Berenberg Bank, says yesterday's rate cut by the U.S. Federal Reserve \"smacks a little of panic\" and he does not expect the European Central back to follow the Fed.  He says the Bank of England may cut, but the ECB is a more difficult case because it already has negative rates.  He says it would take a big deterioration in the economy in order for the ECB to make a move. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_4_79dbc489-0792-4de8-99e7-8b226778c018_png_766x423.jpg", "PublishedAt": "2020-03-04", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stocks bounce after Fed's surprise rate cut", "description": "Global stocks have made big gains as investors scramble to understand what the U.S. Fed’s surprise rate cut means to the global economy – and their portfolios. Bloomberg News' Andrew Cinko discusses.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_4_11cc83c3-a769-420f-b03a-f94c2a3b8dff_jpg_620x349.jpg", "PublishedAt": "2020-03-04", "content": null}, {"source": "Bloomberg", "author": null, "title": "Depth of Fed's rate cut may have spooked the markets: BTIG", "description": "U.S. equities couldn't hold on to initial gains in the wake of the U.S. Fed's emergency rate cut, in spite of the prospect of the cheap money ride continuing for equity investors. For perspective on this and why she thinks the depth of the 50 basis point cut may have spooked the markets, BNN Bloomberg spoke with Holly Liss of BTIG.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_174b38ca-c770-47c9-99f8-99424caebca2_jpg_620x349.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Powell Says Fed Will Never Consider Politics When Making Decisions", "description": "Mar.03 -- Federal Reserve Chairman Jerome Powell says politics will never play a role in policy decisions. His comments come during a news conference in Washington about the Federal Open Market Committee's decision to lower the target range for the federal funds rate by a half-percentage point.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_75c7649b-e2e1-4753-91ce-b2721720e7af_jpg_640x359.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Powell Says FOMC Judged That Risks to Outlook Changed Materially", "description": "Mar.03 -- Federal Reserve Chairman Jerome Powell delivers a statement on the Federal Open Market Committee's decision to lower the target range for the federal funds rate by a half-percentage point.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_3dc729d3-af59-4231-8913-82c91b9bd906_jpg_640x359.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "U.S. Fed announces emergency rate cut", "description": "The U.S. Federal Reserve has announced an emergency rate cut of 50-basis points to try to counter the economic fallout from the spreading coronavirus. Tim Quinlan, senior economist at Wells Fargo Securities has instant analysis of decision and says this won't be the first cut by the Fed. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_c824db57-10d3-46a9-ad5e-570460de1202_jpg_980x551.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Fed emergency rate cut a 'necessary move': Rosenberg ", "description": "David Rosenberg, chief economist and strategist at Rosenberg Research and Associates, says  the U.S. Federal Reserve’s surprise move to cut interest rates by 50 basis points was “necessary” and it may not be done cutting amid the rapid spread of COVID-19. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_44158e2a-d3d3-41a6-b083-b3d507261dea_jpg_980x551.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "U.S. Fed makes emergency rate cut", "description": "The U.S. Federal Reserve delivered an emergency half-percentage point interest rate cut Tuesday in a bid to protect the longest-ever economic expansion from the spreading coronavirus. Bloomberg News’ Theo Argitis reports.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_6bf77f63-045a-4986-aaef-14381f2b98e7_jpg_980x551.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "How to assess risk while stocks are on a wild ride", "description": "David Lebovitz, global market strategist at J.P. Morgan Asset Management, talks portfolio strategy on how he assesses risk in stocks that are on a wild ride, and why he expects a more sustainable bid for equities over the next couple of weeks.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_128db47f-22ea-4433-9ce5-c9bc0aff2344_png_738x416.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Temper your enthusiasm over yesterday's rally: Rabobank strategist", "description": "North American stock markets roared back with sharp gains yesterday, but Christian Lawrence, senior market strategist at Rabobank, says don't expect the rally to hold. He believes it's still a case of \"sell the bounce rather than buy the dip.\" Lawrence also offers perspective on the G7 statement which stopped short of spelling out specific measures they may take to help steady economies as the coronavirus spreads.  \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_f4d0f343-be61-437c-b8c8-46cdf6f6e383_png_759x427.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Newton IM’s Flood Is Adding to Positions in Gold", "description": "Mar.03 -- Paul Flood, multi-asset portfolio manager at Newton Investment Management, discusses his thoughts on gold and central bank action to counter the impact of coronavirus. He speaks on “Bloomberg Daybreak: Europe.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_3_c090e438-7018-4ac8-93f4-61516fd1edf3_jpg_640x359.jpg", "PublishedAt": "2020-03-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "RBA Cuts Key Interest Rate to 0.50%", "description": "Mar.02 -- Garreth Innes, head of Australian fixed income at Aberdeen Standard Investments, talks about the country's monetary and fiscal policies, the local currency and bonds. Australia’s central bank validated the money market’s late swing, easing interest rates in an effort to cushion the blow from China’s economic slowdown and associated coronavirus fallout. Innes speaks with Paul Allen and Haslinda Amin on \"Bloomberg Markets.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_2_26dd5fb4-3ebc-4957-941a-b82c343294e7_jpg_640x359.jpg", "PublishedAt": "2020-03-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Fed Reluctant to Do an Emergency Cut, Says Julius Baer’s Matthews", "description": "Mar.02 -- Mark Matthews, managing director and head of Asia Research at Bank Julius Baer & Co. Ltd, discusses potential action by the Fed to counter the impact of coronavirus on markets. He speaks on “Bloomberg Markets: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_2_73e76cde-347c-4a38-86e2-70a7ebcf6f60_jpg_640x359.jpg", "PublishedAt": "2020-03-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Market panic should lead to rate cut: RBC", "description": "Dawn Desjardins, deputy chief economist at RBC, says plunging stock markets and tumbling oil have given the Bank of Canada a good reason to cut interest rates this week.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_2_df36d86f-4679-41d0-9613-f5ed50e1ca93_png_757x421.jpg", "PublishedAt": "2020-03-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Central banks fuel stimulus hope as virus fears mount", "description": "Global stock markets showed signs of resilience Monday following crushing declines last week, after some central banks vowed to ensure stability as fears over the coronavirus mount. Jeff Hull, senior financial advisor at Manulife Securities, discusses.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_2_a7f2c4ed-dbf7-4dda-abdb-5671b3fee796_png_740x417.jpg", "PublishedAt": "2020-03-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Any Equity Market Rally Will Be Short Lived, Says Quilvest’s Parker", "description": "Mar.02 -- Bob Parker, investment committee member at Quilvest Wealth Management, discusses the bounce in equity markets and the possible reasons for the uptick. He speaks on “Bloomberg Markets: European Open.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_2_feb36c23-d824-4ebe-ab4e-a4e31f6b82e3_jpg_640x359.jpg", "PublishedAt": "2020-03-02", "content": null}]