[{"source": "Bloomberg", "author": null, "title": "Stock markets looking past historic job losses: Bill Harris ", "description": "Bill Harris, partner and portfolio manager at Avenue Investment Management, gives us his take on the early jump in stocks after news of historic job losses in Canada and the United States. He also talks market strategy that includes a focus on what he says are essential businesses that stay open during these uncertain times. His picks include BCE and CP Rail.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_5_8_1ecac132-f953-4365-9ccb-ff42e1acdaa5_jpg_980x551.jpg", "PublishedAt": "2020-05-08", "content": null}, {"source": "Bloomberg", "author": null, "title": "Questioning the health of the stock market rally ", "description": "Stocks have rallied sharply off their March lows but Liz Ann Sonders, chief investment strategist at Charles Schwab says there's good reason to be skeptical. Sonders says neither market breadth nor leadership trends are indicative of a healthy advance.  She also says stocks are pricing in a V-shaped recovery in the economy, which she believes is unlikely. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_5_6_11c5bb16-d0ff-461f-b19c-a811d4b0f50a_jpg_980x551.jpg", "PublishedAt": "2020-05-06", "content": null}, {"source": "Bloomberg", "author": null, "title": "U.S. stock market primed for disappointment: JP Morgan strategist ", "description": "The U.S. stock market has been ripping higher this month with the S&P 500 entering today's trade +13.7 per cent in April. Jack Manley global market strategist at JP Morgan Asset Management, believes there's the risk of a significant pullback in the near-term. He says the market seems too sure about a V-shaped recovery and is discounting the likelihood of a back-half stall, or the likelihood of a second wave of infections later this year once social distancing restrictions are rolled back.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_30_9b675f65-87fc-4bcf-ad34-2f8eb690e0b6_jpg_980x551.jpg", "PublishedAt": "2020-04-30", "content": null}, {"source": "Bloomberg", "author": null, "title": "'A rising Canadian dollar hurts any gains they're making in the U.S. stock market': McCreath", "description": "Andrew McCreath joins BNN Bloomberg's Jon Erlichman to discuss the state of the U.S. dollar. He says that if the U.S. dollar goes down global growth needs to pick up. He also adds that a rising Canadian dollar can hurt the performance of the U.S. stock market.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_30_0b34be04-2261-449f-812a-2009d5efdc2b_jpg_980x551.jpg", "PublishedAt": "2020-04-30", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets rebound after pandemic crash", "description": "Stock markets rebound after pandemic crash\r\nGlobal markets continue to recover after the precipitous crash earlier this year caused by the COVID-19 pandemic. Phil Davis, founder of philstockworld.com and PSW Investments, looks at where markets are heading and discusses some likely scenarios for reopening the global economy", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_4_29_c7491665-0086-4a95-ba27-9d1f86b0b9f1_jpg_1280x720.jpg", "PublishedAt": "2020-04-29", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market bounce back has been too quick: Sun Life CIO  ", "description": "Sadiq Adatia, chief investment officer at Sun Life Global Investments, says the turn higher in stock markets over the last few weeks went too far and investors may be underestimating the damage to the economy and how long it may take to recover.  Adatia is slightly underweight stocks and expects a leg lower in the markets. He favours U.S. equities over Canada and Europe. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2018_4_29_f2081e3d-8c06-4888-b0e1-5868a0f7ef94_jpg_2000x1125.jpg", "PublishedAt": "2020-04-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "Use stock market tumbles to buy quality stocks: Avenue Investment Management  ", "description": "Bryden Teich, portfolio manager at Avenue Investment Management says it's important for investors to not get too emotional over individual day-to-day swings in the stock markets.  He outlines a strategy for dealing with volatility that includes an opportunity to buy quality names when the market tumbles. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_31_606f6793-2f9e-4e9e-a5b0-a2fe2ee1ec05_jpg_980x551.jpg", "PublishedAt": "2020-03-31", "content": null}, {"source": "Bloomberg", "author": null, "title": "How to position for an eventual stock market recovery  ", "description": "Paul Christopher, head global market strategist at Wells Fargo Investment Institute  says stock markets are still searching for a bottom and they could re-test their lows, but he's expecting a higher finish for 2020.  His year-end target for the S&P 500: 2670-2850.  Christopher outlines a buy-and-sell strategy that takes advantages of the ups and downs in the market.   ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_31_9347ed6c-243a-4c9e-a75e-a23599be915d_jpg_980x551.jpg", "PublishedAt": "2020-03-31", "content": null}, {"source": "Bloomberg", "author": null, "title": "This stock market is not cheap: First Avenue's Pashootan", "description": "North American stock markets posted sharp gains Tuesday but Kash Pashootan, CEO and chief investment officer at First Avenue Investment Counsel, isn't buying. He says stocks are not at levels that he would call cheap despite the big meltdown over the past month and that defense remains the best strategy. He says stocks have yet to price in a no-growth economy.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_24_d4f37ea1-739e-40c6-b213-90e4fbb30666_jpg_1280x720.jpg", "PublishedAt": "2020-03-24", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets in a panic attack: Canaccord's Tony Dwyer ", "description": "Stocks are falling hard this morning in what Tony Dwyer, chief market strategist at Canaccord Genuity, describes as a \"panic attack.\" He believes the selling has become excessive, adding his key tactical indicators have reached an oversold level. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_12_87b70d01-6d2f-47ac-adb2-81af56068038_jpg_980x551.jpg", "PublishedAt": "2020-03-12", "content": null}, {"source": "Bloomberg", "author": null, "title": "Where to take shelter in the stock market storm", "description": "Jeff Weniger, director of asset allocation at WisdomTree Asset Management, explains why emerging markets and Japan should be considered by investors who are looking to flee the mayhem that has gripped financial markets around the world.\n  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_9_2a6b5aab-2bd3-4541-92e8-766bd0a5ba00_jpg_1024x683.jpg", "PublishedAt": "2020-03-09", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market selling resumes as virus spreads ", "description": "The volatile ride in equity markets continues with stocks trading sharply lower in the U.K. and Europe as the coronavirus continues to spread. Marc Ostwald, strategist and chief economist at ADM Investor Services International Limited, offers perspective on the big u-turn from yesterday, and whether central bank rate cuts will have much impact. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_5_9435d0cd-c107-4d35-87e2-7e01c1257827_png_754x419.jpg", "PublishedAt": "2020-03-05", "content": null}, {"source": "Bloomberg", "author": null, "title": "The stock market's fear gauge spikes ", "description": "The CBOE Volatility Index (VIX), a popular gauge of market fear touched its highest levels since the great recession as investors worried about the potential impact of the coronavirus outbreak. Brad Simpson, Chief Wealth Strategist at TD Wealth looks at what the VIX is telling investors about the potential market recovery.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_3_4_1a3d8d66-b04a-4ccd-bce3-789bbcf4b57b_jpg_1280x720.jpg", "PublishedAt": "2020-03-04", "content": null}, {"source": "Bloomberg", "author": null, "title": "Bond market strategy in while stock markets plunge", "description": "As stock markets continue to plunge, Paul Sandhu, President &amp; CEO, Marret Asset Management, lays out a strategy for putting money to work in the fixed income market.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_28_54fed8fa-bda5-45b2-98de-790396714e26_png_961x544.jpg", "PublishedAt": "2020-02-28", "content": null}, {"source": "Bloomberg", "author": null, "title": "Panic stock market selling can lead to opportunity: Scott Bauer", "description": "Scott Bauer, CEO, Prosper Trading Academy, says the wave of selling on coronavirus fears reflects fear and panic in the markets.  But Bauer also says now might be a good time to look at strong companies with solid balance sheets that can weather the storm over the long haul, and do a little buying.  He suggests Apple and Microsoft.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_28_589ba38f-4489-4be3-ad57-de7be87b6a20_png_964x541.jpg", "PublishedAt": "2020-02-28", "content": null}, {"source": "Bloomberg", "author": null, "title": "Interest rate cuts would not stabilize stock markets: Paul Nolte", "description": "A former member of the U.S. Federal Reserve has suggested central banks should consider coordinated interest rate cuts to offset the fallout from the coronavirus.  However, Paul Nolte, senior VP & portfolio manager, Kingsview Wealth Management, doesn't think rate cuts would stabilize markets, saying liquidity conditions are already very easy in the U.S. and around the world.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_28_712a5576-38fa-4e60-9c28-16672d73d268_png_960x546.jpg", "PublishedAt": "2020-02-28", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market tumble continues", "description": "Stocks fell sharply at the open this morning as fears deepen over the economic impact of the spreading coronavirus. Jeffrey Kleintop, chief global investment strategist, Charles Schwab, says how long the selling will continue is unknown, but adds markets have been through pandemics before and have bounced back.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_27_438ebaee-be19-4022-8c62-e63002c6ad1e_png_963x539.jpg", "PublishedAt": "2020-02-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets continue to dive", "description": "Gordon Shannon, portfolio manager, TwentyFour Asset Management, details a sharply lower trade in U.K. and European markets as stocks continue to tumble on growing fears over the economic impact of the coronavirus.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_27_8bf8c893-9a0b-43b4-846c-a94fb95df6fd_png_964x540.jpg", "PublishedAt": "2020-02-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets too quick to dismiss coronavirus risks: London Capital Group", "description": "Stock markets are bouncing back less than 24-hours after Apple issued a sales target warning amid fallout from the coronavirus. Jasper Lawler, head of research at London Capital Group, says investors are playing a risky game and are moving too quickly in assessing the potential hit to China's economy.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_19_73a1c928-9cc0-4ddf-bcbc-20e7fd5e8bee_png_766x427.jpg", "PublishedAt": "2020-02-19", "content": null}, {"source": "Bloomberg", "author": null, "title": "Low interest rates providing a floor for stock markets: Allan Small", "description": "Allan Small, senior investment advisor at Allan Small Financial Group, HollisWealth, says as long as interest rates remain low, TINA (there is no alternative) will remain the name of the game and stocks will be the only way to grow a portfolio.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_18_2bdf9dd1-4e9b-4805-95db-f2e33a30534e_png_761x424.jpg", "PublishedAt": "2020-02-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock Market 'Incredibly Overvalued,' IG Markets Says", "description": "Feb.13 -- Kyle Rodda, market analyst at IG Markets, discusses the state of global markets and where he sees opportunities. He speaks with Haidi Stroud-Watts and Shery Ahn on \"Bloomberg Markets.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_13_a81cc3ae-d46a-4507-a885-4305e95fbf50_jpg_640x360.jpg", "PublishedAt": "2020-02-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "How much gas is left in the stock market tank?", "description": "Kash Pashootan, CEO and chief investment officer at First Avenue Investment Counsel, lays out the bull's case and bear's case for the future direction of stocks, and the impact volatility can play in determining investment returns. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_12_bae5de5a-d274-4ee8-9e5c-a1ff38daf776_png_766x426.jpg", "PublishedAt": "2020-02-12", "content": null}, {"source": "Bloomberg", "author": null, "title": "TINA is driving the U.S. stock market bus: Strategist ", "description": "The U.S. equity market is adding to its record-high close of yesterday and Alex Dryden, global market strategist at J.P. Morgan Asset Management, says TINA is responsible.  Dryden says ultra-low yields in the bond market mean there is no alternative to equities, but that U.S. stock market valuations are high enough that investors should buy with caution.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_11_519cf6b6-bb2c-4b8c-8dcc-9f59d5ea30ef_png_766x429.jpg", "PublishedAt": "2020-02-11", "content": null}, {"source": "Bloomberg", "author": null, "title": "U.S. stock market fully valued: Manulife's Petursson", "description": "Philip Petursson, chief investment strategist at Manulife Investments, says the record run higher in the U.S. stock market means valuations are stretched on Wall Street. He says the price-to-sales ratio is back to 2000 levels and investors need to weigh the price paid with the earnings outlook. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_2_10_004d8942-a8d5-4d1b-9dae-aa53ee9aa091_png_766x429.jpg", "PublishedAt": "2020-02-10", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock Market Rise on Fed Repo Not a 'Credible Story,' Bill Dudley Says", "description": "Jan.29 -- Former New York Federal Reserve President and Bloomberg Opinion columnist William Dudley discusses the Fed's purchase of Treasury bills and its impact on equity markets. He speaks with Bloomberg's Jonathan Ferro on \"Bloomberg The Open.\" His opinions are his own.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_29_f476de95-a1d0-4ef9-b6ed-f555a6d06d90_jpg_640x360.jpg", "PublishedAt": "2020-01-29", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market drop 'not a big deal': Alan Knuckman", "description": "Alan Knuckman, the chief market strategist at Agora Financial, says weakness in the stock markets today is \"not a big deal\"  following the big run higher.  He says volatility is an opportunity and that investors have been begging for a selloff in order to step up and buy more stocks.  Luckman says the number to watch for in the S&P 500 is 3,200 on a weekly basis, calling it a super support level.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_27_ebe39316-79ed-4562-9262-f7b61d979cd2_png_769x427.jpg", "PublishedAt": "2020-01-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Nervous over stock market valuations", "description": "Allan Small, senior investment advisor at Allan Small Financial Group, HollisWealth, believes markets can move higher over the next 11-months, but that he is nervous about the valuations. Smalls says the bull market has been driven primarily by liquidity and cheap money, not by fundamentals. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_27_f81dbd87-8e04-41fc-bdfb-0f029bffb7d6_png_767x426.jpg", "PublishedAt": "2020-01-27", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets at risk of a correction: Patrick Horan", "description": "Patrick Horan, Principal at Agilith Capital, expects investors to be hit with a stock market correction of more than 10 per cent this year.  He says valuations, especially in the U.S market, are very stretched.  But Horan also says if the markets do take a dive, Canadian stocks should recover faster than the U.S.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_22_db22239d-cc60-458b-b09e-72b8adfc840d_png_763x428.jpg", "PublishedAt": "2020-01-22", "content": null}, {"source": "Bloomberg", "author": null, "title": "Rising risks of a stock market correction", "description": "Edward Moya, senior market analyst at OANDA, says the U.S.  stock market could trip lower in five- 10 per cent correction.  But if stocks do fall, Moya says the decline will likely be short-lived and be viewed as a buying opportunity. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_21_17b9c02e-0007-4a11-8af7-9b425be441cd_png_765x429.jpg", "PublishedAt": "2020-01-21", "content": null}, {"source": "Bloomberg", "author": null, "title": "Wider Base Forming Under The Stock Market Bull: SIA Wealth's Cieszynski ", "description": "Colin Cieszynski, chief market strategist at SIA Wealth Management, says there's good news for investors who may be questioning the underlying strength of the stock market bull.  He says the rally has gone beyond North American large-caps and good breadth is now emerging with mid and small-caps.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_17_2c741081-155c-4111-816d-72f6ecd773a0_jpg_940x529.jpg", "PublishedAt": "2020-01-17", "content": null}, {"source": "Bloomberg", "author": null, "title": "Playing some stock market defence in 2020", "description": "Kash Pashootan, CEO and chief investment officer at First Avenue Investment Counsel, discusses portfolio positioning for 2020, and why he favours interest rate sensitive areas of the market such as utilities, real estate and telecom", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_15_1264473e-cc89-4d1c-9bb2-260aa0d5880b_png_767x429.jpg", "PublishedAt": "2020-01-15", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market risks rising: Rob Tétrault", "description": "Rob Tétrault, senior vice president, portfolio manager, and head of the Tetrault Wealth Advisory Group, Canaccord Genuity, says it's time to de-risk and sell some stocks.  He's reducing client exposure to equities, saying valuations are stretched while market risks are moving higher. Tétrault explains who he's positioning the proceeds in bonds and alternative assets. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_13_640dfea4-2748-460a-aa48-870b38f6b548_png_765x425.jpg", "PublishedAt": "2020-01-13", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market bull on some of the names he likes right now", "description": "Adam Johnson, founder and author of the Bullseye Brief, tells BNN viewers how he has positioned money in the U.S. stock market this year so far. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_9_18534613-4eea-419c-8383-e158c220fcb4_png_767x431.jpg", "PublishedAt": "2020-01-09", "content": null}, {"source": "Bloomberg", "author": null, "title": "This stock market bull is not backing down", "description": "Rising tensions in the Middle East have put stock markets under pressure but David Burrows, president and chief investment strategist at Barometer Capital Management, is not bending.  He says markets are not on the verge of a significant drop, and there's good reason to stay in the market and buy on weakness.  Burrows outlines some of the sectors and names where he's finding value. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_6_3e45bd2d-457c-4954-a1f4-f1984b127653_png_767x428.jpg", "PublishedAt": "2020-01-06", "content": null}, {"source": "Bloomberg", "author": null, "title": "Bankruptcy Job Losses Soar Along With Stock Market Gains", "description": "Jan.03 -- Job cuts due to companies filing for bankruptcy hit 62,000 in 2019, the highest level in nearly 15 years. Bloomberg’s Sonali Basak reports on \"Bloomberg Daybreak: Americas.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2020_1_3_fd3a0197-ce25-411d-a5ec-da081efd95d5_jpg_640x360.jpg", "PublishedAt": "2020-01-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Which Stock Markets Will Outperform in 2020?", "description": "Dec.22 -- Kyle Rodda, market analyst at IG Group, talks about the outlook global stocks and where he sees opportunities. He speaks with Shery Ahn and Paul Allen on \"Bloomberg Daybreak: Australia.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_12_22_e8f9ef67-b2fb-4aeb-9102-01955be8a25a_jpg_640x360.jpg", "PublishedAt": "2019-12-22", "content": null}, {"source": "Bloomberg", "author": null, "title": "Too much optimism about economic growth and stock market 'melt up'", "description": "John Zechner, chairman and founder of J. Zechner Associates, says that he still sees risks for 2020, despite the fact that strategists are confident that a recession has been avoided due to overseas recoveries. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_12_18_d5484aea-e48e-4e9d-9865-4dfebeefd697_png_768x430.jpg", "PublishedAt": "2019-12-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "When safe areas of the stock market become dangerous", "description": "Patrick Horan, principal at Agilith Capital, says investors should focus on buying cheap cyclical stocks and reduce exposure to sectors considered \"safe\", such as utilities and REITs.  He says those safe areas are now probably the most dangerous areas in which to invest.", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_12_3_075f178d-cc95-4923-8a43-1e5404edaebd_png_770x428.jpg", "PublishedAt": "2019-12-03", "content": null}, {"source": "Bloomberg", "author": null, "title": "Fuel from the Fed for a rising stock market", "description": "Bryden Teich, portfolio manager of Avenue Investment Management, explains why he believes the biggest contributor to stock market performance over the past few months has been asset purchases by central banks, including the U.S. Federal Reserve. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_12_2_7515faeb-ad3d-46ec-b0d1-85a7b3d4345b_jpg_980x551.jpg", "PublishedAt": "2019-12-02", "content": null}, {"source": "Bloomberg", "author": null, "title": "Hong Kong Stock Market Is 'Most Attractive,' Morningstar Says", "description": "Dec.01 -- Dan Rohr, head of global equity research at Morningstar, talks about Hong Kong, mainland China and U.S. stocks. He speaks with Shery Ahn and Haidi Stroud-Watts on \"Bloomberg Daybreak: Australia.\"", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_12_1_bd228e46-47de-4564-b3fd-7c771e77addb_jpg_640x360.jpg", "PublishedAt": "2019-12-01", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets in need of a trade deal", "description": "Andrew Pyle, senior wealth advisor and portfolio manager at The Pyle Group, Scotia Wealth Management, says the stock market needs to see a phase one trade deal very soon in order to prevent a possible late-year downturn. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_25_10966593-df56-41ac-9a5b-d707972da1ba_jpg_980x551.jpg", "PublishedAt": "2019-11-25", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock market pullback looks to be looming: Paul Nolte", "description": "Paul Nolte, senior vice president and portfolio Manager at Kingsview Wealth Management, believes the traditional holiday season rally in stocks may have come early this year, and we could see the S&P 500 drop by as much as 5 per cent over the next few weeks.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_22_b26a61da-fc84-47a5-9041-e031523a6dbc_png_760x428.jpg", "PublishedAt": "2019-11-22", "content": null}, {"source": "Bloomberg", "author": null, "title": "HK Stock Market Isn’t Representative of What’s Going on, Says Nomura’s McCafferty", "description": "Nov.19 -- Jim McCafferty, joint head of APAC equity research at Nomura, discusses Hong Kong markets, why they’re rallying in light of the unrest in the streets and his outlook for markets. He speaks on “Bloomberg Markets: Asia.”", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_19_0713f645-bf3c-4067-9afa-60ca139e8755_jpg_640x360.jpg", "PublishedAt": "2019-11-19", "content": null}, {"source": "Bloomberg", "author": null, "title": "Now is not the time to get bullish on the stock market", "description": "Larry Berman discusses the current events happening within the world, including Berkshire Hathaway's massive cash holdings, why Saudi Aramco is finally selling off its oil assets, and how going public will reshape the Saudi economy.  ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_18_1bb00a98-0189-40b5-beb0-b8e3d14d50bf_jpg_940x529.jpg", "PublishedAt": "2019-11-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "Still value to be found in record-high stock markets: Paul Harris", "description": "Bay and Wall Street have climbed to record highs and Paul Harris, partner and portfolio manager at Harris Douglas Asset Management, says you can still find good stocks to buy with further upside ahead.  Names he likes at current levels include Disney, First Service Corp. and Google. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_18_9b3e38ac-4ffd-482d-82d2-8ed40e902110_jpg_940x529.jpg", "PublishedAt": "2019-11-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "Stock markets need a trade deal: OANDA analyst", "description": "Stock futures are indicating U.S. equities may extend the streak of record-high performances we saw last week.  But how long that streak lasts greatly depends on China-U.S. trade talks, according to Edward Moya, senior market analyst at OANDA.  He's optimist a phase one deal will get done, but if it doesn't Moya says stocks will dive and bonds soar. ", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_18_d10127f0-88a2-4828-943c-bf5911628bb3_jpg_980x551.jpg", "PublishedAt": "2019-11-18", "content": null}, {"source": "Bloomberg", "author": null, "title": "TSX underperformers amid stock market highs on David Prince's radar", "description": "BNN Bloomberg's Greg Bonnell speaks with David Prince of Harbinger Capital Markets Research about the latest stock market highs and certain Canadian sectors to watch with caution.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_11_15_6ae7e9bf-36fe-40ba-88a8-6ba304082d44_JPG_948x526.jpg", "PublishedAt": "2019-11-15", "content": null}, {"source": "Bloomberg", "author": null, "title": "Earnings season sparks some stock market confusion: Dan Deming", "description": "Dan Deming, managing director at KKM Financial, offers an assessment of Q3 earnings season in the U.S. pointing out conflicting results within certain sectors leading to \"some confusion\" about market valuations.  But Deming also says there's enough \"bearishness\" in investor sentiment to propel the stock market higher.  \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_10_25_70ad4cb8-02e6-48d3-92fb-d52d0825cf5a_jpg_940x529.jpg", "PublishedAt": "2019-10-25", "content": null}, {"source": "Bloomberg", "author": null, "title": "Spotting danger signs in 'safe' areas of the stock market", "description": "Patrick Horan, principal at Agilith Capital, says sectors of the stock market often considered \"safe\" are now probably the most dangerous areas in which to invest. \n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_10_15_30af20f4-c6da-4fcb-b3a5-11f9748ca0ce_jpg_940x529.jpg", "PublishedAt": "2019-10-15", "content": null}, {"source": "Bloomberg", "author": null, "title": "Adapting to the low interest rate vortex", "description": "Bill Harris, partner and portfolio manager at Avenue Investment Management, discusses how to position yourself in this low interest rate environment. He says to avoid the bond market and go into the stock market.\n", "url": null, "urlToImage": "https://images2.9c9media.com/image_asset/2019_10_9_c2f7acc5-2ce7-4e43-a689-e5a0aebd347e_jpg_940x529.jpg", "PublishedAt": "2019-10-09", "content": null}]