[{"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1737914435690", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1634936899915", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/ottawa/programs/intownandout/housing-prices-1.5345612", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/656163395811", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1525719619771", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/canada/british-columbia/programs/onthecoast/may-21-2019-housing-prices-1.5144348", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": "Expect housing prices to continue to rise in 2020, realtors say", "description": "Prices driven by lack of supply, says real estate association president", "url": "http://www.cbc.ca/news/canada/kitchener-waterloo/kitchener-waterloo-real-estate-housing-prices-2020-1.5417667", "urlToImage": "https://i.cbc.ca/1.4292161.1507249491!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/canadian-real-estate.jpg", "publishedAt": ["Jan 07, 2020 1:22 PM ET", "2020-01-07T18:22:22.845Z"], "source": "CBC News", "content": "House sales were strong and the prices increased last year in Waterloo region, according to the latest report from the Kitchener-Waterloo Association of Realtors.\nAnnual home sales in Kitchener-Waterloo hit near 6,000 transactions. Colleen Koehler, the president of the local real estate association, calls that \"a strong real estate market\" and says she expects the trend to continue in 2020.\n\"It's 100 percent steady-as-she-goes. We're going to see more of the same,\" Koehler said.\n\"Prices are going to be driven strictly by that lack of supply. Until we get more inventory on the market, it's going to be a little bit more of the same.\"\nThe price of a house in Waterloo region in 2019 cost about $527,718, a 9.3 per cent increase compared to 2018.\nDetached homes, condos, town homes and semi-detached homes also increased in price.\n\"I would suggest that housing prices are going to probably increase around the same amount but you know there's not much else we can do. It is strictly supply and demand,\" Koehler said.\nKWAR said 5,925 residential homes sold last year, an increase of 1.6 per cent compared to 2018.\nLast year's sales were 2.3 per cent below the previous five-year average and three per cent above the previous 10 year average.\n"}, {"author": null, "title": "Hamilton housing sales down since September, prices up from last year: RAHB", "description": "Sales down for apartments, which increased in price by 23.2 per cent", "url": "http://www.cbc.ca/news/canada/hamilton/hamilton-housing-sales-november-2019-rahb-1.5382229", "urlToImage": "https://i.cbc.ca/1.1586671.1379056578!/httpImage/image.jpg_gen/derivatives/16x9_780/hi-housing-sold-sign-8col.jpg", "publishedAt": ["Dec 03, 2019 11:49 AM ET", "2019-12-03T16:49:00.399Z"], "source": "CBC News", "content": "Hamilton housing sales are down from September and October, but still up from November 2018 despite an increase in pricing, according to the Realtors Association of Hamilton-Burlington (RAHB.) \nThe RAHB said that an average price for residential properties in the area is now $591,334, which represents a 5.6 per cent increase from November of last year. There were 955 sales in November. \nThe average price of property has been decreasing since September, as has the number of listings. RAHB President Bob Van de Vrande said that a decrease in homes for sales and \"higher ratio of solds to listings indicate that the market is currently an opportune time for sellers to consider listing.\" \nCompared to November 2018, says the RAHB, both single family properties and townhouse sales were up despite an increase in price. \nThe number of sales for single family properties increased by 8.6 per cent, while the average price increased by 2.7 per cent. The average price for a detached home in Hamilton in November was $575,284.  \nTownhouse sales were up by 2.9 per cent despite an increase in price of 6.8 per cent. The average price of a townhouse in Hamilton increased to $477,738. \nApartment sales also increased in price compared to the year before with a 23.2 per cent jump. But sales were down for this type of property — there were 63 apartments sold in Hamilton for an average price of $325,391. Van de Vrande attributed the decrease to a \"lower level of inventory.\"\nAccording to the RAHB, Burlington had the highest number of sales over the month in its market area. Hamilton Mountain sold the second highest amount of properties — these were also the two areas with the highest amount of sales in November 2018.\nBurlington also had the highest average sale price of $787,957. With the exception of areas with no property sales, the lowest average price for a property was in Hamilton centre at $402,147. \n"}, {"author": "Josee St-Onge", "title": "Flood and pandemic exacerbate housing crunch in Fort Vermilion", "description": "Province considering emergency housing as majority of residents can’t return home", "url": "http://www.cbc.ca/news/canada/edmonton/fort-vermilion-flood-housing-covid-19-1.5566780", "urlToImage": "https://i.cbc.ca/1.5566963.1589386509!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/fort-vermilion-flood-damage.jpg", "publishedAt": ["May 13, 2020 7:00 AM MT", "2020-05-13T13:00:00.884Z"], "source": "CBC News", "content": "Fort Vermilion residents whose homes have been damaged by flooding are staying in hotels, campers or with friends and relatives as clean-up work continues in the northern Alberta hamlet. \nThe community of about 750 people was evacuated on April 26, when an ice jam caused the nearby Peace River to overflow. \nFlood waters have now receded, leaving more than 150 damaged structures behind, said Cameron Cardinal, Mackenzie County councillor for the area.\nThe water rose by several metres in some areas, he said.\n\"There are only seven homes that aren't affected by the flood waters,\" Cardinal said. \"The sewers also backed up in several of them because the water basically had nowhere to go.\"\nBusinesses, churches, cemeteries and the local school were also flooded. \nCleanup is underway, Cardinal said, and assessors have started investigating the extent of the damage. \n\"From there, we can come up with a timeline of how many people can come back and when,\" he said. \"It could be a week, it could be three months, it could be six months.\"\nThe pandemic has made it more difficult to find temporary accommodations, Cardinal said, since people can't be in crowded spaces under ongoing physical distancing restrictions. \n\"If we didn't have COVID-19 to contend with, it would've been a simple, no-brainer solution. We could have set up camp,\" he said. \n\"We have the high school, we have our community complex where we could have housed people.\"\nInstead, most evacuees are staying in hotels in the nearby towns of High Level and La Crete, while some are camping or staying with friends and family.\n\"It also comes with a huge price tag,\" Cardinal said. \nWanda Beland, who grew up in the area, is helping families through her work for the Northwest Regional FASD Society.\nHousing options in the community were already limited before the flood and are nonexistent now, said Beland.\n\"It is a very small community that has very limited rental accommodations.\"\nBeland is advocating for temporary housing to be set up within the community so residents can stay together as they rebuild.\n\"They're already being traumatized,\" she said. \"They need to be able to try and move on within the community that they know.\"\nThe area is populated with Indigenous and Métis people who have a longstanding connection to the land, said Beland. \nThe Beaver First Nation, Tallcree First Nation, Little Red River Cree Nation and Dene Tha First Nation all call the area home.\n\"That's where their roots are, that's where their families are buried,\" she said. \"That's where they need to be to keep that connection.\"\nA cursory assessment identified between 30 and 50 structures that will have to be rebuilt, said Shane Schreiber, assistant deputy minister of the Alberta Emergency Management Agency.\nResidents still have a lot of work ahead of them, he said.\n\"They've got to take their flood-affected belongings out, throw them out. They've got to air their homes dry and they've got to do damage assessments to see what actually needs to be fixed.\"\nThe province is considering several options for housing people during the rebuilding process, including bringing in mobile housing, said Schreiber. \n\"We're also looking at whether or not some people may choose to stay in High Level, and in local rentals if it's more conducive to their lifestyle and their family cohesion,\" Schreiber said. \nThe vast majority of Fort Vermilion residents do not have flood insurance, said Cardinal. \nThe community is on a known floodplain, he said, and insurance is too expensive.\n\"I've heard figures as high as $1,200 a month just for overland flood insurance.\"\nThe province is providing help for residents through its disaster recovery program. \nFort Vermilion can expect to see about $47 million of the total sum that has been earmarked for northern communities impacted by flooding, said Cardinal. \n\"We have to be very careful how we spend those dollars,\" he said. \"The number one priority is our homes and our businesses, that we're able to get them up and going again and get people back in their homes.\"\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/1602483779595", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/news/thenational/will-a-1-tax-on-foreign-buyers-help-control-housing-prices-fact-check-1.5282050", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": null, "title": null, "description": null, "url": "http://gem.cbc.ca/media/the-weekly/season-2/episode-19/38e815a-01097de96e3", "urlToImage": null, "publishedAt": null, "source": null, "content": null}, {"author": "David Common & Melissa Mancini", "title": "Soaring rents and house prices in Canadian cities make housing a key election issue", "description": "Federal parties roll out their strategies to help urban Canadians keep housing costs in check", "url": "http://www.cbc.ca/news/canada/federal-election-campaigns-affordable-housing-1.5254614", "urlToImage": "https://i.cbc.ca/1.5255060.1566416544!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/jeff-gallant.JPG", "publishedAt": ["Sep 23, 2019 4:00 AM ET", "2019-09-24T12:39:03.768Z"], "source": "CBC News", "content": "Jeff Gallant lived in his new home just 17 days before the For Sale sign went up.\nSoon after the single dad rented the house, it was sold and the new owners sent him notice of a major renovation that would force Gallant and his two young children to leave. A similar thing occurred at his previous place, and it's happening to so many renters in Charlottetown that a new term has been born: Renoviction.\nCharlottetown is a prime example of the scarce vacancies and spiraling costs facing renters in communities across the country.\n\"It's getting ridiculous,\" Gallant says of the rental market. \"Prices have doubled pretty much, and that boils back to supply and demand. They know there's nothing here, [so landlords] jack up the price.\"\nCost of living is a big election issue, a CBC News-commissioned online poll from June suggests, and housing is the biggest single expense for most Canadians, according to Statistics Canada figures on annual household spending.\nAs the campaign has unfolded, the federal parties have begun to unveil plans on how they'd make life more affordable for voters.\nThe Liberals aim to build 100,000 affordable housing units over a decade. They would also encourage home ownership through a first-time home-buyer incentive that subsidizes up to 10 per cent of the purchase of a new home and five per cent on resale homes — with restrictions. \nThe NDP have a more ambitious plan, committing to build 500,000 affordable housing units in a decade.\nA central message of the Conservative campaign is that it wants people \"to get ahead, not just get by,\" and that the government needs to get its hand out of Canadians' pockets in areas like the carbon tax, which the party describes as ineffective. The Conservatives have promised to ease building regulations to increase the housing supply, and said Monday that if elected the party would change the maximum mortgage term, increasing it from 25 years to allow up to 30-year mortgages. It is also promising to review the \"stress test\" for first-time buyers applying for a mortgage.  \nThe reality is that finding affordable housing is increasingly difficult in many parts of Canada.\nThe smallest provincial capital, Charlottetown, has one of the lowest rental vacancy rates in the country. It hovers just above zero per cent, new Kijiji listings last just minutes before apartments are snapped up, and renters complain about spending ever more of their limited dollars on housing.\nIt is an old axiom of financial planners that renters should never spend more than 30 per cent of their gross earnings on rent and utilities. In Charlottetown, low income renters (those earning less than $21,361) spend on average 62 per cent of their earnings on housing.\nThe numbers get only marginally better when income levels increase.\nData gathered by the Canadian Rental Housing Index shows that Toronto renters earning as much as $45,498 a year are dedicating 40 per cent of their earnings to monthly housing costs. Live outside the downtown core, in York or Peel region, and those middle income earners are paying an average of per cent 44 and 38 per cent respectively. \nIn Regina, low-income renters spend more than half their pre-tax earnings on rent and utilities. In Calgary it's 62 per cent, and 91 per cent in Vancouver.\nThis may help to explain why so many adult children are returning to live with their parents even after they've entered the workforce, or why many young adults choose to have roommates to defray living costs.\nCheck out your region's costs and compare it to others on the Rental Housing Index\nAcross Canada, it's not simply a question of how much accommodation costs, but also about keeping up with the need for more places to live.\nIn 2018, there were 37,000 new apartments built nationwide, but demand increased by 50,000 units, according to tracking done by the Canada Mortgage and Housing Corporation.\nAnd Canadian cities continue to grow, driven by factors such as immigration and stronger job numbers.\nWith housing-related problems rising and the cost of living a primary issue for Canadian voters, Charlottetown Mayor Philip Brown figures political party leaders in the midst of a federal election campaign should be talking more about it. When he was elected last year, he describes how he used a congratulatory phone call from the Prime Minister to drive home his top priority.\n\"We have a problem with affordable and accessible housing,\" Brown says he told Justin Trudeau on a call shortly after his election as mayor in November 2018. \"We need more public spending from the provincial and federal governments to up the supply of affordable and accessible housing.\"\nEach community has its own housing challenges, and one of the big ones for Charlottetown is that short-term rentals for the city's giant tourism industry suck up a lot of housing stock. \nAnother is house prices — Canadian Real Estate Association (CREA) data shows they've jumped 38.5 per cent in the past three years alone in P.E.I.'s capital. By comparison, prices rose 25.3 per cent in Toronto, 21.6 in Ottawa and 33.3 in Victoria. A market where buyers get into bidding wars is new for Canada's smallest province, which recently surpassed 153,000 residents, and it's persuading some landlords to sell.\nAdded to that, the province's population is growing, with people moving to P.E.I. from other nations and parts of Canada on both a permanent and temporary basis. The University of P.E.I. hasn't built a new residence in 14 years, for example, while its student population has increased by about a third. There have been significant increases in the number of students on campus requiring housing, with half now coming from out of province or out of country.\n\"And that, in turn, is pushing more demand on downtown housing,\" Brown explains.\nHolland College student Sierra Elkerton was debating whether she could even afford to stay in school after she was evicted by her landlord because the building was not up to code. She managed to find a new apartment, but for nearly double the monthly rent.\n\"Realistically I don't want to pay that, but it looks like I'm going to have to,\" says Elkerton. \"The cost of living is way too high considering it's such a small city.\"\nShe's not alone. A global survey by money manager BlackRock Inc. found \"many Canadians feel that they are in a financial squeeze — hard pressed to save amid what they perceive as a high cost of living, including devoting much of their income to paying for their homes.\"\nCanadians who responded to the poll said they spend an average of 43 per cent of their income on housing — whether renting or owning. \nAmong the 20 countries surveyed, only the Netherlands and Sweden had higher housing costs, at 51 per cent and 45 per cent respectively.\nCharlottetown's mayor is well aware of the numbers. In his community, he's most focused on trying to help the people who find themselves paying more than they can afford — and those who can't find anything at all.\n\"We may be a small city,\" he says, \"but we've got big city problems.\"\nThe mayor says he would like to hear commitments from party leaders this election cycle to use the big federal wallet to help cities build more affordable housing.\n\"I got two calls this past week and one visit to the office,\" Brown says. \"From a woman who was living in her car in the Walmart parking lot, and another woman that's been in [a shelter] now for almost a month and she needs a place to live.\"\nWatch The National's story about what it's like to live in a 'severely unaffordable' Canadian city:\n"}, {"author": null, "title": "Toronto area housing sales up 24.3% in July, prices rise due to tighter supply", "description": "Overall average selling price for properties in GTA was $806,755", "url": "http://www.cbc.ca/news/canada/toronto/toronto-home-sales-1.5237143", "urlToImage": "https://i.cbc.ca/1.5237166.1565368546!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/luxury-home-report-20181023.jpg", "publishedAt": ["Aug 06, 2019 9:25 AM ET", "2019-08-09T16:36:32.577Z"], "source": null, "content": "The Greater Toronto Area's home price index was up 4.4 per cent last month as the supply of properties for sale tightened and the number of sales jumped 24.3 per cent from July last year, the Toronto Real Estate Board reports.\nThe overall average selling price for properties in the Greater Toronto Area was up 3.2 per cent year-over-year to $806,755, TREB said in a monthly report issued Tuesday.\nThe number of properties sold increased to 8,595 from 6,916, with sales of all four categories of housing up by double digits.\n\"Broadly speaking, increased competition between buyers for available properties has resulted in relatively strong price growth above the rate of inflation for semi-detached houses, townhouses and condominium apartments,\" Jason Mercer, the real estate board's chief market analyst, said in a statement.\nOn the other hand, he said, sales of fully detached homes have been more affected by a stress test required for federally regulated mortgages and the average price for that category of housing was down 0.9 per cent overall.\nIn the City of Toronto itself, the average price for fully detached homes fell 9.1 per cent to $1.23 million, offsetting a 2.5 per cent increase in the surrounding 905 area to an average of $929,633.\nTREB says that the supply of properties for sale in the Greater Toronto Area was also tighter than it was last year.\nThere were 14,393 new listings in the GTA during the month, up from 13,873 in July 2018, but the total number of active listings at the end of July was down 9.1 per cent from a year ago.\nTREB CEO John DiMichele said there's a growing demand for residential properties due to population growth.\n\"As more and more households come to terms with the stress test and move back into the market in the coming months and years, they could suffer from a chronically under-supplied marketplace and an acceleration of home price growth to unsustainable levels,\" DiMichele predicted.\n\"Fortunately, policy makers have acknowledged the housing supply issue and are working toward solutions.\"\nThe board said it welcomes a move by Toronto Mayor John Tory and the city council, which instructed staff to report on ways to increase housing options in neighbourhoods that traditionally have had single-family dwellings.\nTREB also said it supports provincial government consultations to \"spur on and speed up\" the development of different forms of housing.\n \n"}, {"author": "Meghan McCabe", "title": "St. John's housing prices will lead country in growth, according to Moody's", "description": "Economist says below-trend prices, drop in unemployment rate leading to predicted increase", "url": "http://www.cbc.ca/news/canada/newfoundland-labrador/st-johns-housing-prices-going-up-moodys-1.5149461", "urlToImage": "https://i.cbc.ca/1.5146804.1558629790!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-sale-regina-sask-housing-market-home-house-remax.jpg", "publishedAt": ["May 25, 2019 6:00 PM NT", "2019-05-26T11:26:15.806Z"], "source": "CBC News", "content": "For homeowners in St. John's it may seem like a long time coming, but Moody's Analytics is projecting housing prices to increase by more than six per cent over the next few years and lead the country in growth. \nThere are two main reasons for the projected rise: how low house prices are, and the improving unemployment rate, said director and head housing economist Andres Carbacho-Burgos. \nThe first is where house prices sit, compared with the $340,000 mark for single family homes in late 2015. \n\"Now they're at less than $300,000. That's over a 10 per cent decline,\" said Carbacho-Burgos, adding that has led prices in St. John's to be \"below trend.\"\nWhen asked if that decline over recent years is simply a correction for a previously hot housing market, Carbacho-Burgos said, \"probably not.\"\n\"The unemployment rate and the labour market in St. John's have improved significantly in recent months, and we expect it to remain that way for at least a couple of years,\" he said.\nThat's the second reason for the predicted rise in prices. \nCarbacho-Burgos said the unemployment rate in the province's capital city averaged around nine per cent from mid-2016 to late 2018, whereas it's now below eight per cent and expected to lower. \n\"The fact that the unemployment rate was at a cyclical high in 2016 to 2018 makes me wonder whether or not there was truly a hot housing market in St. John's as opposed to, possibly, the housing stock being displaced by new homes.\"\nCarbacho-Burgos told CBC Radio's On The Go that Moody's expects a reduction in new home construction to eventually affect those prices as well.\n\"When house prices are below what we calculate as trend, you get a couple of correction mechanisms,\" he said — mainly a slow in construction, which tightens the supply of houses.\nAt 12 to 14 months of sales, MLS listings indicate the ratio of inventory to sales in St. John's is much higher than the Canadian average, he said.\n\"It's the reason why house prices in St. John's are way below trend.\" \nAlong with fewer new homes being built, he said homeowners tend to keep houses off the market when prices are low. That should mean overall fewer homes for sale, tightening supply and helping prices go up. \nBut what about the falling prices of oil and gas in all of this?\n\"We believe the effect will be limited, in part because Newfoundland and Labrador in general has already had a significant degree of outmigration over the past three to four years, so it's hard to see this getting worse until energy prices really, really fall below our forecast,\" said Carbacho-Burgos.\nHe said we would need to hit the unlikely \"low oil price scenario,\" in which world oil prices are below $40 US a barrel, compared with a forecase of over $50 US, for outmigration from this province \"to really accelerate.\" \nRead more from CBC Newfoundland and Labrador\n"}, {"author": null, "title": "Metro Vancouver housing market to see modest price growth in 2020 and 2021, predicts CMHC", "description": "Buyers and renters can expect price increases due in part to continuing population growth across the region", "url": "http://www.cbc.ca/news/canada/british-columbia/metro-vancouver-housing-market-to-see-modest-price-growth-in-2020-and-2021-predicts-cmhc-1.5333608", "urlToImage": "https://i.cbc.ca/1.5277359.1582646722!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/cmhc-housing-starts-20190809.jpg", "publishedAt": ["Oct 24, 2019 1:18 PM PT", "2019-10-24T20:18:19.443Z"], "source": "CBC News", "content": "The Metro Vancouver housing market will remain \"balanced\" over the next two years with home prices expected to increase in line with population growth, according to the latest housing market outlook report from the Canada Mortgage and Housing Corporation.\nHousing sales and prices have dipped recently as a result of multiple factors — including rising mortgage rates and new taxes — but the CMHC predicts that starting in 2020 and through 2021, there will be a modest increase both in prices and sales volume. \nAttached homes, condos and apartments priced under $700,000 are expected to generate the strongest demand because \"homes in this price range can be accessible to buyers making a purchase based on their income compared with properties requiring substantial equity for a down payment,\" says the report. \nThe report says housing starts are expected to remain high, especially multi-family homes, which currently account for 88 per cent of unit starts.\n\"As densification continues and affordability challenges remain, multi-family units will account for the vast majority of new home construction,\" said Eric Bond, CMHC's Vancouver senior specialist.\nEmployment in the region is expected to help drive the new home market as unemployment rates remain low and job vacancy rates high. The report suggests employers in the region may need to increase wages in order to attract and retain employees.\n\"Full employment and rising wages will both contribute to household finances and consumer confidence, which in turn support major purchases such as housing,\" said the report. \nRenters are unlikely to see much relief. The report says the tight rental market will continue, driven by the net gain of population into the region, which will push up demand and rents.\nThe CMHC's chief economist said international trade tensions are considered a downward risk to the Canadian housing market.\n\"Arrears rates are very low on mortgages and that's a very positive thing,\" said Bob Dugan. \"But the level of debt in Canada is high and should there be some sort of a shock that causes unemployment to rise or the level of employment to drop, that can really have an impact on the performance of loans.\"\n"}, {"author": "Aaron Wherry", "title": "Pandemic or not, Canada still faces a climate crisis — and the clock is ticking", "description": "COVID-19 presents an unprecedented threat — and a unique opportunity to build a cleaner economy", "url": "http://www.cbc.ca/news/politics/pandemic-covid-coronavirus-trudeau-1.5566960", "urlToImage": "https://i.cbc.ca/1.4032860.1490029696!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/alberta-oil-pumpjacks-aurora.jpg", "publishedAt": ["May 13, 2020 4:00 AM ET", "2020-05-13T08:00:00.910Z"], "source": "CBC News", "content": "Had things worked out differently, the Liberal government's post-election agenda might have started to take shape this spring with a budget focused on addressing climate change.\nThat might seem like a missed opportunity now. But responding to an economic crisis brought on by a global pandemic is presenting the government with new opportunities to combat climate change — and the Liberals might be judged by how well they seize this moment.\nHad there been a budget this spring, it likely would have included some mention of at least two initiatives that are now part of the government's pandemic response: orphan well cleanup and climate-related financial disclosure.\nWith Alberta's economy already in dire need of assistance, federal aid for the work of cleaning up abandoned oil and gas wells was under consideration before COVID-19 and a steep drop in oil prices did deeper damage in March. To address all of those challenges, the Liberals announced $1.7 billion in funding for wells in April as part of a relief package that also included new assistance to help firms reduce carbon emissions.\nEnvironmentalists seemed to approve. So did Alberta Premier Jason Kenney. But demands for more help persisted.\nWhen the Trudeau government announced this week a program to provide loans to large and medium-sized employers (including oil and gas producers), it said that any borrowing would come with conditions — including a requirement to \"publish annual climate-related disclosure reports … including how their future operations will support environmental sustainability and national climate goals.\"\nProponents of climate disclosure — among them Mark Carney, former governor of the Bank of Canada — have called on firms to publicly account for how their business will be affected in future by both government policies to reduce emissions and the actual impacts of climate change. In theory, such disclosures would push investors to push companies to make environmentally sound decisions.\nIn 2015, the Financial Stability Board, an international body established by the G20, launched a task force on climate disclosure chaired by Michael Bloomberg, the former mayor of New York City. That task force came back with recommendations in 2017. Last June, the Liberal government's own expert panel on \"sustainable finance\" — chaired by Tiff Macklem, recently appointed governor of the Bank of Canada — advised the government to \"define and pursue a Canadian approach to implementing\" those recommendations.\nMany companies already provide some level of climate disclosure — a study by the Chartered Professional Accountants of Canada in 2019 found that 98 per cent of firms included some degree of disclosure in their financial filings. But just one company in the CPA survey was meeting the task force's proposed standards.\nThis week's announcement might help kick-start that change.\nAttaching such a condition no doubt also makes it easier politically to sell the pandemic loans policy to voters leery of using public funds to support large corporations, particularly oil and gas producers.\nBut the Liberals are promising to apply other conditions related to things like executive pay, collective bargaining agreements and dividends. Such things might seem like simple due diligence when dispersing public funds, but climate change also now seems to qualify as a fundamental consideration.\nThe Liberals should consider taking advantage of other opportunities to push for change, said Stewart Elgie, founder and chair of the Smart Prosperity Institute.\n\"Climate disclosure is one good way of accelerating the shift to a climate-smart economy,\" he said. \"They should also be looking for ways to tie economic relief to improved environmental performance.\"\nAs an example, Elgie cites the bailout of the North American automotive industry in 2009, which President Barack Obama's administration in the United States used to push for higher fuel efficiency standards.\nThe result was an industry that is arguably both more competitive and more environmentally friendly.\nAs the extent of the economic damage caused by COVID-19 has become clear, there have been calls to pursue a \"green recovery\" — for governments to focus their rebuilding efforts and economic stimulus on combating climate change. That remains the single largest opportunity here for driving some much-needed changes.\nBut it's also not clear yet when governments will be able to start pursuing recovery plans. Canada is still in the emergency phase, and individuals and businesses need aid to get through the current crisis.\nEven in the short-term, though, there will be chances to to deal with the climate threat — which will still be with us once the pandemic has passed.\nIn a recent white paper, policy analysts and consultants Ralph Torrie and Celine Bak proposed a $2 billion fund to help cities establish \"permanent corridors … for people walking and cycling to work and school, while maintaining physical distancing.\" In the midst of a pandemic, such routes would give some people safer ways to get around. In the long term, maintaining those corridors would promote environmentally friendly transit.\nBrendan Haley, policy director at Efficiency Canada, has suggested that efforts to increase the energy efficiency of homes and business can still be pursued during a time of physical distancing — such as online training for \"green building skills\" and virtual energy assessments.\nHaley also emphasizes the need to plan now so that governments and businesses can be ready to move when it's time to start implementing a recovery plan. Elgie also notes that updated building codes — currently being developed by the National Research Council — could help frame future stimulus spending on housing.\nThe Liberals also promised last fall to develop climate change accountability legislation that would set legally binding targets and establish third-party oversight — a promise that shouldn't necessarily be sidelined by a pandemic.\nThough COVID-19 clearly has become a historic crisis, the Liberals are still faced with a political and moral imperative to deal with climate change. Justin Trudeau's government might be defined by how it handles this virus and its effects, but it's unlikely to be excused, either by its supporters or by historians, if the threat to the planet is forgotten in the process.\nSetting aside budget plans might have been necessary. But 2050 — the year when Canada is supposed to reach net-zero emissions — isn't getting any further away.\n"}, {"author": "Mark Ting", "title": "Time to buy? What the pandemic means for Vancouver's real estate market", "description": "Mark Ting, On the Coast's finance columnist, on what lies ahead for buyers and sellers amid COVID-19", "url": "http://www.cbc.ca/news/canada/british-columbia/covid-19-may-real-estate-1.5562836", "urlToImage": "https://i.cbc.ca/1.5532588.1586915106!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/covid-19-vancouver.jpg", "publishedAt": ["May 10, 2020 7:00 AM PT", "2020-05-10T15:57:12.928Z"], "source": null, "content": "According to April's real estate numbers, sales activity and housing inventory in Greater Vancouver dropped 39 per cent and 34 per cent respectively.\nPrices remained flat as buyers balked at the thought of moving during a pandemic while sellers were hesitant to open their homes for viewings, resulting in significant declines in both supply and demand.\nOverall, the market appears to be balanced. Bidding wars are still occurring and it remains a sellers' market for condos under $700,000 and detached homes around $1.6 million, whereas the market for more expensive homes tends to favour buyers.  \nSo far, there hasn't been a lot of panic or forced selling, but I believe that could change in the fall.\nWhen trying to forecast where the market is heading, there are two variables that I will be closely monitoring — the post COVID-19 employment numbers and the expansion or introduction of new government programs created to combat the financial effects of the pandemic. \nA low unemployment rate does wonders for real estate valuations as it is an indicator that the economy is functioning well. Strong economies attract new investments, businesses, immigrants, temporary workers, international students, refugees — all of which increases demand for housing and results in higher rents and house prices. \nA weak economy does the opposite. People will not move here unless they think they can find a job, while recently laid off workers with few ties to Vancouver may leave. In other words, we see less demand and more supply.\nAccording to Moody's analytics, for every one per cent increase in unemployment, house prices typically drop about 4 per cent. Based on this ratio, if our unemployment rate were to double from pre-COVID-19 levels, home values would drop by roughly 20 per cent.\nThe main reason house prices are not currently dropping is due to government intervention. The various levels of government stepped in with a series of temporary programs to replace or subsidize the income of those affected by COVID-19. They also arranged for many of our expenses to be deferred — such as utility bills, taxes and mortgage payments. All these programs have bought struggling homeowners some time, and have taken the pressure off to sell their homes. \nBut what happens when the safety nets disappear? That is when the ill-prepared or vulnerable homeowners will be forced to sell.  Many of the government programs are expected to wind down in the summer and fall, and we may see a spike in new listings — a great time for buyers but terrible for sellers.\nIf I had plans to sell my home sometime in 2020 or early 2021, I would be listing my home sooner rather than later. While I'm not expecting a 20 per cent drop in value over the short term, it also wouldn't surprise me if it did happen. I also wouldn't be surprised if the government bailed out the housing market and valuations returned to all time highs. The B.C. government's tax base is heavily reliant on the construction and housing industries, so they can't afford to have housing valuations drop too low.   \nWhile I'm very cautious on real estate over the short term, I still think it's a solid long-term investment.\nMy advice to prospective buyers, if valuations drop by 15 to 30 per cent in 2020 or early 2021, consider leaving the sidelines as it could be the buying opportunity that many of you have been waiting for.\nIf you have a COVID-19-related story we should pursue that affects British Columbians, please email us at impact@cbc.ca\n"}, {"author": "Kate Porter", "title": "How should Ottawa grow? What councillors heard over 19 hours", "description": "The urban boundary debate will continue for a third day on May 19", "url": "http://www.cbc.ca/news/canada/ottawa/urban-boundary-public-delegations-two-days-1.5566424", "urlToImage": "https://i.cbc.ca/1.5541096.1587571972!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/urban-boundary-map.jpg", "publishedAt": ["May 12, 2020 6:06 PM ET", "2020-05-12T22:11:42.209Z"], "source": "CBC News", "content": "Over two long days of meeting online, Ottawa city councillors heard very different — and very strong — opinions about where and how to house an extra 400,000 people in the coming decades.\nCouncillors on the two committees that decide planning issues won't log on again until Tuesday, May 19 to discuss and vote on whether to expand its urban boundary for only the second time since amalgamation.\nThat's a week to ponder what they heard from more than 100 people, including development company executives, consultants, community groups and committed residents.\nHere are some of the key issues they grappled with.\n\"Affordability\" was likely the most uttered word over the 19 hours of discussion. Those involved in the development industry argued that not increasing the supply of land for home building would drive house prices sky high, putting them further out of reach for young people and new Canadians.\nLand prices have tripled since the city decided to hold the urban boundary back in 2010, said Kevin Murphy of Mattamy Homes.\n\"You're right on the cusp of unaffordable housing,\" added Andrew Brethour, a realtor who advises builders.\nBut other costs matter beyond the price of a house, such as transportation or proximity to social services, argued community organizations. \nDr. Eugenie Waters, for instance, said she has patients who are seniors who travel from the suburbs to her clinic.\n\"I really worry about us falling into this trap that it's more affordable for people to move out to the ... new suburbs, and there won't be the social services out there.\" \nMany presenters also wanted the city to show far more details about how much each of the three scenarios set out would cost the city in infrastructure, and the implications for its climate change goals.\nIn order to absorb tens of thousands more people in existing neighbourhoods, staff recommend building a lot more shorter, multi-unit complexes instead of relying solely on controversial high-rises. These lower-rise buildings could be made of wood instead of concrete, which is more expensive.\nArchitect Rosaline Hill agreed with the city planning staff's vision. She argued that the entire city should be intensified in this manner, with the first focus on areas that are the easiest to make walkable, such as those near transit.\nThat may mean many established communities, or what Coun. Jeff Leiper called the \"bungalow belt\" neighbourhoods within the Greenbelt, could see change soon.\nBut Josh Kardish of EQ Homes said while those older areas were \"ripe\" for mid-rise and infill, he questionned whether the city could build enough housing for an additional 400,000 people without apartment towers.\nThe meeting opened Monday with a motion by Coun. Eli El-Chantiry to protect prime farmland to disqualify any properties on the city's formal \"agricultural resource areas\" list to be included in the urban boundary.\nMembers of Just Food say that still leave open the possibility for development on some farms, like those outside the officially designated areas or land with poorer soils where animals graze.\nThe group called on councillors to tweak the motion further so that it captures all land used for agriculture, so that no more farmland becomes housing.\nEven staff's projection methods for how it calculated the how much additional lands will be needed came under fire.\nIt turns out, city staff used a different definition for how much intensification this city is achieving. Recently, the City of Ottawa was hitting 50 per cent intensification, far exceeding the 40 per cent goal in its official plan. \nBut for this boundary discussion staff said it makes more sense not to count collective housing for seniors or students. The \"goalposts had moved,\" as the Greater Ottawa Home Builders' Association tried to explain it. That dropped Ottawa's current intensification rate to just 38 per cent.\nMichael Wolfson, former assistant chief statistician at Statistics Canada now with the University of Ottawa, said he was \"baffled\" the city would omit retirement homes. \nCity staff also said in its report it had no real data on the resale housing market, so the number of households they expect Ottawa to need might be high. Wolfson said that data exists and is \"critical\". \n\"I'm afraid that the information provided to you by staff … is seriously inadequate for you, and for citizens like myself,\" said Wolfson.\n"}, {"author": "Darren Bernhardt", "title": "Métis raise flag above newly purchased Bank of Montreal building at Portage and Main", "description": "'It's like retracing and actually capturing a lot of our history': Manitoba Metis Federation president", "url": "http://www.cbc.ca/news/canada/manitoba/m%c3%a9tis-portage-main-bank-montreal-heritage-1.5565955", "urlToImage": "https://i.cbc.ca/1.5566303.1589313638!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/bank-of-montreal-building-in-winnipeg-new-manitoba-metis-federat.jpg", "publishedAt": ["May 12, 2020 3:10 PM CT", "2020-05-12T21:15:27.181Z"], "source": "CBC News", "content": "As Manitobans celebrate the 150th anniversary of the province, descendants of the Métis who paved the way for its creation are celebrating a renewed and prominent presence.\nThe Manitoba Metis Federation flag was raised high above the Bank of Montreal building at Portage Avenue and Main Street on Tuesday after the organization announced late Monday that it was buying the historic downtown Winnipeg landmark, which will become home to the Métis Nation Heritage Centre. \nWATCH | Historic day for the MMF​​​​​​:\n\"[We're] sending a message loud and clear that the Métis played a very important role in this province and we still do, even after 150 years of sometimes turmoil with this country and sometimes with this province. But at the end of day, we're still proud Manitobans,\" MMF President David Chartrand said.\n\"It's a proud day for us to be accessing that historical building and its location. It's like retracing and actually capturing a lot of our history, of our sadness, where our land was taken from us. Now we're taking something with such solid position in history back.\" \nManitoba became the fifth Canadian province on May 12, 1870, when the Manitoba Act received royal assent. It was officially enacted on July 15, 1870.\nThe act was based on a list of rights drafted by Louis Riel and his Métis provisional government and presented to the federal government as conditions for the province to enter Confederation.\n\"[It was] led by the only Indigenous peoples in Canada to ever negotiate a province into Confederation,\" Chartrand said.\nThe Bank of Montreal, built in 1913, stands just a 15-minute walk from where Fort Garry once stood, jutting out over what's now Main Street at Assiniboine Avenue.\nAt the end of 1869, Riel and others took control of the fort and took over the administration of the Red River area until an agreement was reached with Ottawa.\n\"So there's no doubt in our mind … the footprints of our ancestors walked through this area,\" Chartrand said.\nHe's been inundated with texts, calls and emails from people in the Métis community, he said.\n\"Over and over it's about just how proud our people are that this is happening. Everybody knows the historic significance of that location, right by the Red River. Of course we were called, at one time, the Red River Métis.\"\nAs part of the Manitoba Act, the federal government promised to set aside 5,565 square kilometres of land along the Red and Assiniboine rivers — which meet at The Forks near Portage and Main — for 7,000 children of the Red River Métis. However, the government failed to follow through and most of that land was never provided.\nIncreasing numbers of settlers and land fraud due to uncontrolled speculation forced many Métis to leave, in hopes of making a living elsewhere.\nIn 1981, the MMF began a land claim case against the federal government for the 1.4 million acres it was promised.\nIn 2018, the federation was finally awarded $154 million in compensation.\n\"I think it's going to lift a lot of eyebrows up: 'What's going on here? The Métis, where are they coming from? All of a sudden they're coming and buying some historic, some really landmark locations?'\" Chartrand said about the purchases the MMF is now making.\nThe Bank of Montreal \"is just one,\" he said. An announcement could be coming next week for another location in the downtown area and \"it's bigger than Portage and Main,\" he said.\n\"As they say in the movies, we're baaa-aack.\"\nWhen Chartrand became MMF president in 1997, he stood at the corner of Portage and Main, waving the Métis Nation flag.\n\"I remember saying 'One day, this will be ours,'\" he said. \"And I've made statements in the past that if we've got to buy our land back one acre at a time, we'll do that.\"\nThe MMF has been in negotiations with BMO Financial Group for some time and it was difficult to keep it quiet, Chartrand said.\nThe Bank of Montreal announced plans last fall that it would be moving across the street into the office tower at 201 Portage Ave. \nChartrand wouldn't reveal the purchase price, saying only that both sides reached a number they appreciated.\n\"Eventually that number will come out. I have to report it to my people,\" he said.\nOnce the transfer of the building is complete, the MMF will shift its business activities into it and begin to create the heritage centre, which will contain artifacts and stories about the Métis in Canada.\nChartrand is aiming for August as a grand opening for the business side of things, as long as restrictions due to COVID-19 will allow it. He didn't have a date when the heritage centre will be ready.\nChartrand said more news is coming at the end of the week, when the MMF will announce a massive hiring program that will include 500 summer students across the province.\nAnother 200 people who are skilled in construction and carpentry will be hired to do housing repairs and new builds, he said, adding the federation is also expanding its communications department.\n\"We already set the stage for the investment of how much money will be set aside for these jobs. It will be announced on Friday,\" Chartrand said.\nWATCH | Ray St. Germain performs 'I'm Mighty Proud I'm Metis':\n"}, {"author": null, "title": "Potential buyers staying home: April real estate stats in Edmonton show 55% drop in sales", "description": "'With the outbreak of COVID-19 ... this type of market decline is not surprising'", "url": "http://www.cbc.ca/news/canada/edmonton/edmonton-real-estate-coronavirus-april-2020-1.5554918", "urlToImage": "https://i.cbc.ca/1.5520276.1585919722!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-sale-sign-calgary.jpg", "publishedAt": ["May 04, 2020 2:07 PM MT", "2020-05-04T20:07:40.309Z"], "source": "CBC News", "content": "The grim toll of COVID-19 on the housing market can be seen in April real estate statistics, which showed both the number of listings and sales taking a spectacular hit in the Edmonton area\nThere were 3,759 residential units sold in the first four months of 2020, a 55-per-cent drop from the same period in 2019 in the region, which includes four surrounding counties, according to a Monday news release from the Realtors Association of Edmonton. \nThe 750 residential sales in April were 35 per cent less than the number of sales in March 2020, the association said.\n\"The Edmonton market experienced a significant decrease in year-over-year unit sales, with some downward impact on pricing,\" Jennifer Lucas, chair of the association, said in the news release. \n\"With the outbreak of COVID-19 and the social distancing measures currently in place, this type of market decline is not surprising,\" Lucas said.\nAfter the World Health Organization declared coronavirus as a global pandemic in March, open houses were banned by the Alberta Real Estate Association.\nHomes on the market are being \"shown\" through digital interfaces, including photos, videos and virtual-meeting apps like Skype or Zoom, while real-estate agents have also been advised by the association to avoid as much face-to-face interaction as possible with clients.\nThe pandemic hit just in advance of busy April-through-June period, when people traditionally buy and sell homes in advance of moving during the summer. \nThe drop in sales is partly explained by a similar drop in new listings. \nThe number of listings in the Edmonton area dropped by 29 per cent from March, but is down by a whopping 46 per cent compared to the first four months of 2019. \nThere were 1,871 residential listings in the region as of April 30, including the 1,366 in Edmonton.\nPrices took a hit as well, but not nearly to the same degree as sales and listings, according to the news release.\nThe average price of a single-detached home in the region was $410,200 — a four-per-cent drop from April 2019 but only a 1.5-per-cent drop from March 2020.\nPrices for condominiums and duplexes — while still depressed compared to 2019 — were up slightly from March. The average condominium price was $244,000, while an average duplex sold for $330,000.\n"}, {"author": null, "title": "Following Fort McMurray flood, mayor calls for additional financial aid", "description": "Damages to residences alone could top $100 million, Don Scott says", "url": "http://www.cbc.ca/news/canada/edmonton/flooding-fort-mcmurray-insurance-financial-aid-1.5554403", "urlToImage": "https://i.cbc.ca/1.5548946.1588609852!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/mcmurray-aviation-flooding.jpg", "publishedAt": ["May 04, 2020 9:41 AM MT", "2020-05-04T20:12:40.324Z"], "source": "CBC News", "content": "Without long-term financial assistance, many people in Fort McMurray whose homes and businesses were devastated by spring flooding will face financial ruin, says the region's mayor.\n\"In the big picture, we are going to need massive help. It wouldn't surprise me if the damages just to the residences was over $100 million. This is a massive disaster,\" said Don Scott, mayor of the Regional Municipality of Wood Buffalo.\nHe said most evacuees don't have adequate property insurance to cover the damages.\nScott is calling on the federal and provincial governments to extend disaster relief funding to the nearly 13,000 people forced from their homes last week.\n\"Very few people have coverage,\" he said in an interview Sunday with CBC News.\n\"The average coverage that I saw, and very few people had it, was $10,000. And I would say, the average person, the damage I saw — it varied from place to place — was over $120,000, so this could put people in financial ruin.\"\nScott said emergency cash for evacuees, announced last week by the Alberta government, will only provide temporary relief. The payments — $1,250 for adults and $500 for children — will cost the province $11.7 million for one week, Premier Jason Kenney said Wednesday.\nScott said many homeowners and businesses will struggle to rebuild if they don't get additional help.\nKenney has said that the Fort McMurray flood should qualify for the province's Disaster Recovery Program.\nUnder that program, the government would provide some financial support for recovery costs for critical public infrastructure and non-insured private infrastructure.\nThe area is now in \"the recovery phase,\" Scott Davis, director of Emergency Management for the Regional Municipality of Wood Buffalo, said Monday.\nPower has been turned back on for some 4,000 homes in the area, Davis said.\nA boil-water advisory is still in place for all neighbourhoods in Fort McMurray, Anzac, Draper, Gregoire Lake Estates and Saprae Creek Estates.\nAlberta Health Services (AHS) will not remove the advisory until all of the 375-kilometre potable water distribution system has been flushed, disinfected and tested, according to a release from the regional municipality. The advisory will be lifted incrementally, as each phase of the work is completed and then approved by AHS and Alberta Environment and Parks.\nThat work, which will be done in five phases, is expected to start Friday and finish in early September, the release said.\nFort McMurray has been hit hard by natural and economic disasters in recent years.\nMany residents are still dealing with the aftermath of the 2016 wildfire, the costliest disaster for insurers in Canadian history. In all, about 2,400 homes and buildings burned in the fire and many homeowners lacked the proper insurance, slowing rebuild efforts.\nMeanwhile, people in the northern Alberta community are reeling from job losses related to the pandemic and a gutting drop in oil prices.\nPeople who have lost everything for a second time may decide to leave the community altogether, Scott said.\nThe flooding began April 26, when a 25-kilometre sheet of ice effectively dammed the Athabasca River, forcing the Clearwater River to reverse course and flood the city's downtown core. An estimated 1,230 structures were damaged. \nThe last evacuation orders were lifted late Saturday but it may be weeks before people can truly return home. \nMany homes swamped by flooding remain uninhabitable. Basements remain waterlogged and caked with mud. There are concerns about asbestos and mould.\nWith many homes unsafe to live in, the municipality announced on the weekend that emergency housing provided through the Red Cross was being extended until May 10. \nRed Cross is also providing flood cleanup kits to residents, Davis said Monday.\nBrad McCoy, president of Norfort Gymnastics Association, said the gym, which overlooks the Clearwater River, was flooded with more than five feet of water.\nThe waters have receded but the gym remains caked with a thick layer of river mud. \n\"It looked like a mud bomb when off in there,\" he said. \"At the end of the day, it's probably a lot worse than we thought.\"\nMcCoy doubts the non-profit agency's insurance policy will cover the damages.\n\"We don't know if we have insurance. In fact, we're pretty sure we don't,\" he said. \"Hopefully we can get some support from the city and the provincial government but right now we're just trying to clean up and salvage what we can.\n\"Are we going to make it through? Absolutely ... But at the end of the day, it's going to be close.\" \nScott said he has been in talks with provincial and federal officials and remains optimistic that additional relief is coming for evacuees.\nEven with long-term financial aid, he expects it will take several months for the community to recover.  \n\"Unfortunately, the difficulty is, people are really back in only to assess the damage,\" Scott said. \n\"The recovery period is going to be very long and very difficult.\"\n"}, {"author": "Jorge Barrera", "title": "Competition for new N.S. RCMP dispatch centre 'falsely stacked' against First Nation's bid: chief", "description": "Millbrook First Nation wants re-do of site selection process", "url": "http://www.cbc.ca/news/indigenous/ns-rcmp-communications-centre-millbrook-1.5556652", "urlToImage": "https://i.cbc.ca/1.4867275.1574470021!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/chief-bob-gloade.jpg", "publishedAt": ["May 06, 2020 2:41 PM ET", "2020-05-06T18:41:37.780Z"], "source": "CBC News", "content": "The chief of Millbrook First Nation says the Nova Scotia RCMP's competition for its new communication centre was \"distorted and biased,\" arbitrarily inflating the price of his community's proposal to reach a \"predetermined outcome.\"\nThe Nova Scotia RCMP announced in 2019 that it had decided to move its communications centre from Truro, N.S., to the RCMP's provincial headquarters in Dartmouth. It's set to become operational in 2021.\nThe centre handles 911 calls, calls from the public and handles dispatches for 54 detachments and districts.\nAccording to an RCMP internal report, the RCMP added $1.6 million to Millbrook First Nation's proposal and put down zero rent for its preferred option — the headquarters in Dartmouth.\n\"Millbrook First Nation provided a proposal in good faith, but we now know that the competition was falsely stacked,\" wrote Chief Robert Gloade in a March 25 letter to Public Safety Minister Bill Blair requesting a re-do of the contract process.\n\"Obviously the first competition was tainted in favour of one outcome. Millbrook First Nation is asking that this competition be repeated but performed by an objective assessment team with no predetermined outcome.\"\nCopies of the letter were sent to Indigenous Services Minister Marc Miller and Crown-Indigenous Relations Minister Carolyn Bennett.\nBlair's office referred questions to the RCMP, as did Bennett and Miller's spokespeople. \nNova Scotia RCMP said the decision to relocate the communications centre to Dartmouth was the result of \"months of follow-up work\" that came to the best conclusion. \n\"Our focus during the study and throughout the decision-making process was on the health and safety of our employees, operational requirements and fiscal responsibility,\" it said in an emailed statement.\nThe RCMP reviewed six options before deciding on its headquarters, according to an internal 2017 report obtained under the Access to Information Act by former Liberal MP Bill Casey and provided to CBC News. \nThose options included doing nothing, upgrading the existing Truro centre, moving to a new location in the city, building a new location in the city or moving the centre to Millbrook First Nation. \nMillbrook's proposal was the second cheapest relocation option, behind the headquarters move. However, the RCMP report assigned an extra $1.6 million to every relocation except its headquarters option. \nThe figure is based on how much the Mounties pay the federal Public Works department every year to maintain empty space in their headquarters that could be rented to other federal agencies. \nThe RCMP also assigned zero rent to its headquarters option. Yet, according to Public Works records provided by Casey to CBC News, the cost of rental space in the building housing its headquarters is $547 per square metre and total current annual rent is $10.5 million.    \n\"The process wasn't a fair process,\" said Gloade in an interview.\nMillbrook First Nation sits about five kilometres south of Truro in the geographic centre of the province. It proposed to place the emergency communications centre in the Millbrook First Nation Power Centre, which is on a high priority power grid that runs underground and also serves a hospital a kilometre away. \nGloade said the advantages were many with his community's proposal. He said the existing employees at the Truro centre would not have to move to keep their jobs and there is lots of room for expansion in the commercial building.\nMillbrook already acts as the base for Nova Scotia Power whenever major natural events cause widespread power outages, Gloade said. It also hosts an Onex Solutions Inc. data centre that holds data from the provincial education department and its cannabis operations, he said.\nCasey, who didn't run for re-election but raised the issue repeatedly while in Parliament, said the RCMP wanted the centre placed at its headquarters in Dartmouth and manipulated the competition to get their predetermined outcome.\n\"They cheated Millbrook First Nation out of a chance at this,\" said Casey.\nCasey said there were major problems with the RCMP's selection process.\nThe RCMP's ranking chart for each of the six main options was based on seven categories using a three rating system — zero if it didn't meet standards, five if it met minimum standards and 10 if it met or surpassed standards, according to the 2017 report. \nThe seven categories were: health and safety, consolidation of resources, functionality of accommodations, financial impact, human resource sustainability, level of disruption and potential for expansion.\nThe RCMP headquarters option rated 10s across the board.\nMillbrook's proposal rated a five on financial impact — primarily on the added $1.6 million, plus rent; a five on human resource sustainability, meaning the ability to staff the centre from the local population and a zero on ability to expand.\nIt scored an overall rating equal to the options of relocating to another building in Truro or constructing a new facility in the city — but at a cheaper overall price, according to the report. \nCasey questioned why the First Nation proposal would rate so low on human resource sustainability since the centre in Truro has maintained its staffing for over a decade and all its employees would not have to relocate. \nHe also challenged the low rating on ability to expand when the centre would be placed in a nearly vacant commercial building. \nCasey said the move to RCMP headquarters would also potentially put people at risk in Nova Scotia.\nThe decision to move the centre to the Mounties' Nova Scotia headquarters would place it about 10 kilometres from the Halifax Regional Police's own communications facility. \nA 2004 RCMP report that initially led to the centralizing of communications at the centre in Truro specifically recommended against placing it in Halifax because it posed a risk that one event could undermine the communication centres of both the regional police and the RCMP. \nSeveral emergency organizations, including the U.S. Federal Emergency Management Agency, recommend placing emergency operations centres in separate locations.\n\"To me it became a safety issue for all of Nova Scotia,\" said Casey.\nThe Nova Scotia RCMP said in a statement that it has contingency plans should an event undermine its communications centre once it's moved to Dartmouth. The statement said these continuity plans passed a third-party review.\n\"Contingency plan for 'H' Division RCMP includes a back-up RCMP [communications centre] located outside of the [Halifax Regional Municipality] and portable equipment that would allow us to restart operations should both the primary and back-up [centre] be non-operational,\" said the statement.\nThe 2017 report made no mention of the 2004 recommendation in its ranking of potential sites.\n"}, {"author": "Kate Porter", "title": "Ottawa has 80,000 more suburban houses in its future. Here's what that could look like", "description": "City staff, planners and some politicians want a denser city, but what will it take to shift the culture?", "url": "http://www.cbc.ca/news/canada/ottawa/urban-boundary-density-debate-ottawa-1.5492618", "urlToImage": null, "publishedAt": ["May 01, 2020 4:00 AM ET", "2020-05-01T08:00:00.572Z"], "source": "CBC News", "content": "Rachelle Lecours relaxes in her sunny, tidy bungalow in Orléans, reflecting on how much the Ottawa suburb has spread over four decades.\n\"I sort of feel guilty for being part of this growth,\" Lecours said. As her family grew over the years, they moved from one new development to another, seeking new home features and upgrading their garage. It was a \"bad habit,\" she now says.\nHomes on the fringes of the city are as popular as ever. People line up when a builder releases a new block of housing to lay money on a unit.\nBut city planners and politicians alike know that growth comes at a cost — pipes, transit, greenhouse gas emissions — and have talked for years about growing in a more compact way, and packing more homes into existing areas to limit those downsides. \nYet, in a big report to be debated at a virtual city committee meeting May 11, city staff say what's realistic is to expand the urban boundary to allow an extra 23,300 homes at the fringes of the suburbs by 2046. That's on top of the 66,300 units already in the pipeline.\nSome 88 per cent of those yet-to-be-built units would be houses that fit one family, with their own front door. The rest would be apartment units.\nCoun. Jeff Leiper was shocked city staff would recommend adding so much land — the 1,281 hectares designated for new urban areas is bigger than his entire ward of Kitchissippi.\nHe's also disappointed by the calculations staff have done, saying it appears they've based the need for future land on the housing trends of the past. Leiper wants the urban-rural divide to stay where it is.\n\"If we're going to be sustainable, if we are going to have 15-minute neighbourhoods, if we're going to have affordable public transit, if we're going to keep our taxes as low as possible, then we can't just give in to market demand for single-family homes,\" Leiper said. His ward in the core is the epicentre for new highrise towers and pricey infill developments.\nBut Ottawa's mayor agrees with city staff, who say holding the urban boundary is too ambitious. \n\"[That's] easier said than done. You've seen some real battles over the years. Everyone talks a good line about intensification, but when it's in their community they're against it. There are dozens of examples,\" Jim Watson said.\nWatson calls the scenario staff prefer a \"balanced approach.\" Ottawa's population is projected to rise by 400,000 to 1.4 million people by 2046, and the city sees splitting the projected 195,000 more households it would need almost evenly between existing built-up areas and undeveloped parcels. \nThe city can't risk supplying insufficient space for the expected homes. The Ontario government requires Ottawa show it has enough.\nThat's not to say the scenario staff propose doesn't call for much more intensification than happens now. It does. By 2046, 42,700 more apartments, as well as 49,400 single-detached, semi-detached and row homes could elbow into existing Ottawa neighbourhoods\nStaff have even worked with a local architectural firm on a new kind of structure that might help meet the needs of Ottawa families while building a city that's more dense: the \"613 flat.\"\nThat is, six-rooms and three bedrooms per unit in short buildings that blend in with their neighbours. It offers the elusive \"missing middle\" style of housing — neither a house, nor a highrise apartment.\nThe problem, staff write, is it takes time to create policies, and more time yet to get the building industry and housing market to shift to building a new kind of lifestyle, and at the right price people can afford.\nA planner who studies how cities grow and change says a big reason families especially keep flocking to the suburbs is that North American cities have not been very successful at delivering them exactly these kinds of options.\n\"Most of our cities have done either really high density in the centre, or quite low density in the form of single-detached dwellings,\" said Markus Moos, an associate professor at the University of Waterloo's school of planning. \"So if you're looking for green space immediately outside your home, single-detached dwellings are often the only affordable alternative.\"\nOn the one hand, governments have to be sure they give neighbourhoods the good transit, amenities and green space they need, Moos said. Ideally, before a new development is built, so as not to lock in car-centric habits.\nBeyond that, Moos said better ideas are needed to make sure people consider the full cost of where they choose to live.\nHe points to the idea of \"location-efficient mortgages\" — financing incentives for homebuyers who are less reliant on their cars.\nAnd then there's mindset. \n\"I would like to call for a cultural shift. We don't need to have a backyard in order to raise our kids. We don't have to live in a house,\" said Naama Blonder, an architect with Smart Density in Toronto\nBlonder contributed to that city's policy for how to make highrise towers more family-friendly. Many newcomers to Canada come from countries where dense living is the norm, she noted. Buildings here just need to have families in mind: units with enough bedroom space and room for a stroller, as well as common areas for teens to do homework.\nAnd, Blonder added, when battles about new highrise proposals happen, focus less on how tall a building could be, and more on pushing for a great street-level vibe and pathways that connect people to transit and parks.\nIn the meantime, families continue to choose Ottawa's far-flung suburbs because they're affordable. They also like the newness, lack of maintenance and, sometimes, having space for multiple generations to live under one roof, said Deborah Burgoyne, president of the Ottawa Real Estate Board.\nBut subdivisions themselves are changing slowly, and many look nothing like the big lots on winding crescents of old. New suburbs are more compact. When the city issued a record number of building permits in 2018, more were for semis and stacked townhomes than for single-detached models. Some apartment buildings are going up.\n\"Toodle around and you won't believe what's out there now,\" Burgoyne said.\nAs for Lecours, she still loves her community in Orléans, she just wishes there were more small coffee shops and community gardens, and more housing choices for renters and downsizing seniors.\n\"If they plan properly, I think it is OK to expand,\" she said. \"But it has to be done in a way where it serves the people.\"\n"}, {"author": "Joanne Chianello", "title": "The urban boundary debate is vitally important, so should it happen online?", "description": "Monday's virtual committee meeting a test of untried process at city hall", "url": "http://www.cbc.ca/news/canada/ottawa/urban-boundary-untested-committee-format-1.5561471", "urlToImage": "https://i.cbc.ca/1.3314590.1580407926!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_780/ottawa-city-council-table-in-andrew-haydon-hall.JPG", "publishedAt": ["May 09, 2020 4:00 AM ET", "2020-05-09T08:00:00.484Z"], "source": "CBC News", "content": "There have been many firsts in Ottawa's municipal arena during these COVID-19 days, from virtual council meetings to Zoom news conferences to online community open houses. \nOn Friday, the latest \"first\" came from Ecology Ottawa and a number of other groups, which held an online rally to call for holding the urban boundary steady. \nAs far as rallies go, it lacked chanted slogans and crowds waving placards. But while it didn't have the visual and audible impact an offline rally might, it did attract more than 500 people. Who can remember the last time an in-person rally attracted that many people to city hall?\nThe rally is in advance of one of the most important firsts ever at city hall — a major policy debate Monday that will occur online, with public delegations phoning in their comments.\nThe once-in-a-decade issue is the urban boundary expansion, a policy decision that will literally affect the growth of this city for decades to come. \nThe crux of the argument is this: the city says we need to add 181,000 homes to the city in the next 25 years or so.\nThe hold-the-liners want those new homes to be accommodated in existing neighbourhoods and on empty land already approved for residential development.\nThe city's planners — and Mayor Jim Watson — don't believe residents or builders are prepared for the sort of change communities would undergo if the boundary remained steady. Instead, they're advocating to add up to 1,650 hectares to Ottawa's urban edges.\nMore than 23,000 new homes would be built in these newly urbanized areas.\nAnd home builders have suggested that even 1,650 hectares won't be enough to absorb Ottawa's growing population, which the city forecasts at 1.4 million by 2046.\nAdd in serious questions about housing affordability — there are many points of contention about how, or even if, border expansion affects house prices — plus rising infrastructure costs in a spreading city, some communities' unwillingness to accept dramatic change, and whether expanding the urban boundary squares with the city's declaration of a climate emergency, and you've got yourself one messy policy debate.\nIt's hard to imagine, then, why anyone thought the urban boundary debate would be the ideal test-case for something the city has never tried in its history.\nEveryone is figuring out how to live with the COVID-19 pandemic, including city hall, where councillors have met for three virtual council meetings so far. \nThey went fine, but the public isn't allowed to participate at council the way they are at committee. When council voted in late March to allow virtual committee meetings, it directed staff to figure out how to let the public speak, starting with the one on the urban boundary.\nThe rules for the virtual meeting will be more stringent than in-person meetings. If you want to give your five-minute deputation, you have to register online by 9 a.m. Monday, before the meeting starts. In so-called normal times, members of the public could keep signing up to speak right through the meeting, until councillors began debating.\nAnd if you can't or are not inclined to register online, you could have done so by phone or email —but that deadline was Friday evening.\nThe mayor argued on CBC's Ottawa Morning this week that sharing one's opinions virtually actually makes it \"easier for the public to participate in the process, simply because you don't have to go and get daycare, you don't have to pay for parking or come down to city hall.\"\nHe may have a point: as of Friday evening, a whopping 150 people had signed up to speak — and that's on top of the 150 who've already sent in written comments. The last time we saw that kind of action at city hall was for the Salvation Army debate, which spanned three exceedingly long days. \nCoun. Shawn Menard, who's been calling for the urban boundary to remain steady, said at Friday's rally: \"This vote really shouldn't be happening at this moment.\"\nHe argued more time is needed to question many of the assumptions made in the staff recommendations, from the financial implications of expanding the boundary to the declaration that the public wouldn't accept intensification.\nBut perhaps another reason the vote shouldn't happen is because it's a major policy decision being made in the most unusual times most of us have lived through. \nYes, there's been a year of consultations.  And the city says more than 45,000 people \"have been reached.\" The report's been out for three weeks — longer than is legally required — but during a time when we are preoccupied with a dramatic and stressful pandemic.\nThe city has argued that the urban boundary question must be decided soon because it paves the way for other major policies that follow, including the official plan and transportation master plan updates. But city manager Steve Kanellakos mentioned recently the transportation plan work may have to be put off anyway, due to COVID-19 related constraints facing staff. \nSo what's the rush?\nIn fact, there is no legal reason this decision needs to be made now. Council put off a byelection for months, so it could certainly have given the public a bit more time to adjust to the COVID-19 reality, to start paying attention to issues other than handwashing and physical distancing.\nAt the very least, it could have chosen a less vital issue with which to experiment with an untested democratic process.\n"}, {"author": null, "title": "Sask. not seeing same COVID-19 impacts on housing market as rest of country", "description": "'We were seeing a lot of buyer confidence in the beginning of the year': realtor", "url": "http://www.cbc.ca/news/canada/saskatchewan/real-estate-market-regina-covid-19-1.5533914", "urlToImage": "https://i.cbc.ca/1.5013574.1579367230!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/digital-mortgages-20190210.jpg", "publishedAt": ["Apr 16, 2020 5:00 AM CT", "2020-04-16T11:00:28.182Z"], "source": "CBC News", "content": "The CEO of Royal Lepage says now is not the time to go out and shop for a new home — or sell.\nPhil Soper said 2020 was off to a \"boisterous\" start as more homes were selling in volume before a state of emergency was declared in Saskatchewan four weeks ago because of the COVID-19 pandemic.\n\"We believe that things will ease and people will be able to move into a very different buying and selling process,\" Soper told CBC Radio's The Morning Edition.\n\"I'm not saying things will return to normal in 2020, but the market will loosen up as people's stay-at-home restrictions are lifted.\"\nSaskatchewan's housing market has not been negatively impacted to the extent of the rest of Canada about a month into the pandemic.\nHome sales fell 14.3 per cent in March nationally but the Canadian Real Estate Association says it is too early to determine the pandemic's effect on prices.\nSaskatchewan sales dipped 6.2 per cent on a year-over-year basis (March 2019 compared to March 2020) while prices dropped 5.1 per cent.\nThere were three more residential sales made between March 18 (421) than there were during the same time last year (418).\n\"We were seeing a lot of buyer confidence in the beginning of the year,\" said Brin Werrett, a realtor with Royal Lepage, of Regina's market.\n\"A lot of young buyers out pulling the trigger on houses, where last year, maybe they were a little bit hesitant.\"\nSales were down 6.2 per cent overall but the Saskatchewan Realtors Association says housing sales saw increases in several of the province's largest cities on a year-over-year basis.\nThere were 274 sales in Saskatoon last month, a six per cent increase. That grows to 7.2 per cent when the immediate Saskatoon region is considered.\nThe average price of a home in Saskatoon is about $347,189.\nNew listings fell from 14.2 per cent in the the Bridge City compared to last year. Active listings are down, too.\nIt's a similar story in Regina, Swift Current, Prince Albert, North Battleford and Yorkton. \nSales bumped up just under two per cent in Regina while the immediate region saw an 11.5 per cent increase in sales. New listings in the city went down by 19.5 per cent.\nThe average price of a home in the Queen City rose slightly to $307,140.\n"}, {"author": null, "title": "The economy with a capital 'E'", "description": "We dive into the markets, energy and housing to find out the COVID-19", "url": "http://www.cbc.ca/radio/costofliving/the-economy-with-a-capital-e-1.5542514", "urlToImage": "https://i.cbc.ca/1.5543343.1587685752!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/the-economy-with-a-capital-e-markets-energy-and-housing.jpg", "publishedAt": ["Apr 24, 2020 10:30 AM ET", "2020-04-24T14:30:00.941Z"], "source": "CBC Radio", "content": "The coronavirus pandemic has sent stock markets on a roller-coaster ride. From historic drops to multi-day rallies, investors aren't the only ones feeling the whiplash. \nClick here to listen as Paul Haavardsrud looks at how to interpret the latest round of gains on the stock market.\nIf negative oil prices caught you by surprise this week, you're not alone. When the futures market closed on April 20, 2020, the West Texas Intermediate oil contract sat at -$37.63.\nClick to hear senior producer Tony Seskus, from CBC's Western Business Unit, explain what sub-zero pricing mean for the Canadian economy.\nBelieve or not, some folks are still buying and selling homes during the pandemic. Listings have dropped dramatically but prices are, for the most part, holding up … for now. How stable is real estate in Canada, and what could happen if it starts to crumble?\nClick here to listen as CBC's senior business correspondent Peter Armstrong dives into Canada's real estate market.\nClick 'Listen' at the top of this page to hear the whole episode or download the CBC Listen app.\n"}, {"author": "Hallie Cotnam", "title": "Ottawa's hot housing market cooled, but not frozen, by COVID-19", "description": "Sales down 70% but some buyers, sellers forge ahead", "url": "http://www.cbc.ca/news/canada/ottawa/covid-19-real-estate-ottawa-sellers-market-reduced-inventory-1.5539841", "urlToImage": "https://i.cbc.ca/1.4906657.1587666422!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/crea-home-sales-20180413.jpg", "publishedAt": ["Apr 25, 2020 4:00 AM ET", "2020-04-25T10:25:58.222Z"], "source": "CBC News", "content": "Ottawa's hot housing market was off to a prosperous start this year. Then came the coronavirus.\nBut while the pandemic has definitely put a damper on things, some homebuyers continue to buy, and some sellers continue to sell. Here's how they're doing it.\nDon Collins is trying to sell his four-bedroom, 2,400-square-foot bungalow in Carp before moving to a new home in Manotick.\nHe put the house on the market just before the COVID-19 crisis, and is asking $779,000. There were a few showings earlier in March, but those have now dried up. He's had no offers, but he's not panicking. He hasn't lowered his price.\nCollins believes the bungalow, with an in-law suite on the main floor and another unit in the basement, would be perfect for families hoping to get elderly relatives out of long-term care homes, where the virus has taken hold.\n\"We're close to Almonte, and all I can think of is the people in the rest homes,\" he said. \"We're not in a rush to sell, but I think the house is of value to somebody.\"\nCollins said he hasn't decided on his next move, and the uncertainty surrounding the pandemic isn't helping.\n\"Leave it on the market or take it off? At the end of the day, nobody knows where we're going to be in six months.\"\nThat uncertainty is keeping many people out of the market at a time of year that's traditionally the busiest. But not everyone is lying low.\nTrinh Yogaratnam and her husband had planned to list their semi-detatched home in Old Ottawa South at the end of March. They'd already purchased a new home in the Glebe with an August close date. Then COVID-19 struck. \n\"We decided maybe we should just hold off. But then … we realized that it wasn't just a pandemic. It might be a deep recession,\" she said.\nYogaratban said their realtor, Shan Cappuccino, told them the market was \"still quite buoyant,\" so the couple decided to go ahead. \nThe house was listed April 14. The family moved into an Airbnb rental for a week while their realtor held showings — following strict physical distancing protocols, of course. Prospective buyers could also take a virtual tour.\n\"We got offers,\" Yogaratnam said. \"We actually got six offers.\"\nThe house sold April 21 for more than their asking price, with no conditions.\n\"I was shocked. I was pleasantly surprised,\" Yogaratnam said. \"We were reading all the articles leading up to it seeing how the real estate market was kind of tanking and how home sales were decreasing. I realized very quickly that when you say home sales, it's not synonymous with home prices.\"\nShe said they have no regrets about forging ahead.\n\"It is a little bananas to be doing it during this time,\" she said. \"But on the other hand, there are still people looking. Some of the people that made offers on our place had already sold theirs. So there was desperation on their part to buy as well as [on] our part to sell.\"\n\"At the beginning, it was a complete shutdown,\" said Ottawa realtor Gloria Yankowich.\nBut now, six weeks in, things are starting to change, she said, as buyers, sellers and agents figure out creative ways to mitigate their risk through virtual tours and conditional sales.\n\"I don't know how many of us in the past have bought a house sight unseen, but it is happening,\" Yankowich said.\nAccording to realtor Paddy McCarthy, agents have been deemed essential so people can avoid \"financial catastrophe.\"\n\"Most people don't want to [list], but there are people who don't have a choice,\" he said. \"In February, we might have received seven offers on a place. Now there's only two or three, but they're still selling.\"\nNevertheless, realtors know there could be lean times ahead, especially if the slowdown lingers into the summer.\n\"We work in a high-risk, high-reward industry,\" McCarthy said. \"There will be a lot of realtors leaving the industry if they haven't set aside enough [savings] to weather this storm.\"\nRealtor Peggy Blair said she's also encountering clients who simply don't have a choice.\n\"I've met two people this week who are paramedics who are starting with the City of Ottawa, moving here from other centres. They have to find places to live,\" she said.\nBlair points out the Ottawa real estate market was \"superheated\" right up until the pandemic.\n\"We were already in a situation of … unprecedented tight inventory. It's simply gotten tighter because people who don't have to sell are not selling.\"\nAnd don't expect a COVID-19 discount, Blair warned.\n\"I have some prospective buyers ... who have been sitting on the fence hoping that there will be bargains out there, and I have to keep telling them at this point there are no bargains,\" she said. \"I was involved in a multiple offer situation on Friday. That property sold for … $42,000 over asking. They had 12 offers. Pre-March 15, they probably would have had 30 offers.\"\nBlair was able to find a house for those paramedics. \"They're actually moving in this weekend,\" she said.\nListings have \"definitely dropped to a trickle,\" said Deborah Burgoyne, president of the Ottawa Real Estate Board. \"Some people are actively out there trading, but I would say the majority of them are not.\"\nBurgoyne said the year was off to a great start before the pandemic.\n\"We had surpassed last year's numbers, and then starting the third and fourth week of March we started to decrease. And the first two weeks of April, we're significantly lower.\" \nBurgoyne said despite that, she's not surprised some people are still buying homes.\n\"There was a real pent-up demand. There were a lot of people that couldn't get into the market. They were pursuing multiple properties and losing out for one reason or another.\" \nThe pandemic might actually help some families looking to buy, Burgoyne said. \"You know what? Maybe I'll have a chance because there won't be 10 people pursuing this property. There will be three.\"\nThat's likely to continue the longer the pandemic goes on.\n\"If you're priced at market value, I still believe you're going to have a good return,\" she said. \"It's not a feeding frenzy the way it was.\"\n"}, {"author": "Jennifer La Grassa", "title": "Real estate association says Hamilton home sales crashed, local realtors disagree", "description": "The national realtors association says market should have seen 25 per cent more sales", "url": "http://www.cbc.ca/news/canada/hamilton/hamilton-housing-market-drops-1.5532953", "urlToImage": "https://i.cbc.ca/1.4277867.1505954738!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-sale-hamilton-housing.jpg", "publishedAt": ["Apr 20, 2020 1:39 PM ET", "2020-04-21T10:41:41.423Z"], "source": "CBC News", "content": "Hamilton's housing market should have seen much higher sales than it did last month, according to the Canadian Real Estate Association (CREA), but COVID-19 kept sellers at bay. \nA report Wednesday from the national realtors association says that in Hamilton-Burlington \"sales declined\"  by 24.9 per cent from February to March, second only nationally to Calgary, which saw a 26.3 per cent drop. But the statistics have caused some confusion among local agents on the Realtors Association of Hamilton-Burlington (RAHB), as their numbers show that sales were actually up 10 per cent over the previous month. \nCREA spokesperson Pierre Leduc said the percentages in its report refer to March estimates based on past trends and current data. \nIn short, he said, Hamilton-Burlington should have had 25 per cent more sales than it did.\nAs it stands, the month had 1,098 sales. Compared to February, Leduc agreed that the region actually saw 10 per cent more sales. \nThe nearly 25 per cent decrease is the result of CREA seasonally adjusting the raw data reported by RAHB. \nAccording to CREA, seasonally adjusted data removes any fluctuations or abnormal periods (i.e. holidays) that would influence the numbers. \nCREA makes every month 30 days long with four weekends and excludes holidays and seasons— this averages out the data and ensures that external factors are not causing monthly highs or lows. \nOnce they did this to RAHB's numbers, CREA found that \"sales for the month should have been much higher.\" \nNationally, CREA reported that the housing market saw a 14.3 per cent drop. \nIn the coming months, should the pandemic continue, CREA anticipates that housing prices will also drop. \n\"(COVID-19 has) taken the wind out of the sales,\" Leduc said. \"Basically both buyers and sellers have moved to the sidelines to figure out a new normal.\"\nLocal RE/MAX realtor Conrad Zurini said CREA's numbers \"should have been presented in a better way.\" \nWith the way sales were progressing, Zurini said, it makes sense that March was \"poised\" to do 25 per cent more sales. \nBut, he added, it's important to note that the month did still see an increase. \nAccording to Zurini, February's sales were \"off-the-charts,\" with the month seeing a 30 per cent increase since January and a 25.5 per cent increase since February 2019. \nSo when comparing February to March, it would look like a large dip. \nWhen comparing March 2020 to March 2019, reports from CREA and RAHB state that sales only declined by 3.1 per cent. \nWhile Zurini said COVID-19 has had an impact on the market, he argues that the statistics from CREA make it seem worse than it was. \n\"January and February saw increases in sales and new listings, as well as average price. For March there was growth at the beginning of the month; however, COVID-19 infiltrated our communities mid-month and slowed activity in the latter half,\" RAHB President Kathy Della-Nebbia said in a press release from April 2. \n\"We are seeing the impact on our market activity and expect to continue to see a slowing of the market as our communities focus on this unprecedented fight.\"\n"}, {"author": "Troy Turner", "title": "Soup for you! Corner Brook store donating bowls of soup", "description": "Owner says COVID-19 pandemic has led to increased need for people", "url": "http://www.cbc.ca/news/canada/newfoundland-labrador/corner-brook-free-soup-1.5521047", "urlToImage": "https://i.cbc.ca/1.5521070.1585941869!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/free-soup-greg.jpg", "publishedAt": ["Apr 03, 2020 5:02 PM NT", "2020-04-03T19:32:51.279Z"], "source": "CBC News", "content": "A Corner Brook store is doing its part to help those in need, one bowl of soup at a time.\nMr. Wilson's Convenience and Take-out on Humber Road is giving away bowls of soup to anyone looking for some, no questions asked. Plus, the store will deliver to those who are unable to pick it up themselves.\n\"I think now, in this time, anybody who has a little bit extra and thinks that they can help somebody out, especially people who are continuing to work you can't spend your money on other stuff now so we can all do something to help each other out,\" said owner Greg Price. \nPrice also owns a vending business that takes him throughout the city every day, supplying and servicing the machines. Since the COVID-19 pandemic has meant a lot less activity with the vending machines, he's found himself with some extra time. \nAnd he knew he wanted to use it to help others. In the past, Price has helped his parents-in-law with making soup for those in need, so e figured it was the natural choice.\nHis first batch saw the delivery of 57 bowls throughout the city and about the same amount picked up at the store.\n\"There are a lot of people who have called and had many heartfelt thanks and stuff like that,\" he said. \"You can tell that, basically, it was helping them out so that was our goal.\n\"Hopefully it continues to reach those people and hopefully we get something to even grow a little bit, to reach some people who are not necessarily aware of it right now because they don't have the means to get that information,\" said Price.\nPrice said he will keep making soup to offer as long as he is able, and there is a need. \nInside the store, Mr. Wilson's is taking extra safety precautions, such as taping out areas for customers to shop to maximize safe physical distance between one another. It's also installing glass barriers at the cash register. Mr. Wilson's has decided to not take empty beer bottles for now as well. \nRead more from CBC Newfoundland and Labrador\n"}, {"author": null, "title": "Rents in Regina, Saskatoon expected to increase slightly in 2020: report", "description": "Vacancy rates in both cities have been declining according to CMHC", "url": "http://www.cbc.ca/news/canada/saskatchewan/rents-regina-saskatoon-vacancy-rates-2020-1.5434307", "urlToImage": "https://i.cbc.ca/1.5031438.1563475078!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_780/home-rental-prices.jpg", "publishedAt": ["Jan 21, 2020 7:59 AM CT", "2020-01-21T13:59:00.675Z"], "source": "CBC News", "content": "Rent in Regina and Saskatoon could slightly increase as vacancy rates slowly decrease, according to Canada Mortgage and Housing Corporation's January Rental Market Report for both cities.\nRegina is still recovering from slower economic activity brought on by changes in commodity price volatility, according to Taylor Pardy, senior analyst with the CMHC. \nThe purpose-built apartment vacancy rate in Regina was virtually unchanged in the past year — it was 7.7 per cent in October 2018 and 7.8 per cent in October 2019 — though the report says this is still high compared to the majority of Canadian metropolitan areas. \nThe 2020 Rental Market Predictions and Insights from Rentals.ca forecasts that the vacancy rate may drop in the next few years to 7.3 per cent in 2020 and 6.6 per cent in 2021. As a result, rent may stabilize and potentially increase in 2020. Rent declined 0.2 per cent in 2019. \n\"Barring a more rapid improvement in economic conditions, improvements in the rental market in the Regina CMA are likely to be gradual,\" Pardy said in the Rentals.ca report. \nSaskatoon's vacancy rates dropped more than the most metropolitan areas but is still higher than most cities, according to the CMHC report.\nThe vacancy rate in Saskatoon went from 8.3 per cent in October 2018 to 5.7 per cent in October, 2019. The report said it marks the third year in a row that vacancy rates have moved lower. A population increase has contributed to the lower vacancy rates.\nGoodson Mwale, senior analyst with the Canadian Mortgage and Housing Corporation, told Rentals.ca that average rental rates may increase as vacancy lowers. \nThe report also noted that there were more than 500 rental apartments under construction in the city at the end of 2019, which may slow the decline in the vacancy rate.\nIf you're looking for a place to rent in Saskatoon, you may want to consider look for vacant units. The CMHC report noted that vacant units had a lower average asking rent than occupied units in 2019. \n"}, {"author": "Philip Lee-Shanok", "title": "Condo vacancies rise, rents fall as pandemic crushes GTA's short-term rental market", "description": "A surge in listings, fewer renters means more competition for landlords", "url": "http://www.cbc.ca/news/canada/toronto/will-more-listings-fewer-renters-mean-drop-in-rent-for-condos-1.5551464", "urlToImage": "https://i.cbc.ca/1.5551494.1588283875!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/for-rent.jpg", "publishedAt": ["Apr 30, 2020 7:28 PM ET", "2020-05-01T02:16:09.631Z"], "source": "CBC News", "content": "The GTA's condo rental market has dramatically reversed directions in the course of a single month with a surge in listings since the pandemic hit, real estate watchers say.\nAnd they believe a big drop in Airbnb rentals may be playing a role in this trend.\n\"We're seeing renters pull out of the market,\" said John Pasalis, president of Realosophy Realty Inc. And he says while prospective renters are getting scarce, there has been a spike in the numbers of units for rent.\n\"Especially condominiums, which are high-priced rentals ... over $2,000 a month for a one bedroom,\" Pasalis told CBC Toronto.\n\"So those people are kind of pulling back given the economic uncertainty and the impact on their incomes. And on the flip side, we're seeing landlords — who need to pay the mortgages and property taxes — scramble to put their units on the market.\"\nPasalis says there's been a 25 per cent increase in listings and he thinks that former Airbnb hosts are scrambling to lease out their units. \nHe says investors who bought multiple units to list as short-term vacation rentals are now pivoting to leasing longer term after the Airbnb market collapsed due to the COVID-19 pandemic.\nAnd he says a surge in listings has pushed the condo rental inventory from one-and-a-half months of inventory (MOI) at the end of March to nearly 4 MOI at the end of April.\nAll that new competition for renters has meant a 3.5 per cent drop in average rents for the month of April. Pasalis says he doesn't expect things to return to normal quickly and that may mean a soft rental market for some time.\n\"If immigration starts to decline, which typically happens during a recession, this is also going to weigh on rental demand in the short term,\" he said.\n\"We might see some condo investors take their chips off the table and sell their units.\"\nJaco Joubert has studied the effects of Airbnb on condo rental vacancies. He photographed 15 downtown condo towers at night over the course of a year to monitor when the lights were on to determine whether or not they were occupied.\nAt that time, he calculated that 5.6 per cent were vacant. He thinks that may have more than doubled in some buildings to as high as 13 per cent.\nAnd he says he's noticed rents have declined by a few hundred dollars.\n\"There are some rentals that are listing for quite a bit lower than it would have maybe a year ago,\" said Joubert, adding that price expectations are likely moving lower.\nFor example, he says he found a studio condominium listed in the downtown area that probably would have gone for around $2,000. It's now listed as low as $1,850 a month.\nCouncillor calls on city to mull vacancy tax after man does own study of empty condos\n\"People are getting more desperate to get somebody[to rent their units]. There's quite a few listings in the city overall, and not a lot of people want to move right now.\"\nBut the Advocacy Centre for Tenants Ontario (ACTO) says it may be premature to say whether the rental market is expected to slow down in the post-COVID-19 period.\nAnd the Canada Mortgage and Housing Corporation, which calculates vacancy rates across the country, has not yet released a report.\n"}, {"author": "Jeff Walters", "title": "Homeless population in Red Lake, Ont. declines; hopes to be model for Kenora", "description": "Goal is to eradicate homelessness from northwestern Ontario town in just a couple of years", "url": "http://www.cbc.ca/news/canada/thunder-bay/red-lake-kenora-homeless-1.5541687", "urlToImage": "https://i.cbc.ca/1.5314728.1587591969!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_780/henry-wall.jpg", "publishedAt": ["Apr 23, 2020 7:30 AM ET", "2020-04-23T18:18:00.757Z"], "source": "CBC News", "content": "The success of a program in Red Lake, Ont., to get people off the streets and into transitional housing, should and can be replicated in other communities across the northwest, says the head of the Kenora District Services Board (KDSB).\nHenry Wall, the CAO of the KDSB, said over the past few years, the priority in the community at the end of Highway 105 was to get people living homeless into transitional housing. That housing is affiliated with the Red Lake homeless shelter.\n\"[The transitional housing is] for individuals that are ready to start moving on, and so, it's part of the shelter program, but it's one step removed from having to be in a shelter,\" he said.\nThe program is successful, he said, with nearly half of those who identified as homeless, no longer at the shelter. Wall said the number of people staying overnight at the facility is down to about five.\nWall said the goal is to learn from the experience in Red Lake, and attempt to replicate it in Kenora, which has a much higher homeless population.\n\"In the last five years, we've really had to look at how could we end homelessness. What are the missing links?\"\nA big reason for the success, Wall said, is partnerships with groups in the community. In Red Lake, the district social services board worked with the Red Lake Non-Profit Housing Corporation to secure an existing building and renovate it. \nCommunity leadership, including mayor and council, has made the success possible, he said, pointing to re-zoning a building that was ideal for a shelter.\nShelters in the northwest are busy. Facilities in Red Lake, Sioux Lookout, and Kenora had 17,000 nightly stays in 2019. About 9,000 of those stays were in Kenora.\nThe number of young people needing a place to stay has gone up sharply, Wall said, with 544 people between 16 and 24 needing a place overnight.\nWall said one other factor is people, particularly women, leaving northern communities who have no place to go.\nThere are many \"numbers of people fleeing violence, ending up in urban centres, who have no home.\"\nHe said some are also fleeing human trafficking, and need a safe place to go.\n\"How do we ensure that when families come to the shelter for help, that help is there, that the programs do what they need to do to support families, in particular women across our region.\"\nWall said the KDSB has helped create new housing for women in Red Lake, working with the Red Lake New Start for Women shelter to build a brand new facility. The building is about a year away from completion.\nIt's \"a thing that was only dreamed of a couple of years ago,\" he said.\n\"We're starting to see people shift, that we are reducing the number of individuals that are homeless in the community.\"\n\"If things keep going the way things are, we are quite confident that in Red Lake, in the coming years, we will have almost ended homelessness.\"\nWall said the solution comes with a price, with the KDSB spending about $2.9 million annually on programming and maintenance of transitional housing.\nIn the past three years, KDSB has supported about $40 million of capital investment for housing related projects.\nHe said other projects include transitional housing in Kenora, along with a bail-housing program.\nWall said while it could take a decade, he hopes Kenora is in the same situation, to eradicate homelessness as Red Lake is in now.\n"}, {"author": null, "title": null, "description": null, "url": "http://www.cbc.ca/player/play/2664936812", "urlToImage": null, "publishedAt": null, "source": null, "content": null}]